#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= A vers\u00e3o do atributo n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributeVersionIsInvalid= O valor da vers\u00e3o do atributo n\u00e3o \u00e9 v\u00e1lido. O valor v\u00e1lido \u00e9 1.0.

Error.xRevision.AttributeVersionReferencePIDNotPresent= O atributo referencePID n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= O atributo referencePID \u00e9 nulo ou vazio na entrada.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= N\u00e3o \u00e9 poss\u00edvel criar um gr\u00e1fico XRevision nesta refer\u00eancia, porque ele j\u00e1 est\u00e1 anexado a ela.
Error.xRevision.CannotCreateXRevGraphModelAttached= N\u00e3o \u00e9 poss\u00edvel criar um gr\u00e1fico XRevision nesta refer\u00eancia, porque um modelo j\u00e1 est\u00e1 anexado a ele.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= O atributo xRevisionElementPID n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= O atributo xRevisionElementPID \u00e9 nulo ou vazio na entrada.
Error.xRevision.AttributeXRevElementPIDNotValid= O elemento xRevision physicalid n\u00e3o \u00e9 v\u00e1lido na entrada.

Error.xRevision.AttributeAllocationsIsNotPresent= As aloca\u00e7\u00f5es de atributos n\u00e3o est\u00e3o presentes na entrada.
Error.xRevision.AttributeAllocationsIsNullOREmpty= As aloca\u00e7\u00f5es de atributos s\u00e3o nulas ou vazias na entrada.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= O allocationPIDs do atributo n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= O allocationPIDs do atributo \u00e9 nulo ou vazio na entrada.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Pelo menos um dos physicalid de aloca\u00e7\u00e3o na entrada \u00e9 nulo ou vazio.
Error.xRevision.MultiAllocationIsNotSupported= V\u00e1rias aloca\u00e7\u00f5es para cada elemento xRevision ainda n\u00e3o t\u00eam suporte.
Error.xRevision.AllocationPIDIsNotValid= A aloca\u00e7\u00e3o fornecida na entrada n\u00e3o \u00e9 v\u00e1lida ou n\u00e3o faz parte de um gr\u00e1fico xRevision.
Error.xRevision.xRevElementAlreadyHasAllocation= O elemento xRevision j\u00e1 tem aloca\u00e7\u00f5es.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= O atributo xRevisionElementPIDs n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= O atributo xRevisionElementPIDs \u00e9 nulo ou vazio na entrada.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Pelo menos um dos elementos xRevision physicalid na entrada \u00e9 nulo ou vazio.
Error.xRevision.XRevisionElementPIDNotValid= Este elemento xRevision physicalid n\u00e3o \u00e9 v\u00e1lido.

Error.xRevision.AttributeDeallocationsIsNotPresent= Desaloca\u00e7\u00f5es de atributos n\u00e3o est\u00e3o presentes na entrada.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= O atributo desaloca\u00e7\u00f5es \u00e9 nulo ou vazio na entrada.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= O atributo deallocationPIDs n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= O atributo deallocationPIDs \u00e9 nulo ou vazio na entrada.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Pelo menos um dos physicalid de desaloca\u00e7\u00e3o na entrada \u00e9 nulo ou vazio.
Error.xRevision.MultiDeallocationIsNotSupported= V\u00e1rias desaloca\u00e7\u00f5es de cada elemento xRevision ainda n\u00e3o s\u00e3o suportadas.
Error.xRevision.DeallocationPIDIsNotValid= A desaloca\u00e7\u00e3o fornecida na entrada n\u00e3o \u00e9 v\u00e1lida ou n\u00e3o faz parte de um gr\u00e1fico xRevision.
Error.xRevision.xRevElementDoesNotHaveAllocation= Este elemento xRevision n\u00e3o tem nenhuma aloca\u00e7\u00e3o.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= O atributo xRevisionGraphsToAttach n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= O atributo xRevisionGraphsToAttach est\u00e1 vazio na entrada.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= O atributo reusableGraphReferencePID n\u00e3o est\u00e1 presente na entrada.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= O atributo reusableGraphReferencePID \u00e9 nulo ou vazio na entrada.
Error.xRevision.AttachExistingXRevGraphFailed= A anexa\u00e7\u00e3o do gr\u00e1fico xRevision existente de uma refer\u00eancia a outra falhou para uma das refer\u00eancias na entrada.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= N\u00e3o \u00e9 poss\u00edvel anexar um XRevision Graph para uma das refer\u00eancias, porque a refer\u00eancia j\u00e1 possui um XRevision Graph.
Error.xRevision.AllocationCrossesExistingOne= Esta aloca\u00e7\u00e3o cruza uma outra j\u00e1 existente. Tente alocar para uma vers\u00e3o de modelo superior a esta.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= N\u00e3o \u00e9 poss\u00edvel executar a aloca\u00e7\u00e3o autom\u00e1tica durante a opera\u00e7\u00e3o de escopo definido.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= Nenhuma variante encontrada para o contexto de configura\u00e7\u00e3o durante a opera\u00e7\u00e3o de escopo definido.


Error.xRevision.ParentNotInFrozen= O pai do elemento xRevision atual tem status Preliminar ou Em andamento; promover \u00e9 proibido.
Error.xRevision.AllocatedMVNotReleased= A vers\u00e3o do modelo alocada ao elemento xRevision atual n\u00e3o foi liberada, promover \u00e9 proibido.
Error.xRevision.FoundIncompleteChange= H\u00e1 A\u00e7\u00f5es de Mudan\u00e7a incompletas usando este elemento xRevision, promover \u00e9 proibido.
Error.xRevision.ChildFrozen= O filho do elemento xRevision atual tem pelo menos o status Congelado; rebaixar \u00e9 proibido.

Error.xRevision.xRevisionDeleteAction= Um elemento do gr\u00e1fico xRevision n\u00e3o pode ser exclu\u00eddo ou a refer\u00eancia prim\u00e1ria n\u00e3o pode ser definida.
Error.xRevision.PrimaryReferenceDelete= \u00c9 proibido tentar excluir a refer\u00eancia prim\u00e1ria do gr\u00e1fico.
Error.xRevision.PrimaryReferenceDeleteMulti= \u00c9 proibido tentar excluir uma refer\u00eancia prim\u00e1ria que tenha um gr\u00e1fico com v\u00e1rios elementos xRevision.
Error.xRevision.DeleteCollabSpace= O elemento xRevision n\u00e3o est\u00e1 Em andamento e n\u00e3o est\u00e1 no mesmo espa\u00e7o colaborativo que o usu\u00e1rio; a exclus\u00e3o \u00e9 proibida.
Error.xRevision.FrozenxRev= O elemento xRevision est\u00e1 em um estado muito avan\u00e7ado para permitir a exclus\u00e3o.
Error.xRevision.DeleteOneSingleElement= Mais de uma refer\u00eancia est\u00e1 usando este gr\u00e1fico com um \u00fanico elemento; excluir n\u00e3o \u00e9 permitido.
Error.xRevision.DeleteFirstElement= Mais de uma refer\u00eancia est\u00e1 usando este gr\u00e1fico; excluir o primeiro elemento n\u00e3o \u00e9 permitido.
Error.xRevision.DeleteOneElement= Um elemento xRevision \u00e9 usado e n\u00e3o pode ser exclu\u00eddo.
Error.xRevision.ReferenceDeleteChildScope= \u00c9 proibido tentar excluir uma refer\u00eancia cujo gr\u00e1fico cont\u00e9m gr\u00e1ficos filhos.
Error.xRevision.GraphDeleteChildScope= \u00c9 proibido tentar excluir um gr\u00e1fico que cont\u00e9m gr\u00e1ficos filhos.
Error.xRevision.CreateGraphPhyRevs= N\u00e3o \u00e9 poss\u00edvel criar um gr\u00e1fico para o item atual porque ele j\u00e1 tem revis\u00f5es f\u00edsicas.
Error.xRevision.CreateGraphNoExistCfg= N\u00e3o \u00e9 poss\u00edvel criar um gr\u00e1fico para o item atual porque ele n\u00e3o existe ou n\u00e3o \u00e9 configur\u00e1vel.
Error.xRevision.ReuseGraphDelSource= N\u00e3o \u00e9 poss\u00edvel reutilizar um gr\u00e1fico existente para o item atual porque o item de origem n\u00e3o existe.
Error.xRevision.ReuseGraphSourceNoAccess= N\u00e3o \u00e9 poss\u00edvel reutilizar um gr\u00e1fico existente para o item atual porque o usu\u00e1rio atual n\u00e3o tem acesso ao item de origem.
Error.xRevision.ReuseGraphSourceNoCfg= N\u00e3o \u00e9 poss\u00edvel reutilizar um gr\u00e1fico existente para o item atual porque o item de origem n\u00e3o \u00e9 configur\u00e1vel.
Error.xRevision.ReuseGraphSourceNoGraph= N\u00e3o \u00e9 poss\u00edvel reutilizar um gr\u00e1fico existente para o item atual porque o item de origem n\u00e3o tem um gr\u00e1fico.
