#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= Verze atributu nen\u00ed ve vstupu obsa\u017eena.
Error.xRevision.AttributeVersionIsInvalid= Hodnota verze atributu nen\u00ed platn\u00e1. Platn\u00e1 hodnota je 1.0.

Error.xRevision.AttributeVersionReferencePIDNotPresent= Hodnota referencePID atributu nen\u00ed ve vstupu obsa\u017eena.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= Hodnota referencePID atributu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= Na t\u00e9to referenci nen\u00ed mo\u017en\u00e9 vytvo\u0159it graf XRevision, proto\u017ee je k n\u011bmu ji\u017e p\u0159ipojena.
Error.xRevision.CannotCreateXRevGraphModelAttached= Na t\u00e9to referenci nen\u00ed mo\u017en\u00e9 vytvo\u0159it graf XRevision, proto\u017ee je k n\u011bmu ji\u017e p\u0159ipojen model.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= Hodnota xRevisionElementPID atributu nen\u00ed ve vstupu obsa\u017eena.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= Hodnota xRevisionElementPID atributu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.AttributeXRevElementPIDNotValid= Hodnota physicalid prvku xRevision nen\u00ed ve vstupu platn\u00e1.

Error.xRevision.AttributeAllocationsIsNotPresent= P\u0159id\u011blen\u00ed atributu nejsou ve vstupu obsa\u017eena.
Error.xRevision.AttributeAllocationsIsNullOREmpty= P\u0159id\u011blen\u00ed atributu jsou ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= Hodnoty allocationPID atributu nejsou ve vstupu obsa\u017eeny.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= Hodnota allocationPID atributu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Alespo\u0148 jedna z hodnot physicalid u p\u0159id\u011blen\u00ed je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.MultiAllocationIsNotSupported= V\u00edce p\u0159id\u011blen\u00ed ke ka\u017ed\u00e9mu prvku xRevision nen\u00ed zat\u00edm podporov\u00e1no.
Error.xRevision.AllocationPIDIsNotValid= P\u0159id\u011blen\u00ed uveden\u00e9 ve vstupu nen\u00ed platn\u00e9 nebo nen\u00ed sou\u010d\u00e1st\u00ed grafu xRevision.
Error.xRevision.xRevElementAlreadyHasAllocation= Prvek xRevision u\u017e m\u00e1 p\u0159id\u011blen\u00ed.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= Hodnoty xRevisionElementPID atributu nejsou ve vstupu obsa\u017eeny.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= Hodnoty xRevisionElementPID atributu jsou ve vstupu null nebo pr\u00e1zdn\u00e9.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Alespo\u0148 jedna hodnota physicalid prvku xRevision je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.XRevisionElementPIDNotValid= Tato hodnota physicalid prvku xRevision nen\u00ed platn\u00e1.

Error.xRevision.AttributeDeallocationsIsNotPresent= Zru\u0161en\u00e1 p\u0159id\u011blen\u00ed atributu nejsou ve vstupu obsa\u017eena.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= Zru\u0161en\u00e1 p\u0159id\u011blen\u00ed atributu jsou ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= Hodnoty deallocationPID atributu nejsou ve vstupu obsa\u017eeny.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= Hodnoty deallocationPID atributu jsou ve vstupu null nebo pr\u00e1zdn\u00e9.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Alespo\u0148 jedna z hodnot physicalid u zru\u0161en\u00ed p\u0159i\u0159azen\u00ed je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.MultiDeallocationIsNotSupported= V\u00edce zru\u0161en\u00ed p\u0159i\u0159azen\u00ed u ka\u017ed\u00e9ho prvku xRevision nen\u00ed zat\u00edm podporov\u00e1no.
Error.xRevision.DeallocationPIDIsNotValid= Zru\u0161en\u00ed p\u0159i\u0159azen\u00ed uveden\u00e9 ve vstupu nen\u00ed platn\u00e9 nebo nen\u00ed sou\u010d\u00e1st\u00ed grafu xRevision.
Error.xRevision.xRevElementDoesNotHaveAllocation= Tento prvek xRevision nem\u00e1 \u017e\u00e1dn\u00e9 p\u0159i\u0159azen\u00ed.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= Hodnota xRevisionGraphsToAttach atributu nen\u00ed ve vstupu obsa\u017eena.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= Hodnota xRevisionGraphsToAttach atributu je ve vstupu pr\u00e1zdn\u00e1.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= Hodnota reusableGraphReferencePID atributu nen\u00ed ve vstupu obsa\u017eena.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= Hodnota reusableGraphReferencePID atributu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.AttachExistingXRevGraphFailed= P\u0159ipojen\u00ed st\u00e1vaj\u00edc\u00edho grafu xRevision z jedn\u00e9 reference ke druh\u00e9 se nezda\u0159ilo kv\u016fli jedn\u00e9 z referenc\u00ed ve vstupu.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= Graf XRevision nen\u00ed mo\u017en\u00e9 u jedn\u00e9 z referenc\u00ed p\u0159ipojit, proto\u017ee reference u\u017e graf XRevision obsahuje.
Error.xRevision.AllocationCrossesExistingOne= Toto p\u0159i\u0159azen\u00ed se k\u0159\u00ed\u017e\u00ed se st\u00e1vaj\u00edc\u00edm. Pokuste se prov\u00e9st p\u0159i\u0159azen\u00ed k vy\u0161\u0161\u00ed verzi modelu, ne\u017e je tato.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= Automatick\u00e9 p\u0159i\u0159azen\u00ed se b\u011bhem operace nastaven\u00ed m\u011b\u0159\u00edtka nepoda\u0159ilo prov\u00e9st.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= Pro kontext konfigurace nebyly b\u011bhem operace nastaven\u00ed m\u011b\u0159\u00edtka nalezeny \u017e\u00e1dn\u00e9 varianty.


Error.xRevision.ParentNotInFrozen= Nad\u0159azen\u00e1 polo\u017eka aktu\u00e1ln\u00edho prvku xRevision je ve stavu P\u0159edb\u011b\u017en\u00fd nebo Prob\u00edh\u00e1 pr\u00e1ce, zv\u00fd\u0161en\u00ed stavu dokon\u010den\u00ed je zak\u00e1z\u00e1no.
Error.xRevision.AllocatedMVNotReleased= Verze modelu p\u0159i\u0159azen\u00e1 aktu\u00e1ln\u00edmu prvku xRevision nen\u00ed uvoln\u011bn\u00e1, zv\u00fd\u0161en\u00ed stavu dokon\u010den\u00ed je zak\u00e1z\u00e1no.
Error.xRevision.FoundIncompleteChange= Existuj\u00ed ne\u00fapln\u011b akce zm\u011bny pou\u017e\u00edvaj\u00edc\u00ed tento prvek xRevision, zv\u00fd\u0161en\u00ed stavu dokon\u010den\u00ed je zak\u00e1z\u00e1no.
Error.xRevision.ChildFrozen= Pod\u0159\u00edzen\u00e1 polo\u017eka aktu\u00e1ln\u00edho prvku xRevision je minim\u00e1ln\u011b ve stavu Zmrazeno, sn\u00ed\u017een\u00ed stavu dokon\u010den\u00ed je zak\u00e1z\u00e1no.

Error.xRevision.xRevisionDeleteAction= Jeden prvek grafu xRevision nen\u00ed mo\u017en\u00e9 odstranit nebo nelze nastavit prim\u00e1rn\u00ed referenci.
Error.xRevision.PrimaryReferenceDelete= Pokus odstranit prim\u00e1rn\u00ed referenci grafu je zak\u00e1z\u00e1n.
Error.xRevision.PrimaryReferenceDeleteMulti= Pokus odstranit prim\u00e1rn\u00ed referenci, kter\u00e1 obsahuje graf s v\u00edce elementy xRevision, je zak\u00e1z\u00e1n.
Error.xRevision.DeleteCollabSpace= Prvek xRevision nen\u00ed ve stavu Prob\u00edh\u00e1 pr\u00e1ce a nen\u00ed ve stejn\u00e9m prostoru pro spolupr\u00e1ci jako u\u017eivatel, odstran\u011bn\u00ed je zak\u00e1z\u00e1no.
Error.xRevision.FrozenxRev= Prvek xRevision je ve stavu, kter\u00fd je p\u0159\u00edli\u0161 pokro\u010dil\u00fd, ne\u017e aby bylo mo\u017en\u00e9 jeho odstran\u011bn\u00ed.
Error.xRevision.DeleteOneSingleElement= Tento graf s jedn\u00edm prvkem pou\u017e\u00edv\u00e1 v\u00edce ne\u017e jedna reference, odstran\u011bn\u00ed nen\u00ed dovoleno.
Error.xRevision.DeleteFirstElement= Tento graf s jedn\u00edm prvkem pou\u017e\u00edv\u00e1 v\u00edce ne\u017e jedna reference, odstran\u011bn\u00ed prvn\u00edho prvku nen\u00ed dovoleno.
Error.xRevision.DeleteOneElement= Pou\u017e\u00edv\u00e1 se jeden prvek xRevision a odstran\u011bn\u00ed nen\u00ed mo\u017en\u00e9.
Error.xRevision.ReferenceDeleteChildScope= Pokus o odstran\u011bn\u00ed reference, jej\u00ed\u017e graf m\u00e1 pod\u0159\u00edzen\u00e9 grafy, je zak\u00e1z\u00e1n.
Error.xRevision.GraphDeleteChildScope= Pokud o odstran\u011bn\u00ed grafu, kter\u00fd m\u00e1 pod\u0159\u00edzen\u00e9 grafy, je zak\u00e1z\u00e1n.
Error.xRevision.CreateGraphPhyRevs= Nelze vytvo\u0159it graf pro aktu\u00e1ln\u00ed polo\u017eku, proto\u017ee ji\u017e obsahuje fyzick\u00e9 revize.
Error.xRevision.CreateGraphNoExistCfg= Nelze vytvo\u0159it graf pro aktu\u00e1ln\u00ed polo\u017eku, proto\u017ee neexistuje nebo nen\u00ed konfigurovateln\u00e1.
Error.xRevision.ReuseGraphDelSource= Nelze znovu pou\u017e\u00edt existuj\u00edc\u00ed graf pro aktu\u00e1ln\u00ed polo\u017eku, zdrojov\u00e1 polo\u017eka neexistuje.
Error.xRevision.ReuseGraphSourceNoAccess= Nelze znovu pou\u017e\u00edt existuj\u00edc\u00ed graf pro aktu\u00e1ln\u00ed polo\u017eku, aktu\u00e1ln\u00ed u\u017eivatel nem\u00e1 p\u0159\u00edstup ke zdrojov\u00e9 polo\u017ece.
Error.xRevision.ReuseGraphSourceNoCfg= Nelze znovu pou\u017e\u00edt existuj\u00edc\u00ed graf pro aktu\u00e1ln\u00ed polo\u017eku, zdrojov\u00e1 polo\u017eka nen\u00ed konfigurovateln\u00e1.
Error.xRevision.ReuseGraphSourceNoGraph= Nelze znovu pou\u017e\u00edt existuj\u00edc\u00ed graf pro aktu\u00e1ln\u00ed polo\u017eku, zdrojov\u00e1 polo\u017eka nem\u00e1 graf.
