#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= Girdide \u00f6znitelik s\u00fcr\u00fcm\u00fc mevcut de\u011fil.
Error.xRevision.AttributeVersionIsInvalid= \u00d6znitelik s\u00fcr\u00fcm\u00fc de\u011feri ge\u00e7erli de\u011fil. Ge\u00e7erli de\u011fer 1.0'd\u0131r.

Error.xRevision.AttributeVersionReferencePIDNotPresent= Girdide referencePID \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= Girdideki referencePID \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= Bu referansa zaten ekli oldu\u011fundan bu referansta XRevision Grafi\u011fi olu\u015fturulamaz.
Error.xRevision.CannotCreateXRevGraphModelAttached= Bu referansa zaten bir model ekli oldu\u011fundan bu referansta XRevision Grafi\u011fi olu\u015fturulamaz.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= Girdide xRevisionElementPID \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= Girdideki xRevisionElementPID \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.AttributeXRevElementPIDNotValid= Girdideki xRevision Unsuru physicalid ge\u00e7erli de\u011fil.

Error.xRevision.AttributeAllocationsIsNotPresent= Girdideki allocations \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeAllocationsIsNullOREmpty= Girdideki allocations \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= Girdide allocationPIDs \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= Girdideki allocationPIDs \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Girdideki en az bir tahsis physicalid'si de\u011fersiz veya bo\u015f.
Error.xRevision.MultiAllocationIsNotSupported= Her xRevision Unsuru'na y\u00f6nelik birden fazla tahsis hen\u00fcz desteklenmiyor.
Error.xRevision.AllocationPIDIsNotValid= Girdide sa\u011flanan tahsis ge\u00e7erli de\u011fil veya bir xRevision Grafi\u011fi'nin par\u00e7as\u0131 de\u011fil.
Error.xRevision.xRevElementAlreadyHasAllocation= xRevision Unsuru'nda zaten tahsisler var.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= Girdide xRevisionElementPIDs \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= Girdideki xRevisionElementPIDs \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Girdideki en az bir xRevision Unsuru physicalid de\u011fersiz veya bo\u015f.
Error.xRevision.XRevisionElementPIDNotValid= Bu xRevision Unsuru physicalid ge\u00e7ersiz.

Error.xRevision.AttributeDeallocationsIsNotPresent= Girdide tahsis kald\u0131rma \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= Girdideki tahsis kald\u0131rma \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= Girdide deallocationPIDs \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= Girdideki deallocationPIDs \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Girdideki en az bir tahsisi kald\u0131rma physicalid'si de\u011fersiz veya bo\u015f.
Error.xRevision.MultiDeallocationIsNotSupported= Her xRevision Unsuru'ndan birden fazla tahsis kald\u0131rma hen\u00fcz desteklenmiyor.
Error.xRevision.DeallocationPIDIsNotValid= Girdide sa\u011flanan tahsisi kald\u0131rma ge\u00e7ersiz veya bir xRevision Grafi\u011fi'nin par\u00e7as\u0131 de\u011fil.
Error.xRevision.xRevElementDoesNotHaveAllocation= xRevision Unsuru herhangi bir tahsise sahip de\u011fil.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= Girdide xRevisionGraphsToAttach mevcut de\u011fil.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= Girdideki xRevisionGraphsToAttach \u00f6zniteli\u011fi bo\u015f.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= Girdide reusableGraphReferencePID \u00f6zniteli\u011fi mevcut de\u011fil.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= Girdideki reusableGraphReferencePID \u00f6zniteli\u011fi de\u011fersiz veya bo\u015f.
Error.xRevision.AttachExistingXRevGraphFailed= Girdideki referanslardan birinde bir referanstan di\u011ferine mevcut xRevision Grafi\u011fi eklenemedi.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= Referansta zaten xRevision Grafi\u011fi oldu\u011fundan referanslardan birine xRevision Grafi\u011fi eklenemiyor.
Error.xRevision.AllocationCrossesExistingOne= Bu tahsis mevcut bir tahsisle \u00e7ak\u0131\u015f\u0131yor. L\u00fctfen bundan daha y\u00fcksek bir Model S\u00fcr\u00fcm\u00fc'ne tahsis etmeyi deneyin.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= Kapsam ayarlama i\u015flemi s\u0131ras\u0131nda otomatik tahsis yap\u0131lam\u0131yor.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= Kapsam ayarlama i\u015flemi s\u0131ras\u0131nda konfig\u00fcrasyon ba\u011flam\u0131na y\u00f6nelik varyant bulunamad\u0131.


Error.xRevision.ParentNotInFrozen= Mevcut xRevision unsurunun \u00fcst \u00f6\u011fesi \u00d6n veya \u00c7al\u0131\u015fmada durumunda, y\u00fckseltmeye izin verilmiyor.
Error.xRevision.AllocatedMVNotReleased= Mevcut xRevision unsuruna tahsis edilen Model S\u00fcr\u00fcm\u00fc serbest b\u0131rak\u0131lmad\u0131, y\u00fckseltme i\u015flemine izin verilmiyor.
Error.xRevision.FoundIncompleteChange= Bu xRevision unsurunu kullanan tamamlanmam\u0131\u015f De\u011fi\u015fiklik Eylemleri var, y\u00fckseltme i\u015flemine izin verilmiyor.
Error.xRevision.ChildFrozen= Mevcut xRevision unsurunun alt \u00f6\u011fesi en az bir Donduruldu durumuna sahip, d\u00fc\u015f\u00fcrme i\u015flemine izin verilmiyor.

Error.xRevision.xRevisionDeleteAction= xRevision grafi\u011finin bir unsuru silinemiyor veya birincil referans ayarlanam\u0131yor.
Error.xRevision.PrimaryReferenceDelete= Grafi\u011fin birincil referans\u0131n\u0131 silme i\u015flemine izin verilmiyor.
Error.xRevision.PrimaryReferenceDeleteMulti= Birden fazla xRevision unsuru olan bir grafi\u011fe sahip bir birincil referans\u0131 silme i\u015flemine izin verilmiyor.
Error.xRevision.DeleteCollabSpace= xRevision unsuru \u00c7al\u0131\u015fmada durumunda de\u011fil ve kullan\u0131c\u0131yla ayn\u0131 i\u015f birli\u011fi alan\u0131nda de\u011fil, silme i\u015flemine izin verilmiyor.
Error.xRevision.FrozenxRev= xRevision unsuru silmeye izin vermek i\u00e7in fazla ilerlemi\u015f durumda.
Error.xRevision.DeleteOneSingleElement= Birden fazla referans bu grafi\u011fi tek unsur ile kullan\u0131yor, silme i\u015flemine izin verilmiyor.
Error.xRevision.DeleteFirstElement= Birden fazla referans bu grafi\u011fi kullan\u0131yor, ilk unsuru silme i\u015flemine izin verilmiyor.
Error.xRevision.DeleteOneElement= Bir xRevision unsuru kullan\u0131l\u0131yor ve silinemez.
Error.xRevision.ReferenceDeleteChildScope= Grafi\u011fin alt \u00f6\u011fe grafiklerine sahip oldu\u011fu bir referans silinemez.
Error.xRevision.GraphDeleteChildScope= Grafi\u011fin alt \u00f6\u011fe grafiklerine sahip oldu\u011fu bir grafik silinemez.
Error.xRevision.CreateGraphPhyRevs= Mevcut \u00f6\u011fe i\u00e7in grafik olu\u015fturulam\u0131yor, \u00f6\u011fe zaten fiziksel revizyonlara sahip.
Error.xRevision.CreateGraphNoExistCfg= Mevcut \u00f6\u011fe i\u00e7in grafik olu\u015fturulam\u0131yor, mevcut de\u011fil veya yap\u0131land\u0131r\u0131labilir de\u011fil.
Error.xRevision.ReuseGraphDelSource= Mevcut \u00f6\u011fe i\u00e7in var olan bir grafik kullan\u0131lamaz, kaynak \u00f6\u011fe mevcut de\u011fil.
Error.xRevision.ReuseGraphSourceNoAccess= Mevcut \u00f6\u011fe i\u00e7in var olan bir grafik kullan\u0131lamaz, mevcut kullan\u0131c\u0131n\u0131n kaynak \u00f6\u011feye eri\u015fimi yok.
Error.xRevision.ReuseGraphSourceNoCfg= Mevcut \u00f6\u011fe i\u00e7in var olan bir grafik kullan\u0131lamaz, kaynak \u00f6\u011fe yap\u0131land\u0131r\u0131labilir de\u011fil.
Error.xRevision.ReuseGraphSourceNoGraph= Mevcut \u00f6\u011fe i\u00e7in var olan bir grafik kullan\u0131lamaz, kaynak \u00f6\u011feni bir grafi\u011fi yok.
