#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= Wersja atrybutu nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeVersionIsInvalid= Wersja atrybutu nie jest prawid\u0142owa. Prawid\u0142owa warto\u015b\u0107 to 1.0.

Error.xRevision.AttributeVersionReferencePIDNotPresent= Atrybut referencePID nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= Atrybut referencePID ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= Nie jest mo\u017cliwe utworzenie wykresu XRevision dla tego odniesienia, poniewa\u017c jest ju\u017c ju\u017c do niego za\u0142\u0105czony.
Error.xRevision.CannotCreateXRevGraphModelAttached= Nie jest mo\u017cliwe utworzenie wykresu XRevision dla tego odniesienia, poniewa\u017c jest ju\u017c ju\u017c do niego za\u0142\u0105czony Model.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= Atrybut xRevisionElementPID nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= Atrybut xRevisionElementPID ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste.
Error.xRevision.AttributeXRevElementPIDNotValid= Element xRevision physicalid nie jest prawid\u0142owy w danych wej\u015bciowych.

Error.xRevision.AttributeAllocationsIsNotPresent= Atrybut allocations nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeAllocationsIsNullOREmpty= Atrybut allocations ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= Atrybut allocationPIDs nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= Atrybut allocationPIDs ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Co najmniej jedno z przypisanych physicalid w danych wej\u015bciowych ma warto\u015b\u0107 zerow\u0105 lub jest puste
Error.xRevision.MultiAllocationIsNotSupported= Nie jest jeszcze dost\u0119pna obs\u0142uga wielu przypisa\u0144 do ka\u017cdego elementu xRevision.
Error.xRevision.AllocationPIDIsNotValid= Przypisanie wskazane w danych wej\u015bciowych jest nieprawid\u0142owe lub nie stanowi cz\u0119\u015bci wykresu xRevision.
Error.xRevision.xRevElementAlreadyHasAllocation= Element xRevision ma ju\u017c przypisania.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= Atrybut xRevisionElementPIDs nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= Atrybut xRevisionElementPIDs ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Co najmniej jeden element xRevision physicalid w danych wej\u015bciowych ma warto\u015b\u0107 zerow\u0105 lub jest pusty.
Error.xRevision.XRevisionElementPIDNotValid= Element xRevision physicalid nie jest prawid\u0142owy.

Error.xRevision.AttributeDeallocationsIsNotPresent= Atrybut deallocations nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= Atrybut deallocations ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= Atrybut deallocationPIDs nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= Atrybut deallocationPIDs ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Przynajmniej jedno deallocation physicalid w danych wej\u015bciowych ma warto\u015b\u0107 zerow\u0105 lub jest puste.
Error.xRevision.MultiDeallocationIsNotSupported= Nie s\u0105 jeszcze obs\u0142ugiwane wielokrotne wy\u0142\u0105czenia przypisania dla ka\u017cdego elementu xRevision.
Error.xRevision.DeallocationPIDIsNotValid= Wy\u0142\u0105czenie przypisania w danych wej\u015bciowych nie jest prawid\u0142owe lub nie stanowi cz\u0119\u015bci wykresu xRevision.
Error.xRevision.xRevElementDoesNotHaveAllocation= Element xRevision nie ma przypisania.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= Atrybut xRevisionGraphsToAttach nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= Atrybut xRevisionGraphsToAttach jest pusty w danych wej\u015bciowych.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= Atrybut reusableGraphReferencePID nie wyst\u0119puje w danych wej\u015bciowych.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= Atrybut reusableGraphReferencePID ma warto\u015b\u0107 zerow\u0105 lub jest pusty w danych wej\u015bciowych.
Error.xRevision.AttachExistingXRevGraphFailed= Nie powiod\u0142o si\u0119 za\u0142\u0105czenie istniej\u0105cego wykresu xRevision z jednego odniesienia do drugiego odniesienia dla jednego z odniesie\u0144 w danych wej\u015bciowych.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= Nie jest mo\u017cliwe za\u0142\u0105czenie wykresu XRevision do jednego z odniesie\u0144, poniewa\u017c odniesienie ma ju\u017c wykres XRevision.
Error.xRevision.AllocationCrossesExistingOne= Przypisanie to jest krzy\u017cowe wzgl\u0119dem istniej\u0105cego. Spr\u00f3buj wykona\u0107 przypisanie do wy\u017cszej wersji modelu ni\u017c ta.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= Nie powiod\u0142o si\u0119 wykonanie automatycznego przypisania podczas operacji okre\u015blenia zakresu.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= Nie znaleziono wariant\u00f3w dla kontekstu konfiguracji podczas operacji okre\u015blenia zakresu.


Error.xRevision.ParentNotInFrozen= Element nadrz\u0119dny dla bie\u017c\u0105cego elementu xRevision ma stan Wst\u0119pny lub W toku, promocja jest zabroniona.
Error.xRevision.AllocatedMVNotReleased= Wersja modelu przypisanego do bie\u017c\u0105cego elementu xRevision nie jest zwolniona, promocja jest zabroniona.
Error.xRevision.FoundIncompleteChange= S\u0105 obecne niezako\u0144czone zmiany akcji wykorzystuj\u0105ce dany element xRevision, promocja jest zabroniona.
Error.xRevision.ChildFrozen= Element podrz\u0119dny bie\u017c\u0105cego elementu xRevision ma przynajmniej stan Zamro\u017cony, degradacja jest zabroniona.

Error.xRevision.xRevisionDeleteAction= Jeden element wykresu xRevision nie mo\u017ce zosta\u0107 usuni\u0119ty lub nie jest mo\u017cliwe okre\u015blenie podstawowego odniesienia.
Error.xRevision.PrimaryReferenceDelete= Pr\u00f3ba usuni\u0119cia podstawowego odniesienia dla wykresu jest zabroniona.
Error.xRevision.PrimaryReferenceDeleteMulti= Pr\u00f3ba usuni\u0119cia podstawowego odniesienia z wykresem obejmuj\u0105cym liczne elementy xRevision jest zabroniona.
Error.xRevision.DeleteCollabSpace= Element xRevision nie ma stanu W toku i nie znajduje si\u0119 w tym samym obszarze wsp\u00f3\u0142pracy co u\u017cytkownik, usuni\u0119cie jest zabronione.
Error.xRevision.FrozenxRev= Element xRevision jest w stanie zbyt zaawansowanym, aby dopuszczalne by\u0142o usuni\u0119cie.
Error.xRevision.DeleteOneSingleElement= Wi\u0119cej ni\u017c jedno odniesienie wykorzystuje ten wykres z jednym elementem, usuni\u0119cie nie jest dopuszczone.
Error.xRevision.DeleteFirstElement= Wi\u0119cej ni jedno odniesienie wykorzystuje ten wykres, usuni\u0119cie pierwszego elementu nie jest dopuszczone.
Error.xRevision.DeleteOneElement= Jeden element xRevision jest wykorzystywany i nie mo\u017ce by\u0107 usuni\u0119ty.
Error.xRevision.ReferenceDeleteChildScope= Usuwanie odniesienia, kt\u00f3rego wykres ma wykresy podrz\u0119dne jest zabronione.
Error.xRevision.GraphDeleteChildScope= Usuwanie wykresu, kt\u00f3ry ma wykresy podrz\u0119dne jest zabronione.
Error.xRevision.CreateGraphPhyRevs= Nie mo\u017cna utworzy\u0107 wykresu dla bie\u017c\u0105cego elementu, poniewa\u017c ma on ju\u017c fizyczne poprawki.
Error.xRevision.CreateGraphNoExistCfg= Nie mo\u017cna utworzy\u0107 wykresu dla bie\u017c\u0105cego elementu, poniewa\u017c on nie istnieje lub nie mo\u017cna go konfigurowa\u0107.
Error.xRevision.ReuseGraphDelSource= Nie mo\u017cna ponownie wykorzysta\u0107 istniej\u0105cego wykresu dla bie\u017c\u0105cego elementu, poniewa\u017c element \u017ar\u00f3d\u0142owy nie istnieje.
Error.xRevision.ReuseGraphSourceNoAccess= Nie mo\u017cna ponownie wykorzysta\u0107 istniej\u0105cego wykresu dla bie\u017c\u0105cego elementu, poniewa\u017c bie\u017c\u0105cy u\u017cytkownik nie ma dost\u0119pu do elementu \u017ar\u00f3d\u0142owego.
Error.xRevision.ReuseGraphSourceNoCfg= Nie mo\u017cna ponownie wykorzysta\u0107 istniej\u0105cego wykresu dla bie\u017c\u0105cego elementu, poniewa\u017c nie mo\u017cna konfigurowa\u0107 elementu \u017ar\u00f3d\u0142owego.
Error.xRevision.ReuseGraphSourceNoGraph= Nie mo\u017cna ponownie wykorzysta\u0107 istniej\u0105cego wykresu dla bie\u017c\u0105cego elementu, poniewa\u017c element \u017ar\u00f3d\u0142owy nie ma wykresu.
