#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=No existe ning\u00fan indicador en la base de datos.
Effectivity.Alert.FlagDisabledInDB=Hay un indicador desactivado en la base de datos.
Effectivity.Alert.FlagEnabledInDB=Hay un indicador activado en la base de datos.
Effectivity.Alert.FilterableERTypesNotExistInDB=No hay tipos de ER filtrables en la base de datos.
Effectivity.Alert.FilterableERTypesFoundInDB=Se han encontrado tipos de ER filtrables en la base de datos.

Error.AlreadyAttached=ADVERTENCIA: El modelo con el ID: "<ModelID>" ya est\u00e1 asociado a la referencia.
Error.AlreadyDetached=ADVERTENCIA: El modelo con el ID: "<ModelID>" ya se ha separado.
Error.AlreadyAttachedMV=ADVERTENCIA: La versi\u00f3n de modelo con el ID "<ModelVersionID>" ya est\u00e1 asociado a la referencia.
Error.AlreadyDetachedMV=ADVERTENCIA: La versi\u00f3n de modelo con el ID "<ModelVersionID>" ya se ha separado.

Error.TypeNotAModel=no es un tipo de modelo
Error.InternalServerError=error interno
Error.ObjectNotFound=no se ha encontrado
Error.XCADConfigurationNotPossible=no se pueden configurar las estructuras del producto.

Error.DetachNotPossible.ConfigurationUsage=El modelo no se puede separar porque una configuraci\u00f3n lo est\u00e1 utilizando.
Error.DetachNotPossible.EffectivityUsage=El modelo no se puede separar porque una expresi\u00f3n de efectividad lo est\u00e1 utilizando.
Error.DetachNotPossible.ConfigurationRevision=El modelo no se puede separar porque la referencia tiene ConfigurationRevisions
Error.DetachNotPossible.ConfigRevision=El modelo no se puede separar porque la referencia tiene revisiones de configuraci\u00f3n

Error.Unset.NoEffectivity=Esta instancia no tiene una efectividad; si no se establece, no es \u00fatil.
Error.Unset.Domain.Forbidden=El dominio de entrada est\u00e1 prohibido
Error.Unset.Instance.Controlled.Change=La instancia de entrada est\u00e1 controlada por un cambio
Error.Unset.NoEffectivity.ForDomain=Esta instancia no tiene ninguna efectividad para este dominio

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=No existe ning\u00fan indicador en la base de datos.
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=El indicador ya existe en la base de datos.

Error.SetEffectivity.CriteriaNotEnabled=Los criterios no est\u00e1n activados en la referencia padre.
Error.SetEffectivity.IncorrectEffectivityXML=La expresi\u00f3n de efectividad de entrada o los datos utilizados en la expresi\u00f3n no son correctos.
Error.SetEffectivity.InvalidInstancePhysicalID=El identificador de la instancia en la entrada no es v\u00e1lido o no es correcto.
Error.SetEffectivity.LoadDictionaryFailed=No se puede establecer la efectividad debido a los datos del diccionario. 
Error.SetEffectivity.3DPartNotConfigurable=La referencia ra\u00edz es una 3DPart que no es configurable. 
Error.SetEffectivity.XCADNotConfigurable=La referencia ra\u00edz est\u00e1 controlada por XCAD que no es configurable.
Error.SetEffectivity.ModelNotAccessibleORExist=No se puede acceder al modelo proporcionado en la expresi\u00f3n de entrada o no existe.
Error.SetEffectivity.NoModelFoundInExpression=La expresi\u00f3n de entrada no tiene el formato correcto (no se ha encontrado ning\u00fan modelo).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=Los criterios utilizados en la expresi\u00f3n de entrada no est\u00e1n activados en la referencia padre.
Error.SetEffectivity.ErrorSaveEffectivities=Se ha producido un error al guardar las nuevas efectividades.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=Se ha producido un error durante la actualizaci\u00f3n de las efectividades de revisi\u00f3n de configuraci\u00f3n.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=La instancia forma parte de al menos una evoluci\u00f3n emitida. No se puede aplicar la nueva expresi\u00f3n de evoluci\u00f3n.
Error.SetEffectivity.ReferenceNotConfigurable=La referencia padre no es configurable.
Error.SetEffectivity.InstanceControlledByChange=La instancia de entrada est\u00e1 controlada por un cambio. No se puede editar la efectividad de evoluci\u00f3n.
Error.SetEffectivity.RootNotConfigured=La referencia padre de la instancia dada no tiene un contexto de configuraci\u00f3n.
Error.SetEffectivity.ModelNotAttached=El modelo proporcionado en la expresi\u00f3n de entrada no forma parte del contexto de configuraci\u00f3n.
Error.SetEffectivity.NotAllNecessaryModelsAttached=No todos los modelos necesarios est\u00e1n asociados a la referencia padre.
Error.SetEffectivity.InstControlledByChange=La instancia de entrada est\u00e1 controlada por un cambio. No se puede editar la efectividad de evoluci\u00f3n.
Error.SetEffectivity.FailureDuringOperation=Se ha detectado un error durante la operaci\u00f3n.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=No se puede establecer la expresi\u00f3n porque agregar\u00eda o eliminar\u00eda al menos un criterio de evoluci\u00f3n congelado a las efectividades.
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=La acci\u00f3n de cambio ya est\u00e1 en la efectividad y se ha definido como negativa.
Error.SetEffectivity.FailureDueToNoIntersection=No hay intersecci\u00f3n entre el rango de efectividad de instancia y el rango del contexto de creaci\u00f3n.
Error.IsEffsCoverEffRange.FailureDuringOperation=Se ha producido un error durante la comprobaci\u00f3n de si las efectividades de evoluci\u00f3n cubren un rango de efectividad de evoluci\u00f3n dado.

Error.AttachCfgContext.FailedDueToMultipleMVs=No se admiten varias versiones de modelo para adjuntar a un objeto configurable. Por ahora solo se admite una versi\u00f3n de modelo para adjuntar.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=El contexto de configuraci\u00f3n no se puede separar porque una expresi\u00f3n de efectividad lo est\u00e1 utilizando.

Error.AttributeVersionNotPresent=El atributo version obligatorio no est\u00e1 presente en el JSON de entrada.
Error.AttributeVersionIsInvalid=El atributo value version no es correcto en la entrada. El valor v\u00e1lido para la versi\u00f3n es 1.0.
Error.AttributeResourcesNotPresent=El atributo obligatorio resources no est\u00e1 presentes en el JSON de entrada.
Error.AttributeResourcesIsEmpty=El atributo resources es nulo o est\u00e1 vac\u00edo en la entrada.
Error.AttributeIdentifierNotPresent=El atributo obligatorio identifier no est\u00e1 presente en el JSON de entrada.
Error.AttributeIdentifierIsEmpty=El atributo identifier no debe ser nulo ni estar vac\u00edo en la entrada JSON.
Error.AttributeConfigFilterIdentifierNotPresent=El atributo obligatorio configFilterIdentifier no est\u00e1 presente en el JSON de entrada.
Error.AttributeConfigFilterIdentifierIsEmpty=El atributo configFilterIdentifier no debe ser nulo ni estar vac\u00edo en la entrada JSON.
Error.AttributeViewIsNotValid=El atributo view value no es correcto en la entrada. Los valores v\u00e1lidos para la vista son Actual o Proyectado.
Error.AttributeModeIsNotValid=El atributo mode value no es correcto en la entrada. Los valores v\u00e1lidos para el modo son Estricto o 150\u00a0%.
Error.PhysicalIdIsInvalid=La entrada contiene un physical id de instancia no v\u00e1lido.
Error.NotTypeOfVPMInstance=La entrada contiene un physical id que no es un tipo de instancia.
Error.ConfigurationFilterPIDIsInvalid=La entrada contiene un physical id de filtro de configuraci\u00f3n no v\u00e1lido.
Error.ConfigurationFilterTypeIsNotSupported=La entrada contiene un tipo de filtro de configuraci\u00f3n no compatible.
Error.InstanceDoesNotHaveStaticMapping=No se puede actualizar la asignaci\u00f3n est\u00e1tica de la instancia porque la instancia no tiene una asignaci\u00f3n est\u00e1tica.

Error.AttributeModelPIDNotPresent=El atributo obligatorio modelPID no est\u00e1 presente en el JSON de entrada.
Error.AttributeModelPIDIsEmpty=El atributo modelPID es nulo o est\u00e1 vac\u00edo en la entrada JSON.
Error.AttributeViewIsInvalid=El atributo view value no es v\u00e1lido. Los valores v\u00e1lidos para este atributo son Actual, Proyectado o Todos.
Error.AttributeFormatIsInvalid=El atributo format value no es v\u00e1lido. Los valores v\u00e1lidos para este atributo son TXT o XML.
Error.AttributeOccurrencesNotPresent=El atributo obligatorio occurrences no est\u00e1 presente en el JSON de entrada.
Error.AttributeOccurrencesIsEmpty=El atributo occurrences es nulo o est\u00e1 vac\u00edo en la entrada.

Error.FlagDoesNotExistInDatabase=No existe ning\u00fan indicador en la base de datos.
Error.FlagFoundInDatabase=El indicador ya existe en la base de datos.

Error.xRevision.AttachScopeFailed=Se ha producido un error al adjuntar el \u00e1mbito a esta referencia.
Error.xRevision.DetachScopeFailed=Se ha producido un error al separar el \u00e1mbito de esta referencia.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=No es posible adjuntar \u00e1mbitos para esta referencia, porque el gr\u00e1fico xRevision no est\u00e1 adjunto.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=No es posible separar los \u00e1mbitos para esta referencia, porque el gr\u00e1fico xRevision no est\u00e1 adjunto.
Error.xRevision.EnableVariantCriteriaFailed=No es posible establecer criterios variantes para esta referencia, porque no hay \u00e1mbitos adjuntos.

Error.xRevision.ReferenceNotConfigurable=Esta referencia no es configurable.

Error.AttributeVersionIsNotPresent=El atributo version no est\u00e1 presente en la entrada.
Error.AttributeVersionIsNotCorrect=El atributo version value no es v\u00e1lido. El valor v\u00e1lido para \u00e9l es 1.0.
Error.AttributeEvolutionIdentifiersIsNotPresent=El atributo evolutionsIdentifiers no est\u00e1 presente en la entrada.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=El atributo evolutionsIdentifiers est\u00e1 vac\u00edo o es nulo en la entrada.
Error.EvolutionPhysicalIsNullOREmpty=Al menos uno de los physicalid de evoluci\u00f3n est\u00e1 vac\u00edo o es nulo en la entrada.
Error.AttributeDetaislRequiredIsNotPresent=El atributo detailsRequired no est\u00e1 presente en la entrada.
Error.AttributeDetaislRequiredIsNotCorrect=El atributo detailsRequired value no es v\u00e1lido. El valor v\u00e1lido para \u00e9l es S\u00ed o No.
Error.MixEvolutionsNotAllowed=La entrada contiene una mezcla de tipos de evoluci\u00f3n no compatible. Proporcione el tipo de physicalids de evoluci\u00f3n.
Error.EvolutionsPIDNotValid=Este physicalid de evoluci\u00f3n no es v\u00e1lido.

Error.AttributeWorkUnderCompiledForm=El atributo workUnderCompiledForm es nulo o est\u00e1 vac\u00edo en la entrada.
Error.AttributeInstancePIDNotPresent=El atributo instancePID no est\u00e1 presente en la entrada.
Error.AttributeInstancePIDNotValid=El atributo instancePID es nulo o est\u00e1 vac\u00edo en la entrada.
Error.AttributeEffectivityCompiledFormNotPresent=El atributo effectivityCompiledForm no est\u00e1 presente en la entrada.
Error.AttributeEffectivityCompiledFormIsInvalid=El atributo effectivityCompiledForm es nulo en la entrada.
Error.AtleastOneModelPIDIsNullOREmpty=Al menos uno de los physicalid de modelo en la entrada es nulo o est\u00e1 vac\u00edo.
Error.RefORInstOrCAOrACShouldBePresent=Se requiere uno de ellos en la entrada, ya sea Instancias, Acci\u00f3n de cambio o Contexto de creaci\u00f3n.
Error.AttributeVersionReferencePIDNotPresent=El atributo referencePID no est\u00e1 presente en la entrada.
Error.AttributeVersionReferencePIDNotInvalid=El atributo referencePID es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.CannotCreateXRevGraphModelAttached=No es posible crear un gr\u00e1fico XRevision en esta referencia, porque ya hay un modelo adjunto.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=No es posible crear un gr\u00e1fico XRevision en esta referencia, porque no hay ning\u00fan gr\u00e1fico xRevision ya adjunto en la referencia de origen.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=No es posible crear un gr\u00e1fico XRevision en esta referencia, porque ya hay un modelo adjunto en la referencia de origen.

Error.xRevision.xRevGraphAlreadyHasScope=El gr\u00e1fico xRevision en esta referencia ya est\u00e1 teniendo el \u00e1mbito.
Error.xRevision.xRevGraphHasNoScopeToDelete=El gr\u00e1fico xRevision de esta referencia no tiene el \u00e1mbito para eliminar.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=El gr\u00e1fico xRevision de esta referencia tiene alguna asignaci\u00f3n, por lo que no puede eliminar el \u00e1mbito.

Error.InvalidInstancePID=Este physicalid de instancia no es v\u00e1lido.

Error.FailedToDisableCriteria=No se han podido deshabilitar los criterios en los objetos configurados, ya que una o m\u00e1s instancias pueden utilizar <CriteriaName> en la efectividad.
Criteria.Date=Fecha
Criteria.ManufacturingPlans=Plan de fabricaci\u00f3n
Criteria.Unit=Unidad
Criteria.FeatureOption=Variantes y opciones
Criteria.ModelVersion=Versi\u00f3n de modelo

Warning.InstanceNotFilterable=La instancia no admite la expresi\u00f3n de efectividad.
Warning.NotPossibleExtendOnThisInstance=La operaci\u00f3n de extensi\u00f3n no es posible en la instancia que ya est\u00e1 disponible para todas las evoluciones.
Error.ExtendFailedOnThisInstance=La operaci\u00f3n de extensi\u00f3n no es posible en esta instancia.
Error.InvalidPhysicalPID=Este ID f\u00edsico no es v\u00e1lido.

Cfg.Error.ErrorMissingParameterInWebService=Falta el par\u00e1metro <key>. Incluya todos los par\u00e1metros necesarios al hacer la solicitud.
Cfg.Error.ErrorIncorrectParameterValueInWebService=Valor de par\u00e1metro incorrecto para <key>. Incluya un valor de par\u00e1metro v\u00e1lido al hacer la solicitud.
Cfg.Error.ErrorIncorrectArraySizeInWebService=Tama\u00f1o incorrecto de la matriz <key>. Aseg\u00farese de que esta matriz tenga el tama\u00f1o correcto al hacer la solicitud.
Cfg.Error.ErrorExactlyOneParameterRequired=Combinaci\u00f3n de par\u00e1metros no v\u00e1lida para <key>. Aseg\u00farese de que se proporcione exactamente uno de los par\u00e1metros necesarios al realizar la solicitud.
Cfg.Error.ErrorInvalidPayloadInWebService=La carga \u00fatil de solicitud no se ajusta al esquema o formato esperado. Verifique la estructura, los tipos de datos y los campos obligatorios.

Error.xRevision.NotPossibleToAttachScopes=No es posible adjuntar \u00e1mbitos para al menos una de las referencias de la entrada, porque el gr\u00e1fico xRevision no est\u00e1 adjunto.

Error.ConfigFilterNotFoundOnReference=No es posible crear una asignaci\u00f3n est\u00e1tica en una instancia, porque el filtro de configuraci\u00f3n de entrada no se encuentra en un objeto de referencia.
Error.InstanceAlreadyHasStaticMapping=No es posible crear una asignaci\u00f3n est\u00e1tica en una instancia, porque esta instancia ya tiene una asignaci\u00f3n est\u00e1tica.

Error.NotAccessibleObject=Este contenido ya no es accesible o puede que se haya eliminado.
Error.DoesNotExistObject=El objeto seleccionado no existe.

Error.ConfigFilterIsTooMature=No es posible crear una asignaci\u00f3n est\u00e1tica en una instancia, porque el filtro de configuraci\u00f3n de entrada est\u00e1 en estado obsoleto.

Error.ModelVersionAlreadyAttach=No es posible adjuntar este modelo cuando ya hay una versi\u00f3n de modelo adjunta.

Error.xRevision.RefDoesNotHaveXRevGraph=El de la referencia de la entrada que se utiliza para adjuntar como \u00e1mbito no tiene un gr\u00e1fico xRevision adjunto.
Error.xRevision.ErrorNoXGraphFoundForReference=La referencia dada en la entrada no tiene ning\u00fan gr\u00e1fico xRevision adjunto.
