#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= L'attribut version n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeVersionIsInvalid= La valeur de l'attribut version n'est pas valide. La valeur valide est 1.0.

Error.xRevision.AttributeVersionReferencePIDNotPresent= L'attribut referencePID n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= L'attribut referencePID est nul ou vide dans l'entr\u00e9e.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= Impossible de cr\u00e9er un graphique XRevision sur cette r\u00e9f\u00e9rence, car il y est d\u00e9j\u00e0 associ\u00e9.
Error.xRevision.CannotCreateXRevGraphModelAttached= Impossible de cr\u00e9er un graphique XRevision sur cette r\u00e9f\u00e9rence, car un mod\u00e8le y est d\u00e9j\u00e0 associ\u00e9.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= L'attribut xRevisionElementPID n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= L'attribut xRevisionElementPID est nul ou vide dans l'entr\u00e9e.
Error.xRevision.AttributeXRevElementPIDNotValid= L'attribut xRevision Element physicalid n'est pas valide dans l'entr\u00e9e.

Error.xRevision.AttributeAllocationsIsNotPresent= L'attribut allocations n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeAllocationsIsNullOREmpty= L'attribut allocations est nul ou vide dans l'entr\u00e9e.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= L'attribut allocationPIDs n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= L'attribut allocationPIDs est nul ou vide dans l'entr\u00e9e.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Au moins un des attributs allocation physicalid dans l'entr\u00e9e est nul ou vide.
Error.xRevision.MultiAllocationIsNotSupported= Plusieurs allocations ne sont pas encore prises en charge pour chaque attribut xRevision Element.
Error.xRevision.AllocationPIDIsNotValid= L'attribut allocation fourni dans l'entr\u00e9e n'est pas valide ou ne fait pas partie d'un graphique xRevision.
Error.xRevision.xRevElementAlreadyHasAllocation= L'attribut xRevision Element poss\u00e8de d\u00e9j\u00e0 des allocations.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= L'attribut xRevisionElementPIDs n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= L'attribut xRevisionElementPIDs est nul ou vide dans l'entr\u00e9e.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Au moins un des attributs xRevision Element physicalid dans l'entr\u00e9e est nul ou vide.
Error.xRevision.XRevisionElementPIDNotValid= Cet attribut xRevision Element physicalid n'est pas valide.

Error.xRevision.AttributeDeallocationsIsNotPresent= L'attribut deallocations n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= L'attribut deallocations est nul ou vide dans l'entr\u00e9e.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= L'attribut deallocationPIDs n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= L'attribut deallocationPIDs est nul ou vide dans l'entr\u00e9e.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Au moins un des attributs deallocation physicalid dans l'entr\u00e9e est nul ou vide.
Error.xRevision.MultiDeallocationIsNotSupported= Plusieurs attributs deallocations ne sont pas encore pris en charge pour chaque attribut xRevision Element.
Error.xRevision.DeallocationPIDIsNotValid= L'attribut deallocation fourni dans l'entr\u00e9e n'est pas valide ou ne fait pas partie d'un graphique xRevision.
Error.xRevision.xRevElementDoesNotHaveAllocation= Cet attribut xRevision Element n'a aucune allocation.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= L'attribut xRevisionGraphsToAttach n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= L'attribut xRevisionGraphsToAttach est vide dans l'entr\u00e9e.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= L'attribut reusableGraphReferencePID n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= L'attribut reusableGraphReferencePID est nul ou vide dans l'entr\u00e9e.
Error.xRevision.AttachExistingXRevGraphFailed= Echec de l'association d'un graphique xRevision existant d'une r\u00e9f\u00e9rence vers une autre pour l'une des r\u00e9f\u00e9rences dans l'entr\u00e9e.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= Impossible d'associer un graphique XRevision pour l'une des r\u00e9f\u00e9rences, car cette r\u00e9f\u00e9rence a d\u00e9j\u00e0 un graphique XRevision.
Error.xRevision.AllocationCrossesExistingOne= Cette allocation d\u00e9passe une allocation existante. Veuillez essayer d'ajouter l'allocation \u00e0 une version de mod\u00e8le sup\u00e9rieure.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= Impossible d'ex\u00e9cuter l'allocation automatique lors de l'op\u00e9ration de d\u00e9finition de port\u00e9e.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= Aucune variante trouv\u00e9e pour le contexte de configuration lors de l'op\u00e9ration de d\u00e9finition de port\u00e9e.


Error.xRevision.ParentNotInFrozen= Le parent de l'\u00e9l\u00e9ment xRevision actuel est \u00e0 l'\u00e9tat Pr\u00e9liminaire ou En traitement, la promotion est donc interdite.
Error.xRevision.AllocatedMVNotReleased= La version de mod\u00e8le allou\u00e9e \u00e0 l'attribut xRevision Element actuel n'est pas distribu\u00e9e, la promotion est donc interdite.
Error.xRevision.FoundIncompleteChange= Des actions de modification incompl\u00e8tes utilisent cet \u00e9l\u00e9ment xRevision, la promotion est donc interdite.
Error.xRevision.ChildFrozen= L'enfant de l'\u00e9l\u00e9ment xRevision actuel a au moins un \u00e9tat Fig\u00e9, la r\u00e9trogradation est donc interdite.

Error.xRevision.xRevisionDeleteAction= Un \u00e9l\u00e9ment du graphique xRevision ne peut pas \u00eatre supprim\u00e9 ou la r\u00e9f\u00e9rence principale ne peut pas \u00eatre d\u00e9finie.
Error.xRevision.PrimaryReferenceDelete= La tentative de suppression de la r\u00e9f\u00e9rence principale du graphique est interdite.
Error.xRevision.PrimaryReferenceDeleteMulti= La tentative de suppression d'une r\u00e9f\u00e9rence principale qui poss\u00e8de un graphique avec plusieurs attributs xRevision Element est interdite.
Error.xRevision.DeleteCollabSpace= L'attribut xRevision Element n'est pas \u00e0 l'\u00e9tat En traitement et ne se trouve pas dans le m\u00eame espace de collaboration que l'utilisateur, la suppression est donc interdite.
Error.xRevision.FrozenxRev= L'attribut xRevision Element se trouve dans un \u00e9tat trop avanc\u00e9 pour permettre la suppression.
Error.xRevision.DeleteOneSingleElement= Plusieurs r\u00e9f\u00e9rences utilisent ce graphique avec un seul \u00e9l\u00e9ment, la suppression n'est donc pas autoris\u00e9e.
Error.xRevision.DeleteFirstElement= Plusieurs r\u00e9f\u00e9rences utilisent ce graphique, la suppression du premier \u00e9l\u00e9ment n'est donc pas autoris\u00e9e.
Error.xRevision.DeleteOneElement= Un attribut xRevision Element est utilis\u00e9 et ne peut pas \u00eatre supprim\u00e9.
Error.xRevision.ReferenceDeleteChildScope= Il est interdit d'essayer de supprimer une r\u00e9f\u00e9rence dont le graphique poss\u00e8de des graphiques enfants.
Error.xRevision.GraphDeleteChildScope= Il est interdit d'essayer de supprimer un graphique poss\u00e9dant des graphiques enfants.
Error.xRevision.CreateGraphPhyRevs= Impossible de cr\u00e9er un graphique pour l'\u00e9l\u00e9ment actuel, il poss\u00e8de d\u00e9j\u00e0 des r\u00e9visions physiques.
Error.xRevision.CreateGraphNoExistCfg= Impossible de cr\u00e9er un graphique pour l'\u00e9l\u00e9ment actuel, il n'existe pas ou n'est pas configurable.
Error.xRevision.ReuseGraphDelSource= Impossible de r\u00e9utiliser un graphique existant pour l'\u00e9l\u00e9ment actuel, l'\u00e9l\u00e9ment source n'existe pas.
Error.xRevision.ReuseGraphSourceNoAccess= Impossible de r\u00e9utiliser un graphique existant pour l'\u00e9l\u00e9ment actuel, l'utilisateur existant n'a pas acc\u00e8s \u00e0 l'\u00e9l\u00e9ment source.
Error.xRevision.ReuseGraphSourceNoCfg= Impossible de r\u00e9utiliser un graphique existant pour l'\u00e9l\u00e9ment actuel, l'\u00e9l\u00e9ment source n'est pas configurable.
Error.xRevision.ReuseGraphSourceNoGraph= Impossible de r\u00e9utiliser un graphique existant pour l'\u00e9l\u00e9ment actuel, l'\u00e9l\u00e9ment source n'a pas de graphique.
