#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=Markierung befindet sich nicht in der Datenbank.
Effectivity.Alert.FlagDisabledInDB=Markierung befindet sich in der Datenbank und ist deaktiviert.
Effectivity.Alert.FlagEnabledInDB=Markierung befindet sich in der Datenbank und ist aktiviert.
Effectivity.Alert.FilterableERTypesNotExistInDB=Filterbare ER-Typen befinden sich nicht in der Datenbank.
Effectivity.Alert.FilterableERTypesFoundInDB=Filterbare ER-Typen in der Datenbank gefunden.

Error.AlreadyAttached=WARNUNG: Modell mit ID '<ModelID>' ist bereits an die Referenz angeh\u00e4ngt!
Error.AlreadyDetached=WARNUNG: Verbindung zu Modell mit ID '<ModelID>' ist bereits getrennt!
Error.AlreadyAttachedMV=WARNUNG: Modellversion mit ID '<ModelVersionID>' ist bereits an die Referenz angef\u00fcgt!
Error.AlreadyDetachedMV=WARNUNG: Verbindung zu Modellversion mit ID '<ModelVersionID>' ist bereits getrennt!

Error.TypeNotAModel=ist kein Typ des Modells
Error.InternalServerError=interner Fehler
Error.ObjectNotFound=nicht gefunden
Error.XCADConfigurationNotPossible=Produktstrukturen k\u00f6nnen nicht konfiguriert werden.

Error.DetachNotPossible.ConfigurationUsage=Modell kann nicht getrennt werden, da es von einer Konfiguration verwendet wird
Error.DetachNotPossible.EffectivityUsage=Modell kann nicht getrennt werden, weil es von einem G\u00fcltigkeitsausdruck verwendet wird
Error.DetachNotPossible.ConfigurationRevision=Modell kann nicht getrennt werden, da die Referenz \u00fcber Konfigurationsrevisionen verf\u00fcgt
Error.DetachNotPossible.ConfigRevision=Modell kann nicht getrennt werden, da die Referenz \u00fcber Konfigurationsrevisionen verf\u00fcgt

Error.Unset.NoEffectivity=Diese Instanz besitzt keine G\u00fcltigkeit, Zur\u00fccksetzen hat keine Wirkung
Error.Unset.Domain.Forbidden=Die Eingabedom\u00e4ne ist unzul\u00e4ssig
Error.Unset.Instance.Controlled.Change=Die Eingabeinstanz wird durch eine \u00c4nderung gesteuert
Error.Unset.NoEffectivity.ForDomain=Diese Instanz besitzt keine G\u00fcltigkeit f\u00fcr diese Dom\u00e4ne

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=Markierung befindet sich nicht in der Datenbank.
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=Die Markierung ist in der Datenbank vorhanden.

Error.SetEffectivity.CriteriaNotEnabled=Die Kriterien sind f\u00fcr die \u00fcbergeordnete Referenz nicht aktiviert.
Error.SetEffectivity.IncorrectEffectivityXML=Der eingegebene G\u00fcltigkeitsausdruck oder die im Ausdruck verwendeten Daten sind nicht korrekt.
Error.SetEffectivity.InvalidInstancePhysicalID=Die Kennung der Instanz in der Eingabe ist nicht g\u00fcltig oder korrekt.
Error.SetEffectivity.LoadDictionaryFailed=Die G\u00fcltigkeit kann aufgrund von W\u00f6rterbuchdaten nicht eingestellt werden. 
Error.SetEffectivity.3DPartNotConfigurable=Die Root-Referenz ist ein 3D-Teil, das nicht konfigurierbar ist. 
Error.SetEffectivity.XCADNotConfigurable=Die Root-Referenz wird durch XCAD gesteuert, was nicht konfigurierbar ist.
Error.SetEffectivity.ModelNotAccessibleORExist=Das im Eingabeausdruck angegebene Modell ist nicht zug\u00e4nglich oder existiert nicht.
Error.SetEffectivity.NoModelFoundInExpression=Eingabeausdruck nicht gut formatiert (kein Modell gefunden).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=Die im eingegebenen Ausdruck verwendeten Kriterien sind f\u00fcr die \u00fcbergeordnete Referenz nicht aktiviert.
Error.SetEffectivity.ErrorSaveEffectivities=Fehler beim Speichern der neuen G\u00fcltigkeiten.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=Beim Aktualisieren der G\u00fcltigkeiten der Konfigurationsrevision ist ein Fehler aufgetreten.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=Instanz ist Teil von mindestens einer freigegebenen Entwicklung. Der neue Entwicklungsausdruck kann nicht angewendet werden.
Error.SetEffectivity.ReferenceNotConfigurable=Die \u00fcbergeordnete Referenz ist nicht konfigurierbar.
Error.SetEffectivity.InstanceControlledByChange=Die Eingabeinstanz wird durch eine \u00c4nderung gesteuert. Die Entwicklungsg\u00fcltigkeit kann nicht bearbeitet werden.
Error.SetEffectivity.RootNotConfigured=Die \u00fcbergeordnete Referenz der angegebenen Instanz verf\u00fcgt \u00fcber keinen Konfigurationskontext.
Error.SetEffectivity.ModelNotAttached=Das im Eingabeausdruck angegebene Modell ist nicht Teil des Konfigurationskontextes.
Error.SetEffectivity.NotAllNecessaryModelsAttached=Nicht alle erforderlichen Modelle sind an die \u00fcbergeordnete Referenz angeh\u00e4ngt.
Error.SetEffectivity.InstControlledByChange=Die Eingabeinstanz wird durch eine \u00c4nderung gesteuert. Die Entwicklungsg\u00fcltigkeit kann nicht bearbeitet werden.
Error.SetEffectivity.FailureDuringOperation=St\u00f6rung w\u00e4hrend des Vorgangs erkannt.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=Einstellen des Ausdrucks nicht m\u00f6glich, da dadurch mindestens ein eingefrorenes Entwicklungskriterium zu den G\u00fcltigkeiten hinzugef\u00fcgt oder davon entfernt werden w\u00fcrde.
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=\u00c4nderungsaktion ist bereits in der G\u00fcltigkeit und als negativ definiert.
Error.SetEffectivity.FailureDueToNoIntersection=Es besteht keine \u00dcberschneidung zwischen dem G\u00fcltigkeitsbereich der Instanz und dem Bereich des Erstellungskontextes.
Error.IsEffsCoverEffRange.FailureDuringOperation=Beim Pr\u00fcfen, ob Entwicklungsg\u00fcltigkeiten einen bestimmten G\u00fcltigkeitsbereich der Entwicklung abdecken, ist ein Fehler aufgetreten.

Error.AttachCfgContext.FailedDueToMultipleMVs=Das Anf\u00fcgen mehrerer Modellversionen an ein konfigurierbares Objekt wird nicht unterst\u00fctzt. Derzeit wird nur das Anf\u00fcgen einer Modellversion unterst\u00fctzt.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=Konfigurationskontext kann nicht getrennt werden, weil er von einem G\u00fcltigkeitsausdruck verwendet wird.

Error.AttributeVersionNotPresent=Die obligatorische Attributversion ist in der JSON-Eingabe nicht vorhanden.
Error.AttributeVersionIsInvalid=Der Wert der Attributversion ist in der Eingabe nicht korrekt. Ein g\u00fcltiger Wert f\u00fcr die Version ist 1.0.
Error.AttributeResourcesNotPresent=Die obligatorischen Attributressourcen sind in der JSON-Eingabe nicht vorhanden.
Error.AttributeResourcesIsEmpty=Das Attribut resources ist null oder in der JSON-Eingabe leer.
Error.AttributeIdentifierNotPresent=Die obligatorische Attribut-ID ist in der JSON-Eingabe nicht vorhanden.
Error.AttributeIdentifierIsEmpty=Attribut-ID darf nicht null oder leer in der JSON-Eingabe sein.
Error.AttributeConfigFilterIdentifierNotPresent=Das obligatorische Attribut configFilterIdentifier ist in der JSON-Eingabe nicht vorhanden.
Error.AttributeConfigFilterIdentifierIsEmpty=Attribut configFilterIdentifier darf in der JSON-Eingabe nicht null oder leer sein.
Error.AttributeViewIsNotValid=Attributansichtswert ist in der Eingabe nicht g\u00fcltig. G\u00fcltige Werte f\u00fcr die Ansicht sind 'Aktuell' oder 'Projiziert'.
Error.AttributeModeIsNotValid=Attributmoduswert ist in der Eingabe nicht g\u00fcltig. G\u00fcltige Werte f\u00fcr den Modus sind 'Streng' oder '150 %'.
Error.PhysicalIdIsInvalid=Eingabe enth\u00e4lt eine ung\u00fcltige physische ID f\u00fcr die Instanz.
Error.NotTypeOfVPMInstance=Eingabe enth\u00e4lt eine physische ID, die nicht dem Typ der Instanz entspricht.
Error.ConfigurationFilterPIDIsInvalid=Eingabe enth\u00e4lt eine ung\u00fcltige physische ID f\u00fcr den Konfigurationsfilter.
Error.ConfigurationFilterTypeIsNotSupported=Die Eingabe enth\u00e4lt einen Konfigurationsfiltertyp, der nicht unterst\u00fctzt wird.
Error.InstanceDoesNotHaveStaticMapping=Die statische Zuordnung der Instanz kann nicht aktualisiert werden, da diese Instanz keine statische Zuordnung hat.

Error.AttributeModelPIDNotPresent=Das obligatorische Attribut modelPID ist in der JSON-Eingabe nicht vorhanden.
Error.AttributeModelPIDIsEmpty=Das Attribut modelPID ist null oder in der Eingabe leer.
Error.AttributeViewIsInvalid=Der Attributansichtswert ist nicht g\u00fcltig. G\u00fcltige Werte f\u00fcr dieses Attribut sind 'Aktuell', 'Projiziert' oder 'Alle'.
Error.AttributeFormatIsInvalid=Der Attributformatwert ist nicht g\u00fcltig. G\u00fcltige Werte f\u00fcr dieses Attribut sind TXT oder XML.
Error.AttributeOccurrencesNotPresent=Das obligatorische Attribut occurrences ist in der JSON-Eingabe nicht vorhanden.
Error.AttributeOccurrencesIsEmpty=Das Attribut occurrences ist null oder in der Eingabe leer.

Error.FlagDoesNotExistInDatabase=Markierung befindet sich nicht in der Datenbank.
Error.FlagFoundInDatabase=Die Markierung ist in der Datenbank vorhanden.

Error.xRevision.AttachScopeFailed=Beim Anf\u00fcgen des Bereichs an diese Referenz ist ein Fehler aufgetreten.
Error.xRevision.DetachScopeFailed=Beim Aufheben des Anf\u00fcgens des Bereichs zu dieser Referenz ist ein Fehler aufgetreten.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=Es ist nicht m\u00f6glich, Bereiche an diese Referenz anzuf\u00fcgen, weil das xRevision-Diagramm nicht daran angef\u00fcgt ist.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=Es ist nicht m\u00f6glich das Anf\u00fcgen von Bereichen an diese Referenz aufzuheben, weil das xRevision-Diagramm nicht daran angef\u00fcgt ist.
Error.xRevision.EnableVariantCriteriaFailed=Es ist nicht m\u00f6glich, Variantenkriterien f\u00fcr diese Referenz festzulegen, weil keine Bereiche daran angef\u00fcgt sind.

Error.xRevision.ReferenceNotConfigurable=Diese Referenz kann nicht konfiguriert werden.

Error.AttributeVersionIsNotPresent=Das Attribut version ist in der Eingabe nicht vorhanden.
Error.AttributeVersionIsNotCorrect=Der Wert des Attributs version ist nicht g\u00fcltig. Ein g\u00fcltiger Wert ist 1.0.
Error.AttributeEvolutionIdentifiersIsNotPresent=Das Attribut evolutionsIdentifiers ist in der Eingabe nicht vorhanden.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=Das Attribut evolutionsIdentifiers ist leer oder in der Eingabe null.
Error.EvolutionPhysicalIsNullOREmpty=Mindestens eine physische ID der Entwicklung ist leer oder in der Eingabe null.
Error.AttributeDetaislRequiredIsNotPresent=Das Attribut detailsRequired ist in der Eingabe nicht vorhanden.
Error.AttributeDetaislRequiredIsNotCorrect=Der Wert des Attributs detailsRequired ist nicht g\u00fcltig. Ein g\u00fcltiger Wert ist Ja oder Nein.
Error.MixEvolutionsNotAllowed=Die Eingabe enth\u00e4lt eine Kombination aus Entwicklungstypen, die nicht unterst\u00fctzt wird. Geben Sie einen Typ der physischen IDs f\u00fcr Entwicklung an.
Error.EvolutionsPIDNotValid=Diese physische ID der Entwicklung ist ung\u00fcltig.

Error.AttributeWorkUnderCompiledForm=Das Attribut workUnderCompiledForm ist null oder in der Eingabe leer.
Error.AttributeInstancePIDNotPresent=Das Attribut instancePID ist in der Eingabe nicht vorhanden.
Error.AttributeInstancePIDNotValid=Das Attribut instancePID ist null oder in der Eingabe leer.
Error.AttributeEffectivityCompiledFormNotPresent=Das Attribut effectivityCompiledForm ist in der Eingabe nicht vorhanden.
Error.AttributeEffectivityCompiledFormIsInvalid=Das Attribut effectivityCompiledForm ist in der Eingabe null.
Error.AtleastOneModelPIDIsNullOREmpty=Mindestens eine der physischen IDs des Modells ist null oder in der Eingabe leer.
Error.RefORInstOrCAOrACShouldBePresent=Eines davon ist in der Eingabe erforderlich, entweder Instanzen oder \u00c4nderungsaktion oder Erstellungskontext.
Error.AttributeVersionReferencePIDNotPresent=Das Attribut referencePID ist in der Eingabe nicht vorhanden.
Error.AttributeVersionReferencePIDNotInvalid=Das Attribut referencePID ist null oder in der Eingabe leer.
Error.xRevision.CannotCreateXRevGraphModelAttached=Es ist nicht m\u00f6glich, ein XRevision-Diagramm in dieser Referenz zu erstellen, weil ein Modell bereits daran angef\u00fcgt ist.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=Es ist nicht m\u00f6glich, ein XRevision-Diagramm in dieser Referenz zu erstellen, weil noch kein xRevision-Diagramm an die Quellreferenz angef\u00fcgt ist.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=Es ist nicht m\u00f6glich, ein XRevision-Diagramm in dieser Referenz zu erstellen, weil bereits ein Modell an die Quellreferenz angef\u00fcgt ist.

Error.xRevision.xRevGraphAlreadyHasScope=Das xRevision-Diagramm in dieser Referenz weist bereits den Bereich auf.
Error.xRevision.xRevGraphHasNoScopeToDelete=Das xRevision-Diagramm in dieser Referenz hat keinen Bereich, der gel\u00f6scht werden kann.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=Das xRevision-Diagramm in dieser Referenz hat eine Zuweisung, weshalb der Bereich nicht gel\u00f6scht werden kann.

Error.InvalidInstancePID=Die physische ID dieser Instanz ist ung\u00fcltig.

Error.FailedToDisableCriteria=Die Kriterien f\u00fcr konfigurierte Objekte konnten nicht deaktiviert werden, weil f\u00fcr mindestens eine Instanz m\u00f6glicherweise <CriteriaName> in der G\u00fcltigkeit verwendet wird.
Criteria.Date=Datum
Criteria.ManufacturingPlans=Fertigungsplan
Criteria.Unit=Einheit
Criteria.FeatureOption=Varianten und Optionen
Criteria.ModelVersion=Modellversion

Warning.InstanceNotFilterable=Die Instanz unterst\u00fctzt keine G\u00fcltigkeitsausdr\u00fccke.
Warning.NotPossibleExtendOnThisInstance=Die Erweiterungsoperation ist bei einer Instanz, die bereits f\u00fcr alle Entwicklungen verf\u00fcgbar ist, nicht m\u00f6glich.
Error.ExtendFailedOnThisInstance=Die Erweiterungsoperation ist f\u00fcr diese Instanz nicht m\u00f6glich.
Error.InvalidPhysicalPID=Diese physische ID ist ung\u00fcltig.

Cfg.Error.ErrorMissingParameterInWebService=Fehlender Parameter <key>. Schlie\u00dfen Sie alle erforderlichen Parameter ein, wenn Sie die Anfrage stellen.
Cfg.Error.ErrorIncorrectParameterValueInWebService=Falscher Parameterwert f\u00fcr <key>. Schlie\u00dfen Sie alle g\u00fcltigen Parameter ein, wenn Sie die Anfrage stellen.
Cfg.Error.ErrorIncorrectArraySizeInWebService=Falsche Gr\u00f6\u00dfe f\u00fcr das Array <key>. Vergewissern Sie sich, dass dieses Array die korrekte Gr\u00f6\u00dfe hat, wenn Sie die Anfrage stellen.
Cfg.Error.ErrorExactlyOneParameterRequired=Ung\u00fcltige Parameterkombination f\u00fcr <key>. Vergewissern Sie sich, dass genau einer der erforderlichen Parameter angegeben ist, wenn Sie die Anfrage stellen.
Cfg.Error.ErrorInvalidPayloadInWebService=Die Anforderungs-Nutzlast entspricht nicht dem erwarteten Schema oder Format. \u00dcberpr\u00fcfen Sie die Struktur, Datentypen und erforderlichen Felder.

Error.xRevision.NotPossibleToAttachScopes=Es ist nicht m\u00f6glich, Bereiche an mindestens eine der Referenzen in der Eingabe anzuf\u00fcgen, weil das xRevision-Diagramm nicht daran angef\u00fcgt ist.

Error.ConfigFilterNotFoundOnReference=Es ist nicht m\u00f6glich, eine statische Zuordnung f\u00fcr eine Instanz zu erstellen, weil der eingegebene Konfigurationsfilter f\u00fcr ein Referenzobjekt nicht gefunden wurde.
Error.InstanceAlreadyHasStaticMapping=Es ist nicht m\u00f6glich, eine statische Zuordnung f\u00fcr eine Instanz zu erstellen, weil dieses Instanz bereits eine statische Zuordnung hat.

Error.NotAccessibleObject=Dieser Inhalt ist nicht mehr zug\u00e4nglich oder wurde m\u00f6glicherweise gel\u00f6scht.
Error.DoesNotExistObject=Das ausgew\u00e4hlte Objekt existiert nicht.

Error.ConfigFilterIsTooMature=Es ist nicht m\u00f6glich, eine statische Zuordnung f\u00fcr eine Instanz zu erstellen, weil sich der eingegebene Konfigurationsfilter im Stadium 'Veraltet' befindet.

Error.ModelVersionAlreadyAttach=Es ist nicht m\u00f6glich, dieses Modell anzuf\u00fcgen, wenn bereits eine Modellversion angef\u00fcgt ist.

Error.xRevision.RefDoesNotHaveXRevGraph=An eine der Referenzen in der Eingabe, die zum Anf\u00fcgen als Bereich verwendet wird, ist kein xRevision-Diagramm angef\u00fcgt.
Error.xRevision.ErrorNoXGraphFoundForReference=An die in der Eingabe angegebene Referenz ist kein xRevision-Diagramm angef\u00fcgt.
