#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= \uc785\ub825 \uc2dc \uc18d\uc131 \ubc84\uc804\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeVersionIsInvalid= \uc18d\uc131 \ubc84\uc804 \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\ud55c \uac12\uc740 1.0\uc785\ub2c8\ub2e4.

Error.xRevision.AttributeVersionReferencePIDNotPresent= \uc785\ub825 \uc2dc referencePID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= \uc785\ub825 \uc2dc referencePID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= \uc774\ubbf8 \ucca8\ubd80\ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0\uc11c XRevision \uadf8\ub798\ud504\ub97c \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.CannotCreateXRevGraphModelAttached= \uc774\ubbf8 \ubaa8\ub378\uc774 \ucca8\ubd80\ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0\uc11c XRevision \uadf8\ub798\ud504\ub97c \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= \uc785\ub825 \uc2dc xRevisionElementPID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= \uc785\ub825 \uc2dc xRevisionElementPID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeXRevElementPIDNotValid= \uc785\ub825\uc5d0\uc11c xRevision \uc694\uc18c \uc2e4\uc81c ID\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

Error.xRevision.AttributeAllocationsIsNotPresent= \uc785\ub825 \uc2dc \ud560\ub2f9 \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeAllocationsIsNullOREmpty= \uc785\ub825 \uc2dc \ud560\ub2f9 \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= \uc785\ub825 \uc2dc allocationPID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= \uc785\ub825 \uc2dc allocationPID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= \uc785\ub825 \uc2dc \ud560\ub2f9 \uc2e4\uc81c ID \uc911 \ud558\ub098 \uc774\uc0c1\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.MultiAllocationIsNotSupported= \uac01 xRevision \uc694\uc18c\uc5d0 \ub300\ud55c \ub2e4\uc911 \ud560\ub2f9\uc740 \uc544\uc9c1 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.xRevision.AllocationPIDIsNotValid= \uc785\ub825 \uc2dc \uc81c\uacf5\ud55c \ud560\ub2f9\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uac70\ub098 xRevision \uadf8\ub798\ud504\uc758 \uc77c\ubd80\uac00 \uc544\ub2d9\ub2c8\ub2e4.
Error.xRevision.xRevElementAlreadyHasAllocation= xRevision \uc694\uc18c\uc5d0 \uc774\ubbf8 \ud560\ub2f9 \ud56d\ubaa9\uc774 \uc788\uc2b5\ub2c8\ub2e4.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= \uc785\ub825 \uc2dc xRevisionElementPID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= \uc785\ub825 \uc2dc xRevisionElementPID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= \uc785\ub825 \uc2dc xRevision \uc694\uc18c \uc2e4\uc81c ID \uc911 \ud558\ub098 \uc774\uc0c1\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.XRevisionElementPIDNotValid= \uc774 xRevision \uc694\uc18c \uc2e4\uc81c ID\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

Error.xRevision.AttributeDeallocationsIsNotPresent= \uc785\ub825 \uc2dc \ud560\ub2f9 \ud574\uc81c \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= \uc785\ub825 \uc2dc \ud560\ub2f9 \ud574\uc81c \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= \uc785\ub825 \uc2dc deallocationPID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= \uc785\ub825 \uc2dc deallocationPID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= \uc785\ub825 \uc2dc \ud560\ub2f9 \ud574\uc81c \uc2e4\uc81c ID \uc911 \ud558\ub098 \uc774\uc0c1\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.MultiDeallocationIsNotSupported= \uac01 xRevision \uc694\uc18c\uc5d0\uc11c \ub2e4\uc911 \ud560\ub2f9 \ud574\uc81c\ub294 \uc544\uc9c1 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.xRevision.DeallocationPIDIsNotValid= \uc785\ub825 \uc2dc \uc81c\uacf5\ud55c \ud560\ub2f9 \ud574\uc81c\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uac70\ub098 xRevision \uadf8\ub798\ud504\uc758 \uc77c\ubd80\uac00 \uc544\ub2d9\ub2c8\ub2e4.
Error.xRevision.xRevElementDoesNotHaveAllocation= \uc774 xRevision \uc694\uc18c\uc5d0 \ud560\ub2f9\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= \uc785\ub825 \uc2dc xRevisionGraphsToAttach \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= \uc785\ub825 \uc2dc xRevisionGraphsToAttach \uc18d\uc131\uc774 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= \uc785\ub825 \uc2dc reusableGraphReferencePID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= \uc785\ub825 \uc2dc reusableGraphReferencePID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttachExistingXRevGraphFailed= \uc785\ub825 \uc2dc \ucc38\uc870 \uc911 \ud558\ub098\uc5d0 \ub300\ud574 \ud55c \ucc38\uc870\uc5d0 \uc788\ub294 \uae30\uc874 xRevision \uadf8\ub798\ud504\ub97c \ub2e4\ub978 \ucc38\uc870\uc5d0 \ucca8\ubd80\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= \ucc38\uc870\uc5d0 \uc774\ubbf8 XRevision \uadf8\ub798\ud504\uac00 \uc788\uae30 \ub54c\ubb38\uc5d0 \ucc38\uc870 \uc911 \ud558\ub098\uc5d0 \ub300\ud55c XRevision \uadf8\ub798\ud504\ub97c \ucca8\ubd80\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.AllocationCrossesExistingOne= \uc774 \ud560\ub2f9\uc740 \uae30\uc874 \ud560\ub2f9\uacfc \uc911\ubcf5\ub429\ub2c8\ub2e4. \uc774\ubcf4\ub2e4 \ub354 \ub192\uc740 \ubaa8\ub378 \ubc84\uc804\uc73c\ub85c \ud560\ub2f9\uc744 \uc2dc\ub3c4\ud558\uc2ed\uc2dc\uc624.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= \ubc94\uc704 \uc124\uc815 \uc791\uc5c5 \uc911\uc5d0\ub294 \uc790\ub3d9 \ud560\ub2f9\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= \ubc94\uc704 \uc124\uc815 \uc791\uc5c5 \uc911\uc5d0 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\uc5d0 \ub300\ud55c \ud30c\uc0dd\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.


Error.xRevision.ParentNotInFrozen= \ud604\uc7ac xRevision \uc694\uc18c\uc758 \uc0c1\uc704 \ud56d\ubaa9\uc774 \uc0ac\uc804 \uc900\ube44 \ub610\ub294 \uc791\uc5c5 \uc911 \uc0c1\ud0dc\uc774\ubbc0\ub85c \uc2b9\uaca9\uc774 \uae08\uc9c0\ub429\ub2c8\ub2e4.
Error.xRevision.AllocatedMVNotReleased= \ud604\uc7ac xRevision \uc694\uc18c\uc5d0 \ud560\ub2f9\ub41c \ubaa8\ub378 \ubc84\uc804\uc740 \ub9b4\ub9ac\uc988\ub428 \uc0c1\ud0dc\uac00 \uc544\ub2c8\ubbc0\ub85c \uc2b9\uaca9\uc774 \uae08\uc9c0\ub429\ub2c8\ub2e4.
Error.xRevision.FoundIncompleteChange= \uc774 xRevision \uc694\uc18c\ub97c \uc0ac\uc6a9 \uc911\uc778 \ubd88\uc644\uc804\ud55c Change Action\uc774 \uc788\uc5b4 \uc2b9\uaca9\uc774 \uae08\uc9c0\ub429\ub2c8\ub2e4.
Error.xRevision.ChildFrozen= \ud604\uc7ac xRevision \uc694\uc18c\uc758 \ud558\uc704 \ud56d\ubaa9\uc774 \ucd5c\uc18c \ub3d9\uacb0\ub428 \uc0c1\ud0dc\uc774\ubbc0\ub85c \uac15\ub4f1\uc774 \uae08\uc9c0\ub429\ub2c8\ub2e4.

Error.xRevision.xRevisionDeleteAction= xRevision \uadf8\ub798\ud504\uc758 \ud55c \uc694\uc18c\ub97c \uc0ad\uc81c\ud560 \uc218 \uc5c6\uac70\ub098 \uae30\ubcf8 \ucc38\uc870\ub97c \uc124\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.PrimaryReferenceDelete= \uadf8\ub798\ud504\uc758 \uae30\ubcf8 \ucc38\uc870\ub97c \uc0ad\uc81c\ud558\ub824\ub294 \uc2dc\ub3c4\ub294 \uae08\uc9c0\ub429\ub2c8\ub2e4.
Error.xRevision.PrimaryReferenceDeleteMulti= \uc5ec\ub7ec xRevision \uc694\uc18c\uac00 \ud3ec\ud568\ub41c \uadf8\ub798\ud504\uac00 \uc788\ub294 \uae30\ubcf8 \ucc38\uc870\ub97c \uc0ad\uc81c\ud558\ub824\ub294 \uc2dc\ub3c4\ub294 \uae08\uc9c0\ub429\ub2c8\ub2e4.
Error.xRevision.DeleteCollabSpace= xRevision \uc694\uc18c\uac00 \uc791\uc5c5 \uc911 \uc0c1\ud0dc\uc774\uace0 \uc0ac\uc6a9\uc790\uc640 \ub3d9\uc77c\ud55c \ud611\uc5c5 \uacf5\uac04\uc5d0 \uc788\uc9c0 \uc54a\uae30 \ub54c\ubb38\uc5d0 \uc0ad\uc81c\uac00 \uae08\uc9c0\ub429\ub2c8\ub2e4.
Error.xRevision.FrozenxRev= xRevision \uc694\uc18c\uac00 \ub108\ubb34 \uc9c4\ud589\ub418\uc5b4\uc11c \uc0ad\uc81c\ud560 \uc218 \uc5c6\ub294 \uc0c1\ud0dc\uc785\ub2c8\ub2e4.
Error.xRevision.DeleteOneSingleElement= \ud558\ub098 \uc774\uc0c1\uc758 \ucc38\uc870\uac00 \ub2e8\uc77c \uc694\uc18c\uac00 \ud3ec\ud568\ub41c \uc774 \uadf8\ub798\ud504\ub97c \uc0ac\uc6a9\ud558\uace0 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.DeleteFirstElement= \ud558\ub098 \uc774\uc0c1\uc758 \ucc38\uc870\uac00 \uc774 \uadf8\ub798\ud504\ub97c \uc0ac\uc6a9\ud558\uace0 \uc788\uae30 \ub54c\ubb38\uc5d0 \uccab \ubc88\uc9f8 \uc694\uc18c\ub97c \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.DeleteOneElement= \ud558\ub098\uc758 xRevision \uc694\uc18c\uac00 \uc0ac\uc6a9\ub418\uc5c8\uc73c\ubbc0\ub85c \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.ReferenceDeleteChildScope= \uadf8\ub798\ud504\uc5d0 \ud558\uc704 \uadf8\ub798\ud504\uac00 \uc788\ub294 \ucc38\uc870 \uc0ad\uc81c \uc2dc\ub3c4\ub294 \uae08\uc9c0\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.GraphDeleteChildScope= \ud558\uc704 \uadf8\ub798\ud504\uac00 \uc788\ub294 \uadf8\ub798\ud504 \uc0ad\uc81c \uc2dc\ub3c4\ub294 \uae08\uc9c0\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.CreateGraphPhyRevs= \ud604\uc7ac \uc544\uc774\ud15c\uc758 \uadf8\ub798\ud504\ub97c \uc0dd\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ubb3c\ub9ac\uc801 \ub9ac\ube44\uc804\uc774 \uc774\ubbf8 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.CreateGraphNoExistCfg= \ud604\uc7ac \uc544\uc774\ud15c\uc758 \uadf8\ub798\ud504\ub97c \uc0dd\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc874\uc7ac\ud558\uc9c0 \uc54a\uac70\ub098 \uad6c\uc131 \uac00\ub2a5\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.xRevision.ReuseGraphDelSource= \ud604\uc7ac \uc544\uc774\ud15c\uc758 \uae30\uc874 \uadf8\ub798\ud504\ub97c \uc7ac\uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc18c\uc2a4 \uc544\uc774\ud15c\uc774 \uc874\uc7ac\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.xRevision.ReuseGraphSourceNoAccess= \ud604\uc7ac \uc544\uc774\ud15c\uc758 \uae30\uc874 \uadf8\ub798\ud504\ub97c \uc7ac\uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ud604\uc7ac \uc0ac\uc6a9\uc790\uc5d0\uac8c \uc18c\uc2a4 \uc544\uc774\ud15c\uc5d0 \uc561\uc138\uc2a4\ud560 \uc218 \uc788\ub294 \uad8c\ud55c\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.ReuseGraphSourceNoCfg= \ud604\uc7ac \uc544\uc774\ud15c\uc758 \uae30\uc874 \uadf8\ub798\ud504\ub97c \uc7ac\uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc18c\uc2a4 \uc544\uc774\ud15c\uc774 \uad6c\uc131 \uac00\ub2a5\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.xRevision.ReuseGraphSourceNoGraph= \ud604\uc7ac \uc544\uc774\ud15c\uc758 \uae30\uc874 \uadf8\ub798\ud504\ub97c \uc7ac\uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc18c\uc2a4 \uc544\uc774\ud15c\uc5d0 \uadf8\ub798\ud504\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
