#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=\ud50c\ub798\uadf8\uac00 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \uc5c6\uc2b5\ub2c8\ub2e4.
Effectivity.Alert.FlagDisabledInDB=\ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \ud50c\ub798\uadf8\uac00 \uc788\uc73c\uba70 \ube44\ud65c\uc131\ud654\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
Effectivity.Alert.FlagEnabledInDB=\ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \ud50c\ub798\uadf8\uac00 \uc788\uc73c\uba70 \ud65c\uc131\ud654\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
Effectivity.Alert.FilterableERTypesNotExistInDB=\ud544\ud130\ub9c1 \uac00\ub2a5\ud55c ER \uc720\ud615\uc774 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \uc5c6\uc2b5\ub2c8\ub2e4.
Effectivity.Alert.FilterableERTypesFoundInDB=\ud544\ud130\ub9c1 \uac00\ub2a5\ud55c ER \uc720\ud615\uc744 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0\uc11c \ucc3e\uc558\uc2b5\ub2c8\ub2e4.

Error.AlreadyAttached=\uacbd\uace0: ID\uac00 "<ModelID>"\uc778 \ubaa8\ub378\uc774 \uc774\ubbf8 \ucc38\uc870\uc5d0 \uc5f0\uacb0\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4!
Error.AlreadyDetached=\uacbd\uace0: ID\uac00 "<ModelID>"\uc778 \ubaa8\ub378\uc774 \uc774\ubbf8 \ubd84\ub9ac\ub418\uc5c8\uc2b5\ub2c8\ub2e4!
Error.AlreadyAttachedMV=\uacbd\uace0: ID\uac00 "<ModelVersionID>"\uc778 \ubaa8\ub378 \ubc84\uc804\uc774 \uc774\ubbf8 \ucc38\uc870\uc5d0 \uc5f0\uacb0\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4...!
Error.AlreadyDetachedMV=\uacbd\uace0: ID\uac00 "<ModelVersionID>"\uc778 \ubaa8\ub378 \ubc84\uc804\uc774 \uc774\ubbf8 \ubd84\ub9ac\ub418\uc5c8\uc2b5\ub2c8\ub2e4...!

Error.TypeNotAModel=\ubaa8\ub4dc \uc720\ud615\uc774 \uc544\ub2d8
Error.InternalServerError=\ub0b4\ubd80 \uc624\ub958
Error.ObjectNotFound=\ucc3e\uc744 \uc218 \uc5c6\uc74c
Error.XCADConfigurationNotPossible=\uc81c\ud488 \uad6c\uc870\ub97c \uad6c\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.DetachNotPossible.ConfigurationUsage=\uc0ac\uc591\uc5d0\uc11c \uc0ac\uc6a9 \uc911\uc774\ubbc0\ub85c \ubaa8\ub378\uc744 \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.DetachNotPossible.EffectivityUsage=\ubaa8\ub378\uc774 \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc5d0\uc11c \uc0ac\uc6a9\ub418\ubbc0\ub85c \ubaa8\ub378\uc744 \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc74c
Error.DetachNotPossible.ConfigurationRevision=\ucc38\uc870\uc5d0 ConfigurationRevisions\uc774 \uc788\uc73c\ubbc0\ub85c \ubaa8\ub378\uc744 \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc74c
Error.DetachNotPossible.ConfigRevision=\ucc38\uc870\uc5d0 \uc0ac\uc591 \ub9ac\ube44\uc804\uc774 \uc788\uc73c\ubbc0\ub85c \ubaa8\ub378\uc744 \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.Unset.NoEffectivity=\uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc720\ud6a8\uc131\uc774 \uc5c6\uc74c, \uc124\uc815 \ud574\uc81c\ud574\ub3c4 \uc18c\uc6a9 \uc5c6\uc74c
Error.Unset.Domain.Forbidden=\uc785\ub825 \ub3c4\uba54\uc778\uc740 \uae08\uc9c0\ub428
Error.Unset.Instance.Controlled.Change=\uc785\ub825 \uc778\uc2a4\ud134\uc2a4\ub294 \ubcc0\uacbd\uc73c\ub85c \uc81c\uc5b4\ub428
Error.Unset.NoEffectivity.ForDomain=\uc774 \ub3c4\uba54\uc778\uc5d0 \ub300\ud55c \uc720\ud6a8\uc131\uc774 \uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc5c6\uc74c

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=\ud50c\ub798\uadf8\uac00 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \uc5c6\uc2b5\ub2c8\ub2e4.
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=\ud50c\ub798\uadf8\uac00 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \uc788\uc2b5\ub2c8\ub2e4.

Error.SetEffectivity.CriteriaNotEnabled=\uae30\uc900\uc774 \uc0c1\uc704 \ucc38\uc870\uc5d0\uc11c \ud65c\uc131\ud654\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.IncorrectEffectivityXML=\uc785\ub825 \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd \ub610\ub294 \ud45c\ud604\uc2dd\uc5d0 \uc0ac\uc6a9\ub41c \ub370\uc774\ud130\uac00 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.InvalidInstancePhysicalID=\uc785\ub825\uc5d0 \uc788\ub294 \uc778\uc2a4\ud134\uc2a4 \uc2dd\ubcc4\uc790\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uac70\ub098 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.LoadDictionaryFailed=\uc0ac\uc804 \ub370\uc774\ud130 \ub54c\ubb38\uc5d0 \uc720\ud6a8\uc131\uc744 \uc124\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. 
Error.SetEffectivity.3DPartNotConfigurable=\ub8e8\ud2b8 \ucc38\uc870\uac00 \uad6c\uc131\ud560 \uc218 \uc5c6\ub294 3DPart\uc785\ub2c8\ub2e4. 
Error.SetEffectivity.XCADNotConfigurable=\ub8e8\ud2b8 \ucc38\uc870\uac00 \uad6c\uc131\ud560 \uc218 \uc5c6\ub294 XCAD\ub85c \uc81c\uc5b4\ub429\ub2c8\ub2e4.
Error.SetEffectivity.ModelNotAccessibleORExist=\uc785\ub825 \ud45c\ud604\uc2dd\uc5d0\uc11c \uc81c\uacf5\ud55c \ubaa8\ub378\uc5d0 \uc561\uc138\uc2a4\ud560 \uc218 \uc5c6\uac70\ub098 \uc874\uc7ac\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.NoModelFoundInExpression=\uc785\ub825 \ud45c\ud604\uc2dd\uc758 \ud615\uc2dd\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4(\ubaa8\ub378\uc774 \uc5c6\uc74c).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=\uc785\ub825 \ud45c\ud604\uc2dd\uc5d0\uc11c \uc0ac\uc6a9\ub41c \uae30\uc900\uc774 \uc0c1\uc704 \ucc38\uc870\uc5d0\uc11c \ud65c\uc131\ud654\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.ErrorSaveEffectivities=\uc0c8 \uc720\ud6a8\uc131 \uc800\uc7a5 \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=\uc0ac\uc591 \ub9ac\ube44\uc804 \uc720\ud6a8\uc131 \uc5c5\ub370\uc774\ud2b8 \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=\uc778\uc2a4\ud134\uc2a4\uac00 \ud558\ub098 \uc774\uc0c1\uc758 \ub9b4\ub9ac\uc988\ub41c \uc804\uac1c\uc758 \uc77c\ubd80\uc785\ub2c8\ub2e4. \uc0c8 \uc804\uac1c \ud45c\ud604\uc2dd\uc744 \uc801\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.ReferenceNotConfigurable=\uc0c1\uc704 \ucc38\uc870\ub97c \uad6c\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.InstanceControlledByChange=\uc785\ub825 \uc778\uc2a4\ud134\uc2a4\ub294 \ubcc0\uacbd\uc73c\ub85c \uc81c\uc5b4\ub429\ub2c8\ub2e4. \uc804\uac1c \uc720\ud6a8\uc131\uc740 \ud3b8\uc9d1\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.RootNotConfigured=\uc9c0\uc815\ub41c \uc778\uc2a4\ud134\uc2a4\uc758 \uc0c1\uc704 \ucc38\uc870\uc5d0 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.ModelNotAttached=\uc785\ub825 \ud45c\ud604\uc2dd\uc5d0\uc11c \uc81c\uacf5\ud55c \ubaa8\ub378\uc774 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\uc758 \uc77c\ubd80\uac00 \uc544\ub2d9\ub2c8\ub2e4.
Error.SetEffectivity.NotAllNecessaryModelsAttached=\ud544\uc694\ud55c \uc77c\ubd80 \ubaa8\ub378\uc774 \uc0c1\uc704 \ucc38\uc870\uc5d0 \ucca8\ubd80\ub418\uc5b4 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.InstControlledByChange=\uc785\ub825 \uc778\uc2a4\ud134\uc2a4\ub294 \ubcc0\uacbd\uc73c\ub85c \uc81c\uc5b4\ub429\ub2c8\ub2e4. \uc804\uac1c \uc720\ud6a8\uc131\uc740 \ud3b8\uc9d1\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.FailureDuringOperation=\uc791\uc5c5 \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uacac\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=\ud45c\ud604\uc2dd\uc774 \uc720\ud6a8\uc131\uc5d0 \ud558\ub098 \uc774\uc0c1\uc758 \ub3d9\uacb0\ub41c \uc804\uac1c \uae30\uc900\uc744 \ucd94\uac00\ud558\uac70\ub098 \uc81c\uac70\ud558\uae30 \ub54c\ubb38\uc5d0 \ud45c\ud604\uc2dd\uc744 \uc124\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=Change Action\uc774 \uc774\ubbf8 \uc720\ud6a8\ud558\uc9c0\ub9cc \uc74c\uc218\ub85c \uc815\uc758\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
Error.SetEffectivity.FailureDueToNoIntersection=\uc778\uc2a4\ud134\uc2a4\uc758 \uc720\ud6a8\uc131 \ubc94\uc704\uc640 \uc791\uc131 \ucee8\ud14d\uc2a4\ud2b8 \ubc94\uc704 \uc0ac\uc774\uc5d0 \uad50\ucc28\uc810\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.IsEffsCoverEffRange.FailureDuringOperation=\uc804\uac1c \uc720\ud6a8\uc131\uc5d0 \uc9c0\uc815\ub41c \uc804\uac1c \uc720\ud6a8\uc131 \ubc94\uc704\uac00 \ud3ec\ud568\ub418\ub294\uc9c0 \uc5ec\ubd80\ub97c \ud655\uc778\ud558\ub294 \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.

Error.AttachCfgContext.FailedDueToMultipleMVs=\uad6c\uc131 \uac00\ub2a5\ud55c \uac1c\uccb4\uc5d0 \ucca8\ubd80\ud560 \ub2e4\uc911 \ubaa8\ub378 \ubc84\uc804\uc740 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ud604\uc7ac\ub294 \ud558\ub098\uc758 \ubaa8\ub378 \ubc84\uc804 \ucca8\ubd80\ub9cc \uc9c0\uc6d0\ub429\ub2c8\ub2e4.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=\uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\uac00 \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc5d0\uc11c \uc0ac\uc6a9\ub418\ubbc0\ub85c \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\ub97c \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.AttributeVersionNotPresent=\uc785\ub825 json\uc5d0 \ud544\uc218 \uc18d\uc131 \ubc84\uc804\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeVersionIsInvalid=\uc785\ub825 \uc2dc \uc18d\uc131 \ubc84\uc804 \uac12\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\ud55c \ubc84\uc804 \uac12\uc740 1.0\uc785\ub2c8\ub2e4.
Error.AttributeResourcesNotPresent=\uc785\ub825 json\uc5d0 \ud544\uc218 \uc18d\uc131 \ub9ac\uc18c\uc2a4\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeResourcesIsEmpty=\uc785\ub825 json\uc5d0\uc11c \uc18d\uc131 \ub9ac\uc18c\uc2a4\uac00 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.AttributeIdentifierNotPresent=\uc785\ub825 json\uc5d0 \ud544\uc218 \uc18d\uc131 \uc2dd\ubcc4\uc790\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeIdentifierIsEmpty=\uc785\ub825 json\uc5d0\uc11c \uc18d\uc131 \uc2dd\ubcc4\uc790\ub294 null\uc774\uac70\ub098 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeConfigFilterIdentifierNotPresent=\uc785\ub825 json\uc5d0 \ud544\uc218 \uc18d\uc131 configFilterIdentifier\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeConfigFilterIdentifierIsEmpty=\uc785\ub825 json\uc5d0\uc11c configFilterIdentifier \uc18d\uc131\uc740 null\uc774\uac70\ub098 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeViewIsNotValid=\uc785\ub825 \uc2dc \uc18d\uc131 \ubcf4\uae30 \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\ud55c \ubcf4\uae30 \uac12\uc740 \ud604\uc7ac \ub610\ub294 \ud22c\uc0ac\ub428\uc785\ub2c8\ub2e4.
Error.AttributeModeIsNotValid=\uc785\ub825 \uc2dc \uc18d\uc131 \ubaa8\ub4dc \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\ud55c \ubaa8\ub4dc \uac12\uc740 \uc5c4\uaca9 \ub610\ub294 150%\uc785\ub2c8\ub2e4.
Error.PhysicalIdIsInvalid=\uc785\ub825\uc5d0 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc740 \uc778\uc2a4\ud134\uc2a4 \uc2e4\uc81c ID\uac00 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.NotTypeOfVPMInstance=\uc785\ub825\uc5d0 \uc778\uc2a4\ud134\uc2a4 \uc720\ud615\uc774 \uc544\ub2cc \uc2e4\uc81c ID\uac00 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.ConfigurationFilterPIDIsInvalid=\uc785\ub825\uc5d0 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc740 \uc0ac\uc591 \ud544\ud130 \uc2e4\uc81c ID\uac00 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.ConfigurationFilterTypeIsNotSupported=\uc785\ub825\uc5d0 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \uc0ac\uc591 \ud544\ud130 \uc720\ud615\uc774 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.InstanceDoesNotHaveStaticMapping=\uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0\ub294 \uc815\uc801 \ub9e4\ud551\uc774 \uc5c6\uae30 \ub54c\ubb38\uc5d0 \uc778\uc2a4\ud134\uc2a4\uc758 \uc815\uc801 \ub9e4\ud551\uc744 \uc5c5\ub370\uc774\ud2b8\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.AttributeModelPIDNotPresent=\uc785\ub825 json\uc5d0 \ud544\uc218 \uc18d\uc131 modelPID\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeModelPIDIsEmpty=\uc785\ub825 json\uc5d0\uc11c modelPID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.AttributeViewIsInvalid=\uc18d\uc131 \ubcf4\uae30 \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc774 \uc18d\uc131\uc5d0 \uc720\ud6a8\ud55c \uac12\uc740 \ud604\uc7ac, \ud22c\uc0ac\ub428 \ub610\ub294 \uc804\uccb4\uc785\ub2c8\ub2e4.
Error.AttributeFormatIsInvalid=\uc18d\uc131 \ud615\uc2dd \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc774 \uc18d\uc131\uc5d0 \uc720\ud6a8\ud55c \uac12\uc740 TXT \ub610\ub294 XML\uc785\ub2c8\ub2e4.
Error.AttributeOccurrencesNotPresent=\uc785\ub825 json\uc5d0 \ud544\uc218 \uc18d\uc131 \ubc1c\uc0dd\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeOccurrencesIsEmpty=\uc785\ub825 json\uc5d0\uc11c \uc18d\uc131 \ubc1c\uc0dd\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.

Error.FlagDoesNotExistInDatabase=\ud50c\ub798\uadf8\uac00 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.FlagFoundInDatabase=\ud50c\ub798\uadf8\uac00 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0 \uc788\uc2b5\ub2c8\ub2e4.

Error.xRevision.AttachScopeFailed=\uc774 \ucc38\uc870\uc5d0 \ubc94\uc704\ub97c \ucca8\ubd80\ud558\ub294 \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
Error.xRevision.DetachScopeFailed=\uc774 \ucc38\uc870\uc5d0\uc11c \ubc94\uc704\ub97c \ubd84\ub9ac\ud558\ub294 \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=XRevision \uadf8\ub798\ud504\uac00 \ucca8\ubd80\ub418\uc9c0 \uc54a\uc558\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0 \ub300\ud55c \ubc94\uc704\ub97c \ucca8\ubd80\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=XRevision \uadf8\ub798\ud504\uac00 \ucca8\ubd80\ub418\uc9c0 \uc54a\uc558\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0 \ub300\ud55c \ubc94\uc704\ub97c \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.EnableVariantCriteriaFailed=\ucc38\uc870\uc5d0 \ubc94\uc704\uac00 \ucca8\ubd80\ub418\uc9c0 \uc54a\uc558\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0 \ub300\ud55c \ud30c\uc0dd \uae30\uc900\uc744 \uc124\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.xRevision.ReferenceNotConfigurable=\uc774 \ucc38\uc870\ub294 \uad6c\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.AttributeVersionIsNotPresent=\uc785\ub825 \uc2dc \uc18d\uc131 \ubc84\uc804\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeVersionIsNotCorrect=\uc18d\uc131 \ubc84\uc804 \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\ud55c \uac12\uc740 1.0\uc785\ub2c8\ub2e4.
Error.AttributeEvolutionIdentifiersIsNotPresent=\uc785\ub825 \uc2dc evolutionsIdentifiers \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=\uc785\ub825 \uc2dc evolutionsIdentifiers \uc18d\uc131\uc774 \ube44\uc5b4 \uc788\uac70\ub098 null\uc785\ub2c8\ub2e4.
Error.EvolutionPhysicalIsNullOREmpty=\uc785\ub825 \uc2dc \uc804\uac1c \uc2e4\uc81c ID \uc911 \ud558\ub098 \uc774\uc0c1\uc774 \ube44\uc5b4 \uc788\uac70\ub098 null\uc785\ub2c8\ub2e4.
Error.AttributeDetaislRequiredIsNotPresent=\uc785\ub825 \uc2dc detailsRequired \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeDetaislRequiredIsNotCorrect=detailsRequired \uc18d\uc131 \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\ud55c \uac12\uc740 \uc608 \ub610\ub294 \uc544\ub2c8\uc694\uc785\ub2c8\ub2e4.
Error.MixEvolutionsNotAllowed=\uc785\ub825\uc5d0 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \uc804\uac1c \uc720\ud615\uc774 \ud63c\ud569\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \ud55c \uac00\uc9c0 \uc720\ud615\uc758 \uc804\uac1c \uc2e4\uc81c ID\ub97c \uc81c\uacf5\ud558\uc2ed\uc2dc\uc624.
Error.EvolutionsPIDNotValid=\uc774 \uc804\uac1c \uc2e4\uc81c ID\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

Error.AttributeWorkUnderCompiledForm=\uc785\ub825 \uc2dc workUnderCompiledForm \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.AttributeInstancePIDNotPresent=\uc785\ub825 \uc2dc instancePID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeInstancePIDNotValid=\uc785\ub825 \uc2dc instancePID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.AttributeEffectivityCompiledFormNotPresent=\uc785\ub825 \uc2dc effectivityCompiledForm \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeEffectivityCompiledFormIsInvalid=\uc785\ub825 \uc2dc effectivityCompiledForm \uc18d\uc131\uc774 null\uc785\ub2c8\ub2e4.
Error.AtleastOneModelPIDIsNullOREmpty=\uc785\ub825 \uc2dc \ubaa8\ub378 \uc2e4\uc81c ID \uc911 \ud558\ub098 \uc774\uc0c1\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.RefORInstOrCAOrACShouldBePresent=\uc785\ub825 \uc2dc \uc778\uc2a4\ud134\uc2a4 \ub610\ub294 Change Action \ub610\ub294 \uc791\uc131 \ucee8\ud14d\uc2a4\ud2b8 \uc911 \ud558\ub098\ub294 \ud544\uc694\ud569\ub2c8\ub2e4.
Error.AttributeVersionReferencePIDNotPresent=\uc785\ub825 \uc2dc referencePID \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.AttributeVersionReferencePIDNotInvalid=\uc785\ub825 \uc2dc referencePID \uc18d\uc131\uc774 null\uc774\uac70\ub098 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.CannotCreateXRevGraphModelAttached=\uc774\ubbf8 \ubaa8\ub378\uc774 \ucca8\ubd80\ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0\uc11c XRevision \uadf8\ub798\ud504\ub97c \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=\uc18c\uc2a4 \ucc38\uc870\uc5d0 \ucca8\ubd80\ub41c XRevision \uadf8\ub798\ud504\uac00 \uc5c6\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0\uc11c XRevision \uadf8\ub798\ud504\ub97c \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=\uc18c\uc2a4 \ucc38\uc870\uc5d0 \uc774\ubbf8 \ubaa8\ub378\uc774 \ucca8\ubd80\ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc774 \ucc38\uc870\uc5d0\uc11c XRevision \uadf8\ub798\ud504\ub97c \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.xRevision.xRevGraphAlreadyHasScope=\uc774 \ucc38\uc870\uc758 xRevision \uadf8\ub798\ud504\uc5d0 \uc774\ubbf8 \ubc94\uc704\uac00 \uc788\uc2b5\ub2c8\ub2e4.
Error.xRevision.xRevGraphHasNoScopeToDelete=\uc774 \ucc38\uc870\uc758 xRevision \uadf8\ub798\ud504\uc5d0 \uc0ad\uc81c\ud560 \ubc94\uc704\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=\uc774 \ucc38\uc870\uc758 xRevision \uadf8\ub798\ud504\uc5d0 \uc77c\ubd80 \ud560\ub2f9\uc774 \uc788\uc73c\ubbc0\ub85c \ubc94\uc704\ub97c \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.InvalidInstancePID=\uc774 \uc778\uc2a4\ud134\uc2a4 \uc2e4\uc81c ID\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

Error.FailedToDisableCriteria=\ud558\ub098 \uc774\uc0c1\uc758 \uc778\uc2a4\ud134\uc2a4 \uc720\ud6a8\uc131\uc5d0 <CriteriaName>\uc774(\uac00) \uc0ac\uc6a9\ub418\uc5c8\uc744 \uc218 \uc788\uc73c\ubbc0\ub85c \uad6c\uc131\ub41c \uac1c\uccb4\uc5d0 \ub300\ud55c \uae30\uc900\uc744 \ube44\ud65c\uc131\ud654\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
Criteria.Date=\ub0a0\uc9dc
Criteria.ManufacturingPlans=\uc81c\uc870 \uacc4\ud68d
Criteria.Unit=\ub2e8\uc704
Criteria.FeatureOption=\ud30c\uc0dd \ubc0f \uc635\uc158
Criteria.ModelVersion=\ubaa8\ub378 \ubc84\uc804

Warning.InstanceNotFilterable=\uc778\uc2a4\ud134\uc2a4\ub294 \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc744 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Warning.NotPossibleExtendOnThisInstance=\uc774\ubbf8 \ubaa8\ub4e0 \uc804\uac1c\uc5d0\uc11c \uc0ac\uc6a9 \uac00\ub2a5\ud55c \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c\ub294 \ud655\uc7a5 \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.ExtendFailedOnThisInstance=\uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c\ub294 \ud655\uc7a5 \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.InvalidPhysicalPID=\uc774 \uc2e4\uc81c ID\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

Cfg.Error.ErrorMissingParameterInWebService=<key> \ud30c\ub77c\ubbf8\ud130\uac00 \ub204\ub77d\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc694\uccad\ud560 \ub54c\ub294 \ud544\uc694\ud55c \ubaa8\ub4e0 \ud30c\ub77c\ubbf8\ud130\ub97c \ud3ec\ud568\ud558\uc2ed\uc2dc\uc624.
Cfg.Error.ErrorIncorrectParameterValueInWebService=<key> \ud30c\ub77c\ubbf8\ud130 \uac12\uc774 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc694\uccad\ud560 \ub54c\ub294 \uc720\ud6a8\ud55c \ud30c\ub77c\ubbf8\ud130 \uac12\uc744 \ud3ec\ud568\ud558\uc2ed\uc2dc\uc624.
Cfg.Error.ErrorIncorrectArraySizeInWebService=<key> \ubc30\uc5f4 \ud06c\uae30\uac00 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc694\uccad\ud560 \ub54c\ub294 \uc774 \ubc30\uc5f4\uc758 \ud06c\uae30\uac00 \uc62c\ubc14\ub978\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
Cfg.Error.ErrorExactlyOneParameterRequired=<key>\uc758 \ud30c\ub77c\ubbf8\ud130 \uc870\ud569\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc694\uccad\ud560 \ub54c\ub294 \ud544\uc694\ud55c \ud30c\ub77c\ubbf8\ud130 \uc911 \ud558\ub098\ub9cc \uc81c\uacf5\ud588\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
Cfg.Error.ErrorInvalidPayloadInWebService=\uc694\uccad \ud398\uc774\ub85c\ub4dc\uac00 \uc608\uc0c1 \uc2a4\ud0a4\ub9c8 \ub610\ub294 \ud615\uc2dd\uc744 \uc900\uc218\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uad6c\uc870, \ub370\uc774\ud130 \uc720\ud615 \ubc0f \ud544\uc218 \ud544\ub4dc\ub97c \ud655\uc778\ud558\uc2ed\uc2dc\uc624.

Error.xRevision.NotPossibleToAttachScopes=XRevision \uadf8\ub798\ud504\uac00 \ucca8\ubd80\ub418\uc9c0 \uc54a\uc558\uae30 \ub54c\ubb38\uc5d0 \uc785\ub825 \uc2dc \ucc38\uc870 \uc911 \ud558\ub098 \uc774\uc0c1\uc5d0 \ub300\ud55c \ubc94\uc704\ub97c \ucca8\ubd80\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.ConfigFilterNotFoundOnReference=\ucc38\uc870 \uac1c\uccb4\uc5d0\uc11c \uc785\ub825 \uc0ac\uc591 \ud544\ud130\ub97c \ucc3e\uc744 \uc218 \uc5c6\uae30 \ub54c\ubb38\uc5d0 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc815\uc801 \ub9e4\ud551\uc744 \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Error.InstanceAlreadyHasStaticMapping=\uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0\ub294 \uc774\ubbf8 \uc815\uc801 \ub9e4\ud551\uc774 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc815\uc801 \ub9e4\ud551\uc744 \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.NotAccessibleObject=\uc774 \ucf58\ud150\uce20\ub294 \ub354 \uc774\uc0c1 \uc561\uc138\uc2a4\ud560 \uc218 \uc5c6\uac70\ub098 \uc0ad\uc81c\ub418\uc5c8\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
Error.DoesNotExistObject=\uc120\ud0dd\ud55c \uac1c\uccb4\ub294 \uc874\uc7ac\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

Error.ConfigFilterIsTooMature=\uc785\ub825 \uc0ac\uc591 \ud544\ud130\uac00 \ud3d0\uae30 \uc0c1\ud0dc\uc774\uae30 \ub54c\ubb38\uc5d0 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc815\uc801 \ub9e4\ud551\uc744 \uc791\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.ModelVersionAlreadyAttach=\uc774\ubbf8 \ubaa8\ub378 \ubc84\uc804\uc774 \ucca8\ubd80\ub418\uc5b4 \uc788\ub294 \uacbd\uc6b0 \uc774 \ubaa8\ub378\uc744 \ucca8\ubd80\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

Error.xRevision.RefDoesNotHaveXRevGraph=\uc785\ub825 \uc2dc \ubc94\uc704\ub85c \ucca8\ubd80\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \ucc38\uc870 \uc911 \ud558\ub098\uc5d0 xRevision \uadf8\ub798\ud504\uac00 \ucca8\ubd80\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
Error.xRevision.ErrorNoXGraphFoundForReference=\uc785\ub825\ub41c \ucc38\uc870\uc5d0 xRevision Graph\uac00 \ucca8\ubd80\ub418\uc5b4 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
