#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= Das Attribut version ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeVersionIsInvalid= Der Wert des Attributs version ist ung\u00fcltig. Ein g\u00fcltiger Wert ist 1.0.

Error.xRevision.AttributeVersionReferencePIDNotPresent= Das Attribut referencePID ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= Das Attribut referencePID ist null oder in der Eingabe leer.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= Es ist nicht m\u00f6glich, ein XRevision-Diagramm in dieser Referenz zu erstellen, weil es bereits daran angef\u00fcgt ist.
Error.xRevision.CannotCreateXRevGraphModelAttached= Es ist nicht m\u00f6glich, ein XRevision-Diagramm in dieser Referenz zu erstellen, weil ein Modell bereits daran angef\u00fcgt ist.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= Das Attribut xRevisionElementPID ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= Das Attribut xRevisionElementPID ist null oder in der Eingabe leer.
Error.xRevision.AttributeXRevElementPIDNotValid= Die physische ID des xRevision-Elements ist in der Eingabe nicht g\u00fcltig.

Error.xRevision.AttributeAllocationsIsNotPresent= Das Attribut allocations ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeAllocationsIsNullOREmpty= Das Attribut allocations ist null oder in der Eingabe leer.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= Das Attribut allocationPIDs ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= Das Attribut allocationPIDs ist null oder in der Eingabe leer.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Mindestens eine physische ID f\u00fcr die Zuweisung in der Eingabe ist null oder leer.
Error.xRevision.MultiAllocationIsNotSupported= Mehrere Zuweisungen zu einem xRevision-Element werden noch nicht unterst\u00fctzt.
Error.xRevision.AllocationPIDIsNotValid= Die in der Eingabe bereitgestellte Zuweisung ist ung\u00fcltig oder nicht Teil eines xRevision-Diagramms.
Error.xRevision.xRevElementAlreadyHasAllocation= Das xRevision-Element verf\u00fcgt bereits \u00fcber Zuweisungen.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= Das Attribut xRevisionElementPIDs ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= Das Attribut xRevisionElementPIDs ist null oder in der Eingabe leer.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Mindestens eine physische ID des xRevision-Elements ist null oder in der Eingabe leer.
Error.xRevision.XRevisionElementPIDNotValid= Die physische ID dieses xRevision-Elements ist ung\u00fcltig.

Error.xRevision.AttributeDeallocationsIsNotPresent= Das Attribut deallocations ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= Das Attribut deallocations ist null oder in der Eingabe leer.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= Das Attribut deallocationPIDs ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= Das Attribut deallocationPIDs ist null oder in der Eingabe leer.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Mindestens eine der physischen IDs f\u00fcr die Aufhebung der Zuweisung ist null oder in der Eingabe leer.
Error.xRevision.MultiDeallocationIsNotSupported= Mehrere Aufhebungen der Zuweisung von einem xRevision-Element werden noch nicht unterst\u00fctzt.
Error.xRevision.DeallocationPIDIsNotValid= Die in der Eingabe bereitgestellte Aufhebung der Zuweisung ist ung\u00fcltig oder nicht Teil eines xRevision-Diagramms.
Error.xRevision.xRevElementDoesNotHaveAllocation= Dieses xRevision-Element verf\u00fcgt nicht \u00fcber Zuweisungen.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= Das Attribut xRevisionGraphsToAttach ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= Das Attribut xRevisionGraphsToAttach ist in der Eingabe leer.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= Das Attribut reusableGraphReferencePID ist in der Eingabe nicht vorhanden.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= Das Attribut reusableGraphReferencePID ist null oder in der Eingabe leer.
Error.xRevision.AttachExistingXRevGraphFailed= Das Anf\u00fcgen eines vorhandenen xRevision-Diagramms von einer Referenz an eine andere Referenz ist f\u00fcr eine der Referenzen in der Eingabe fehlgeschlagen.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= Es ist nicht m\u00f6glich, ein xRevision-Diagramm an eine der Referenzen anzuf\u00fcgen, weil die Referenz bereits \u00fcber ein xRevision-Diagramm verf\u00fcgt.
Error.xRevision.AllocationCrossesExistingOne= Diese Zuweisung \u00fcberschneidet sich mit einer vorhandenen. Versuchen Sie es mit der Zuweisung zu einer h\u00f6heren Modellversion als dieser.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= Die automatische Zuweisung kann w\u00e4hrend des Festlegens eines Bereichs nicht durchgef\u00fchrt werden.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= W\u00e4hrend des Festlegens des Bereichs wurden keine Varianten f\u00fcr den Konfigurationskontext gefunden.


Error.xRevision.ParentNotInFrozen= Das \u00fcbergeordnete Element des aktuellen xRevision-Elements hat den Status 'Vorl\u00e4ufig' oder 'In Arbeit'; das Hochstufen ist nicht zul\u00e4ssig.
Error.xRevision.AllocatedMVNotReleased= Die dem aktuellen xRevision-Element zugewiesene Modellversion ist nicht freigegeben; das Hochstufen ist nicht zul\u00e4ssig.
Error.xRevision.FoundIncompleteChange= Es gibt unvollst\u00e4ndige \u00c4nderungsaktionen, die dieses xRevision-Element verwenden; das Hochstufen ist nicht zul\u00e4ssig.
Error.xRevision.ChildFrozen= Das untergeordnete Element des aktuellen xRevision-Elements hat mindestens den Status 'Eingefroren'; das Zur\u00fccksetzen ist nicht zul\u00e4ssig.

Error.xRevision.xRevisionDeleteAction= Ein Element des xRevision-Diagramms kann nicht gel\u00f6scht werden oder die prim\u00e4re Referenz kann nicht festgelegt werden.
Error.xRevision.PrimaryReferenceDelete= Das L\u00f6schen der prim\u00e4ren Referenz des Diagramms ist nicht zul\u00e4ssig.
Error.xRevision.PrimaryReferenceDeleteMulti= Das L\u00f6schen der prim\u00e4ren Referenz, die ein Diagramm mit mehreren xRevision-Elementen hat, ist nicht zul\u00e4ssig.
Error.xRevision.DeleteCollabSpace= Das xRevision-Element hat nicht den Status 'In Arbeit' und befindet sich nicht im selben Teamarbeitsbereich wie der Benutzer; das L\u00f6schen ist nicht zul\u00e4ssig.
Error.xRevision.FrozenxRev= Das xRevision-Element befindet sich in einem Status, der zu weit vorangeschritten ist, um das L\u00f6schen zu erlauben.
Error.xRevision.DeleteOneSingleElement= Mehrere Referenzen verwenden dieses Diagramm mit einem einzelnen Element; das L\u00f6schen ist nicht zul\u00e4ssig.
Error.xRevision.DeleteFirstElement= Mehrere Referenzen verwenden dieses Diagramm; das L\u00f6schen des ersten Elements ist nicht zul\u00e4ssig.
Error.xRevision.DeleteOneElement= Ein xRevision-Element wird verwendet und kann nicht gel\u00f6scht werden.
Error.xRevision.ReferenceDeleteChildScope= Das L\u00f6schen einer Referenz, deren Diagramm untergeordnete Diagramme hat, ist nicht zul\u00e4ssig.
Error.xRevision.GraphDeleteChildScope= Das L\u00f6schen eines Diagramms, das untergeordnete Diagramme hat, ist nicht zul\u00e4ssig.
Error.xRevision.CreateGraphPhyRevs= Ein Diagramm f\u00fcr das aktuelle Element kann nicht erstellt werden. Es verf\u00fcgt bereits \u00fcber physische Revisionen.
Error.xRevision.CreateGraphNoExistCfg= Ein Diagramm f\u00fcr das aktuelle Element kann nicht erstellt werden. Es existiert nicht oder ist nicht konfigurierbar.
Error.xRevision.ReuseGraphDelSource= Ein vorhandenes Diagramm kann f\u00fcr das aktuelle Element nicht wiederverwendet werden. Das Quellelement existiert nicht.
Error.xRevision.ReuseGraphSourceNoAccess= Ein vorhandenes Diagramm kann f\u00fcr das aktuelle Element nicht wiederverwendet werden. Der aktuelle Benutzer hat keinen Zugriff auf das Quellelement.
Error.xRevision.ReuseGraphSourceNoCfg= Ein vorhandenes Diagramm kann f\u00fcr das aktuelle Element nicht wiederverwendet werden. Das Quellelement ist nicht konfigurierbar.
Error.xRevision.ReuseGraphSourceNoGraph= Ein vorhandenes Diagramm kann f\u00fcr das aktuelle Element nicht wiederverwendet werden. Das Quellelement hat kein Diagramm.
