#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=Flaga nie istnieje w bazie danych.
Effectivity.Alert.FlagDisabledInDB=Flaga istnieje w bazie danych i jest wy\u0142\u0105czona.
Effectivity.Alert.FlagEnabledInDB=Flaga istnieje w bazie danych i jest w\u0142\u0105czona.
Effectivity.Alert.FilterableERTypesNotExistInDB=W bazie danych nie istniej\u0105 podatne na filtrowanie typy ER.
Effectivity.Alert.FilterableERTypesFoundInDB=W bazie danych znaleziono podatne na filtrowanie typy ER.

Error.AlreadyAttached=OSTRZE\u017bENIE: Model o identyfikatorze "<ModelID>" jest ju\u017c do\u0142\u0105czony do odniesienia!
Error.AlreadyDetached=OSTRZE\u017bENIE: Model o identyfikatorze "<ModelID>" jest ju\u017c od\u0142\u0105czony!
Error.AlreadyAttachedMV=OSTRZE\u017bENIE: Wersja modelu o identyfikatorze "<ModelVersionID>" jest ju\u017c do\u0142\u0105czona do odniesienia!
Error.AlreadyDetachedMV=OSTRZE\u017bENIE: Wersja modelu o identyfikatorze "<ModelVersionID>" jest ju\u017c od\u0142\u0105czona!

Error.TypeNotAModel=nie jest typem modelu
Error.InternalServerError=b\u0142\u0105d wewn\u0119trzny
Error.ObjectNotFound=nie znaleziono
Error.XCADConfigurationNotPossible=nie mo\u017cna skonfigurowa\u0107 struktury produktu.

Error.DetachNotPossible.ConfigurationUsage=Nie mo\u017cna od\u0142\u0105czy\u0107 modelu, poniewa\u017c jest on u\u017cywany w konfiguracji
Error.DetachNotPossible.EffectivityUsage=Nie mo\u017cna od\u0142\u0105czy\u0107 modelu, poniewa\u017c jest on u\u017cywany w wyra\u017ceniu skuteczno\u015bci
Error.DetachNotPossible.ConfigurationRevision=Od\u0142\u0105czenie modelu nie jest mo\u017cliwe, poniewa\u017c odniesienie zawiera poprawki konfiguracji
Error.DetachNotPossible.ConfigRevision=Od\u0142\u0105czenie modelu nie jest mo\u017cliwe, poniewa\u017c odniesienie zawiera poprawki konfiguracji

Error.Unset.NoEffectivity=To wyst\u0105pienie nie ma skuteczno\u015bci, wy\u0142\u0105czenie nic nie zmieni
Error.Unset.Domain.Forbidden=Domena wej\u015bciowa jest zabroniona
Error.Unset.Instance.Controlled.Change=Wyst\u0105pienie wej\u015bciowe jest kontrolowane przez zmiany
Error.Unset.NoEffectivity.ForDomain=To wyst\u0105pienie nie ma ustawionej skuteczno\u015bci dla tej domeny

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=Flaga nie istnieje w bazie danych.
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=Flaga istnieje w bazie danych.

Error.SetEffectivity.CriteriaNotEnabled=Kryterium nie jest w\u0142\u0105czone dla odniesienia nadrz\u0119dnego.
Error.SetEffectivity.IncorrectEffectivityXML=Wyra\u017cenie skuteczno\u015bci danych wej\u015bciowych lub dane wykorzystywane w wyra\u017ceniu nie s\u0105 prawid\u0142owe.
Error.SetEffectivity.InvalidInstancePhysicalID=Identyfikator wyst\u0105pienia w danych wej\u015bciowych nie jest prawid\u0142owy lub poprawny.
Error.SetEffectivity.LoadDictionaryFailed=Skuteczno\u015bci nie mo\u017cna okre\u015bli\u0107 ze wzgl\u0119du na dane s\u0142ownikowe. 
Error.SetEffectivity.3DPartNotConfigurable=Odniesienie g\u0142\u00f3wne jest typu 3DPart, kt\u00f3rego konfiguracja nie jest mo\u017cliwa. 
Error.SetEffectivity.XCADNotConfigurable=Odniesienie g\u0142\u00f3wne jest kontrolowane przez XCAD, kt\u00f3ry nie podlega konfiguracji.
Error.SetEffectivity.ModelNotAccessibleORExist=Model wskazany w wyra\u017ceniu danych wej\u015bciowych nie jest dost\u0119pny lub nie istnieje.
Error.SetEffectivity.NoModelFoundInExpression=Wyra\u017cenie danych wej\u015bciowych nie jest dobrze sformatowane (nie znaleziono modelu).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=Kryteria wykorzystane w wyra\u017ceniu danych wej\u015bciowych nie jest w\u0142\u0105czone dla odniesienia nadrz\u0119dnego.
Error.SetEffectivity.ErrorSaveEffectivities=B\u0142\u0105d przy zapisie nowych skuteczno\u015bci.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=Wyst\u0105pi\u0142 b\u0142\u0105d przy aktualizacji skuteczno\u015bci Poprawki konfiguracji.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=Wyst\u0105pienie stanowi cz\u0119\u015b\u0107 przynajmniej jednej zwolnionej ewolucji. Nowe wyra\u017cenie ewolucji nie mo\u017ce by\u0107 zastosowane.
Error.SetEffectivity.ReferenceNotConfigurable=Odniesienie nadrz\u0119dne nie mo\u017ce zosta\u0107 skonfigurowane.
Error.SetEffectivity.InstanceControlledByChange=Wyst\u0105pienie danych wej\u015bciowych jest kontrolowane przez zmian\u0119. Nie jest mo\u017cliwa edycja skuteczno\u015bci ewolucji.
Error.SetEffectivity.RootNotConfigured=Odniesienie nadrz\u0119dne tego wyst\u0105pienia nie ma kontekstu konfiguracji.
Error.SetEffectivity.ModelNotAttached=Model dostarczony w wyra\u017ceniu wej\u015bciowym nie stanowi cz\u0119\u015bci kontekstu konfiguracji.
Error.SetEffectivity.NotAllNecessaryModelsAttached=Nie wszystkie niezb\u0119dne modele s\u0105 do\u0142\u0105czone do nadrz\u0119dnego elementu referencyjnego.
Error.SetEffectivity.InstControlledByChange=Wyst\u0105pienie danych wej\u015bciowych jest kontrolowane przez zmian\u0119. Nie jest mo\u017cliwa edycja skuteczno\u015bci ewolucji.
Error.SetEffectivity.FailureDuringOperation=Wykryto niepowodzenie podczas operacji.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=Ustawienie wyra\u017cenia jest niemo\u017cliwe, poniewa\u017c spowodowa\u0142oby to dodanie lub usuni\u0119cie co najmniej jednego zamro\u017conego kryterium ewolucji do skuteczno\u015bci
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=Zmiana akcji stanowi ju\u017c cz\u0119\u015b\u0107 skuteczno\u015bci i jest okre\u015blona jako warto\u015b\u0107 negatywna.
Error.SetEffectivity.FailureDueToNoIntersection=Nie ma przeci\u0119cia mi\u0119dzy zakresem skuteczno\u015bci wyst\u0105pienia i zakresem kontekstu autoryzacji.
Error.IsEffsCoverEffRange.FailureDuringOperation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas kontroli, czy skuteczno\u015bci ewolucji obejmuj\u0105 okre\u015blony zakres skuteczno\u015bci ewolucji.

Error.AttachCfgContext.FailedDueToMultipleMVs=Nie jest obs\u0142ugiwane za\u0142\u0105czenie wielu wersji modelu do konfigurowalnego obiektu. Na ten moment wsparcie obejmuje wy\u0142\u0105cznie za\u0142\u0105czenie jednej wersji modelu.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=Nie mo\u017cna od\u0142\u0105czy\u0107 kontekstu konfiguracji, poniewa\u017c jest on u\u017cywany w wyra\u017ceniu skuteczno\u015bci

Error.AttributeVersionNotPresent=Obowi\u0105zkowa wersja atrybutu nie wyst\u0119puje w wej\u015bciowym pliku json.
Error.AttributeVersionIsInvalid=Warto\u015b\u0107 atrybutu version nie jest prawid\u0142owa w danych wej\u015bciowych. Warto\u015b\u0107 poprawna dla wersji to 1.0.
Error.AttributeResourcesNotPresent=Obowi\u0105zkowy atrybut resources nie wyst\u0119puje w wej\u015bciowym pliku json.
Error.AttributeResourcesIsEmpty=Atrybut resources ma warto\u015b\u0107 zerow\u0105 lub jest pusty w wej\u015bciowym plik json.
Error.AttributeIdentifierNotPresent=Obowi\u0105zkowy atrybut identifier nie wyst\u0119puje w pliku wej\u015bciowym json.
Error.AttributeIdentifierIsEmpty=Atrybut identifier nie powinien mie\u0107 warto\u015bci zerowej lub by\u0107 pusty w pliku wej\u015bciowym json.
Error.AttributeConfigFilterIdentifierNotPresent=Obowi\u0105zkowy atrybut configFilterIdentifier nie wyst\u0119puje w pliku wej\u015bciowym json.
Error.AttributeConfigFilterIdentifierIsEmpty=Atrybut configFilterIdentifier nie powinien mie\u0107 warto\u015bci zerowej ani by\u0107 pusty w pliku wej\u015bciowym json.
Error.AttributeViewIsNotValid=Warto\u015b\u0107 atrybutu view nie jest prawid\u0142owa w danych wej\u015bciowych. Prawid\u0142owe warto\u015bci dla view to Bie\u017c\u0105cy lub Rzutowany.
Error.AttributeModeIsNotValid=Warto\u015b\u0107 atrybutu mode nie jest prawid\u0142owa w danych wej\u015bciowych. Prawid\u0142owe warto\u015bci dla mode to Rygorystyczny lub 150%.
Error.PhysicalIdIsInvalid=Dane wej\u015bciowe zawieraj\u0105 nieprawid\u0142owe wyst\u0105pienie physical id.
Error.NotTypeOfVPMInstance=Dane wej\u015bciowe zawieraj\u0105 physical id, kt\u00f3re nie jest typem wyst\u0105pienia.
Error.ConfigurationFilterPIDIsInvalid=Dane wej\u015bciowe zawieraj\u0105 nieprawid\u0142owy filtr konfiguracji physical id.
Error.ConfigurationFilterTypeIsNotSupported=Dane wej\u015bciowe zawieraj\u0105 filtr konfiguracji nieobs\u0142ugiwanego typu.
Error.InstanceDoesNotHaveStaticMapping=Nie jest mo\u017cliwe uaktualnienie mapowania statyczne dla wyst\u0105pienia, poniewa\u017c wyst\u0105pienie nie zawiera mapowania statycznego.

Error.AttributeModelPIDNotPresent=Obowi\u0105zkowy atrybut modelPID nie wyst\u0119puje w wej\u015bciowym pliku json.
Error.AttributeModelPIDIsEmpty=Atrybut modelPID ma warto\u015b\u0107 zerow\u0105 lub jest pusty w pliku wej\u015bciowym json.
Error.AttributeViewIsInvalid=Warto\u015b\u0107 atrybutu view jest nieprawid\u0142owa. Prawid\u0142owe warto\u015bci dla tego atrybutu to Bie\u017c\u0105cy, Rzutowany lub Wszystkie.
Error.AttributeFormatIsInvalid=Warto\u015b\u0107 atrybutu format jest nieprawid\u0142owa. Prawid\u0142owe warto\u015bci dla tego atrybutu to TXT lub XML.
Error.AttributeOccurrencesNotPresent=Obowi\u0105zkowy atrybut occurrences nie wyst\u0119puje w pliku wej\u015bciowym json.
Error.AttributeOccurrencesIsEmpty=Atrybut occurrences ma warto\u015b\u0107 zerow\u0105 lub jest pusty w pliku wej\u015bciowym json.

Error.FlagDoesNotExistInDatabase=Flaga nie istnieje w bazie danych.
Error.FlagFoundInDatabase=Flaga istnieje w bazie danych.

Error.xRevision.AttachScopeFailed=Wyst\u0105pi\u0142 b\u0142\u0105d podczas za\u0142\u0105czania zakresu do tego odniesienia.
Error.xRevision.DetachScopeFailed=Wyst\u0105pi\u0142 b\u0142\u0105d podczas wy\u0142\u0105czania zakresu z tego odniesienia.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=Nie jest mo\u017cliwe do\u0142\u0105czenie zakres\u00f3w dla tego odniesienia, poniewa\u017c wykres xRevision nie jest do niego do\u0142\u0105czony.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=Nie jest mo\u017cliwe wy\u0142\u0105czenie zakres\u00f3w dla tego odniesienia, poniewa\u017c wykres xRevision nie jest do\u0142\u0105czony do niego.
Error.xRevision.EnableVariantCriteriaFailed=Nie jest mo\u017cliwe ustawienie wariant\u00f3w kryteri\u00f3w dla tego odniesienia, poniewa\u017c zakresu nie s\u0105 do niego do\u0142\u0105czone.

Error.xRevision.ReferenceNotConfigurable=Odniesienie to nie jest konfigurowalne.

Error.AttributeVersionIsNotPresent=Wersja atrybutu nie wyst\u0119puje w danych wej\u015bciowych.
Error.AttributeVersionIsNotCorrect=Warto\u015b\u0107 atrybutu version jest nieprawid\u0142owa. Prawid\u0142owa warto\u015b\u0107 dla niego to 1.0.
Error.AttributeEvolutionIdentifiersIsNotPresent=Atrybut evolutionsIdentifiers nie wyst\u0119puje w danych wej\u015bciowych.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=Atrybut evolutionsIdentifiers ma warto\u015b\u0107 zerow\u0105 lub jest pusty w danych wej\u015bciowych.
Error.EvolutionPhysicalIsNullOREmpty=Przynajmniej jeden physicalid ewolucji jest pusty lub ma warto\u015b\u0107 zerow\u0105 w danych wej\u015bciowych.
Error.AttributeDetaislRequiredIsNotPresent=Atrybut detailsRequired nie wyst\u0119puje w danych wej\u015bciowych.
Error.AttributeDetaislRequiredIsNotCorrect=Warto\u015b\u0107 atrybutu detailsRequired jest nieprawid\u0142owa. Prawid\u0142owa warto\u015b\u0107 to Yes lub No.
Error.MixEvolutionsNotAllowed=Dane wej\u015bciowe zawieraj\u0105 wymieszane typy ewolucji, co nie jest obs\u0142ugiwane. Nale\u017cy wprowadzi\u0107 jeden typ physicalid ewolucji.
Error.EvolutionsPIDNotValid=Physicalid ewolucji jest nieprawid\u0142owy.

Error.AttributeWorkUnderCompiledForm=Atrybut workUnderCompiledForm ma warto\u015b\u0107 zerow\u0105 lub jest pusty w danych wej\u015bciowych.
Error.AttributeInstancePIDNotPresent=Atrybut instancePID nie wyst\u0119puje w danych wej\u015bciowych.
Error.AttributeInstancePIDNotValid=Atrybut instancePID ma warto\u015b\u0107 zerow\u0105 lub jest pusty w danych wej\u015bciowych.
Error.AttributeEffectivityCompiledFormNotPresent=Atrybut effectivityCompiledForm nie wyst\u0119puje w danych wej\u015bciowych.
Error.AttributeEffectivityCompiledFormIsInvalid=Atrybut effectivityCompiledForm ma warto\u015b\u0107 zerow\u0105 w danych wej\u015bciowych.
Error.AtleastOneModelPIDIsNullOREmpty=Przynajmniej jeden physicalid modelu w danych wej\u015bciowych ma warto\u015b\u0107 zerow\u0105 lub jest pusty.
Error.RefORInstOrCAOrACShouldBePresent=Przynajmniej jeden jest wymagany w danych wej\u015bciowych, w wyst\u0105pieniach, zmianie akcji lub kontek\u015bcie autoryzowania.
Error.AttributeVersionReferencePIDNotPresent=Atrybut referencePID nie wyst\u0119puje w danych wej\u015bciowych.
Error.AttributeVersionReferencePIDNotInvalid=Atrybut referencePID ma warto\u015b\u0107 zerow\u0105 lub dane wej\u015bciowe s\u0105 puste.
Error.xRevision.CannotCreateXRevGraphModelAttached=Nie jest mo\u017cliwe utworzenie wykresu XRevision dla tego odniesienia, poniewa\u017c jest ju\u017c ju\u017c do niego za\u0142\u0105czony Model.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=Nie jest mo\u017cliwe utworzenie wykresu XRevision dla tego odniesienia, poniewa\u017c nie ma wykresu xRevision ju\u017c do\u0142\u0105czonego do odniesienia \u017ar\u00f3d\u0142owego.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=Nie jest mo\u017cliwe utworzenie wykresu XRevision dla tego odniesienia, poniewa\u017c jest ju\u017c za\u0142\u0105czony model w odniesieniu \u017ar\u00f3d\u0142owym.

Error.xRevision.xRevGraphAlreadyHasScope=Wykres xRevision dla tego odniesienia dysponuje ju\u017c zakresem.
Error.xRevision.xRevGraphHasNoScopeToDelete=Wykres xRevision dla tego odniesienia nie ma zakresu do usuni\u0119cia.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=Wykres xRevision dla tego odniesienia ma pewne przypisania, wi\u0119c nie mo\u017ce usun\u0105\u0107 zakresu.

Error.InvalidInstancePID=Wyst\u0105pienie physicalid jest nieprawid\u0142owe.

Error.FailedToDisableCriteria=Nie powiod\u0142o si\u0119 wy\u0142\u0105czenie kryteri\u00f3w dla skonfigurowanych obiekt\u00f3w, poniewa\u017c jedno lub wi\u0119cej wyst\u0105pie\u0144 mo\u017ce mie\u0107 <CriteriaName> wykorzystane w skuteczno\u015bci.
Criteria.Date=Data
Criteria.ManufacturingPlans=Plan produkcji
Criteria.Unit=Jednostka
Criteria.FeatureOption=Warianty i opcje
Criteria.ModelVersion=Wersja modelu

Warning.InstanceNotFilterable=Wyst\u0105pienie nie obs\u0142uguje wyra\u017cania skuteczno\u015bci.
Warning.NotPossibleExtendOnThisInstance=Nie mo\u017cna wykona\u0107 operacji rozszerzania w przypadku wyst\u0105pie\u0144, kt\u00f3re s\u0105 ju\u017c dost\u0119pne dla wszystkich ewolucji.
Error.ExtendFailedOnThisInstance=Nie mo\u017cna wykona\u0107 operacji rozszerzania w tym wyst\u0105pieniu.
Error.InvalidPhysicalPID=Fizyczny identyfikator nie jest prawid\u0142owy.

Cfg.Error.ErrorMissingParameterInWebService=Brakuj\u0105cy parametr <key>. Przy sk\u0142adaniu \u017c\u0105dania nale\u017cy do\u0142\u0105czy\u0107 wszelkie niezb\u0119dne parametry.
Cfg.Error.ErrorIncorrectParameterValueInWebService=Nieprawid\u0142owa warto\u015b\u0107 parametru dla <key>. Przy sk\u0142adaniu \u017c\u0105dania nale\u017cy do\u0142\u0105czy\u0107 prawid\u0142ow\u0105 warto\u015b\u0107 parametru.
Cfg.Error.ErrorIncorrectArraySizeInWebService=Nieprawid\u0142owy rozmiar dla matrycy <key>. Przy sk\u0142adaniu \u017c\u0105dania nale\u017cy upewni\u0107 si\u0119, \u017ce matryca ma poprawny rozmiar.
Cfg.Error.ErrorExactlyOneParameterRequired=Nieprawid\u0142owa kombinacja parametr\u00f3w <key>. Przy sk\u0142adaniu \u017c\u0105dania nale\u017cy upewni\u0107 si\u0119, \u017ce dok\u0142adnie jeden z wymaganych parametr\u00f3w jest zapewniony.
Cfg.Error.ErrorInvalidPayloadInWebService=\u017b\u0105dany \u0142adunek jest niezgodny z oczekiwanym schematem lub formatem. Sprawd\u017a struktur\u0119, typy danych i wymagane pola.

Error.xRevision.NotPossibleToAttachScopes=Nie mo\u017cna do\u0142\u0105czy\u0107 zakresu dla co najmniej jednego odniesienia we wprowadzonych danych, poniewa\u017c wykres xRevision nie jest do niego do\u0142\u0105czony.

Error.ConfigFilterNotFoundOnReference=Nie mo\u017cna utworzy\u0107 mapowania statycznego w wyst\u0105pienia, poniewa\u017c nie znaleziono filtra konfiguracji danych wej\u015bciowych w obiekcie odniesienia.
Error.InstanceAlreadyHasStaticMapping=Nie mo\u017cna utworzy\u0107 mapowania statycznego w wyst\u0105pienia, poniewa\u017c wyst\u0105pienie zawiera ju\u017c mapowanie statyczne.

Error.NotAccessibleObject=Ta zawarto\u015b\u0107 nie jest ju\u017c dost\u0119pna lub zosta\u0142a usuni\u0119ta.
Error.DoesNotExistObject=Zaznaczony obiekt nie istnieje.

Error.ConfigFilterIsTooMature=Nie mo\u017cna utworzy\u0107 mapowania statycznego w wyst\u0105pienia, poniewa\u017c filtr konfiguracji danych wej\u015bciowych ma stan przestarza\u0142y.

Error.ModelVersionAlreadyAttach=Wersja modelu zosta\u0142a ju\u017c za\u0142\u0105czona, przez co za\u0142\u0105czenie tego modelu nie jest mo\u017cliwe

Error.xRevision.RefDoesNotHaveXRevGraph=Do odniesienia w danych wej\u015bciowych, kt\u00f3re zosta\u0142o za\u0142\u0105czone jako zakres, nie za\u0142\u0105czono wykresu xRevision.
Error.xRevision.ErrorNoXGraphFoundForReference=Do odniesienia podanego w danych wej\u015bciowych nie do\u0142\u0105czono wykresu xRevision.
