#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= Versione dell'attributo non presente nell'input.
Error.xRevision.AttributeVersionIsInvalid= Il valore della versione dell'attributo non \u00e8 valido. Il valore valido \u00e8 1.0.

Error.xRevision.AttributeVersionReferencePIDNotPresent= Attributo referencePID non presente nell'input.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= Attributo referencePID null o vuoto nell'input.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= Non \u00e8 possibile creare un grafico xRevision in questo riferimento poich\u00e9 \u00e8 gi\u00e0 associato al riferimento.
Error.xRevision.CannotCreateXRevGraphModelAttached= Non \u00e8 possibile creare un grafico xRevision in questo riferimento poich\u00e9 il riferimento ha gi\u00e0 un modello associato.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= Attributo xRevisionElementPID non presente nell'input.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= Attributo xRevisionElementPID null o vuoto nell'input.
Error.xRevision.AttributeXRevElementPIDNotValid= L'elemento xRevision physicalid non \u00e8 valido nell'input.

Error.xRevision.AttributeAllocationsIsNotPresent= Attributo allocations non presente nell'input.
Error.xRevision.AttributeAllocationsIsNullOREmpty= Attributo allocations null o vuoto nell'input.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= Attributo allocationPIDs non presente nell'input.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= Attributo allocationPIDs null o vuoto nell'input.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Almeno uno degli ID fisici di assegnazione nell'input \u00e8 null o vuoto.
Error.xRevision.MultiAllocationIsNotSupported= Le assegnazioni multiple per ogni elemento xRevision non sono ancora supportate.
Error.xRevision.AllocationPIDIsNotValid= L'assegnazione specificata nell'input non \u00e8 valida o non fa parte di un grafico xRevision.
Error.xRevision.xRevElementAlreadyHasAllocation= L'elemento xRevision ha gi\u00e0 assegnazioni.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= Attributo xRevisionElementPIDs non presente nell'input.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= Attributo xRevisionElementPIDs null o vuoto nell'input.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Almeno uno degli ID fisici dell'elemento xRevision nell'input \u00e8 null o vuoto.
Error.xRevision.XRevisionElementPIDNotValid= Questo ID fisico dell'elemento xRevision non \u00e8 valido.

Error.xRevision.AttributeDeallocationsIsNotPresent= Attributo deallocations non presente nell'input.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= Attributo deallocations null o vuoto nell'input.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= Attributo deallocationPIDs non presente nell'input.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= Attributo deallocationPIDs null o vuoto nell'input.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Almeno uno degli ID fisici di assegnazione annullata nell'input \u00e8 null o vuoto.
Error.xRevision.MultiDeallocationIsNotSupported= Le assegnazioni annullate multiple per ogni elemento xRevision non sono ancora supportate.
Error.xRevision.DeallocationPIDIsNotValid= L'assegnazione annullata specificata nell'input non \u00e8 valida o non fa parte di un grafico xRevision.
Error.xRevision.xRevElementDoesNotHaveAllocation= Questo elemento xRevision non ha assegnazioni.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= Attributo xRevisionGraphsToAttach non presente nell'input.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= Attributo xRevisionGraphsToAttach vuoto nell'input.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= Attributo reusableGraphReferencePID non presente nell'input.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= Attributo reusableGraphReferencePID null o vuoto nell'input.
Error.xRevision.AttachExistingXRevGraphFailed= L'associazione del grafico xRevision esistente da un riferimento a un altro non \u00e8 riuscita per uno dei riferimenti nell'input.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= Non \u00e8 possibile associare un grafico xRevision a uno dei riferimenti, poich\u00e9 il riferimento ha gi\u00e0 un grafico xRevision.
Error.xRevision.AllocationCrossesExistingOne= Questa assegnazione ne incrocia una gi\u00e0 esistente. Provare ad assegnare una versione del modello superiore a questa.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= Impossibile eseguire l'assegnazione automatica durante l'operazione di impostazione dell'ambito.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= Nessuna variante trovata per il contesto di configurazione durante l'operazione di impostazione dell'ambito.


Error.xRevision.ParentNotInFrozen= Il padre dell'elemento xRevision corrente ha lo stato Preliminare o In corso; innalzamento di livello non consentito.
Error.xRevision.AllocatedMVNotReleased= La versione del modello assegnata all'elemento xRevision corrente non \u00e8 rilasciata; innalzamento di livello non consentito.
Error.xRevision.FoundIncompleteChange= Sono presenti azioni di modifica incomplete che utilizzano questo elemento xRevision; innalzamento di livello non consentito.
Error.xRevision.ChildFrozen= Il figlio dell'elemento xRevision corrente ha Congelato come stato minimo; abbassamento di livello non consentito.

Error.xRevision.xRevisionDeleteAction= Non \u00e8 possibile eliminare uno degli elementi del grafico xRevision o impostare un riferimento primario.
Error.xRevision.PrimaryReferenceDelete= Non \u00e8 consentito eliminare il riferimento primario del grafico.
Error.xRevision.PrimaryReferenceDeleteMulti= Non \u00e8 consentito eliminare un riferimento primario che ha un grafico con pi\u00f9 elementi xRevision.
Error.xRevision.DeleteCollabSpace= L'elemento xRevision non \u00e8 In corso e non si trova nella stessa area di collaborazione dell'utente; l'eliminazione non \u00e8 consentita.
Error.xRevision.FrozenxRev= L'elemento xRevision \u00e8 in uno stato troppo avanzato per consentire l'eliminazione.
Error.xRevision.DeleteOneSingleElement= Pi\u00f9 riferimenti utilizzano questo grafico con un singolo elemento; l'eliminazione non \u00e8 consentita.
Error.xRevision.DeleteFirstElement= Pi\u00f9 riferimenti utilizzano questo grafico; l'eliminazione del primo elemento non \u00e8 consentita.
Error.xRevision.DeleteOneElement= Uno degli elementi xRevision \u00e8 in uso e non pu\u00f2 essere eliminato.
Error.xRevision.ReferenceDeleteChildScope= Non \u00e8 consentito eliminare un riferimento che ha grafici figlio.
Error.xRevision.GraphDeleteChildScope= Non \u00e8 consentito eliminare un grafico che ha grafici figlio.
Error.xRevision.CreateGraphPhyRevs= Impossibile creare un grafico per l'elemento corrente perch\u00e9 ha gi\u00e0 revisioni fisiche.
Error.xRevision.CreateGraphNoExistCfg= Impossibile creare un grafico per l'elemento corrente perch\u00e9 non esiste o non \u00e8 configurabile.
Error.xRevision.ReuseGraphDelSource= Impossibile riutilizzare un grafico esistente per l'elemento corrente perch\u00e9 l'elemento di origine non esiste.
Error.xRevision.ReuseGraphSourceNoAccess= Impossibile riutilizzare un grafico esistente per l'elemento corrente perch\u00e9 l'utente connesso non ha accesso all'elemento di origine.
Error.xRevision.ReuseGraphSourceNoCfg= Impossibile riutilizzare un grafico esistente per l'elemento corrente perch\u00e9 l'elemento di origine non \u00e8 configurabile.
Error.xRevision.ReuseGraphSourceNoGraph= Impossibile riutilizzare un grafico esistente per l'elemento corrente perch\u00e9 l'elemento di origine non ha un grafico.
