#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=Il flag non esiste nel database
Effectivity.Alert.FlagDisabledInDB=Il flag esiste nel database ed \u00e8 disabilitato.
Effectivity.Alert.FlagEnabledInDB=Il flag esiste nel database ed \u00e8 abilitato.
Effectivity.Alert.FilterableERTypesNotExistInDB=Tipi ER filtrabili non esistenti nel database.
Effectivity.Alert.FilterableERTypesFoundInDB=Tipi ER filtrabili trovati nel database.

Error.AlreadyAttached=ATTENZIONE: Il modello con ID - "<ModelID>" \u00e8 gi\u00e0 allegato al riferimento...!
Error.AlreadyDetached=ATTENZIONE: Il modello con ID - "<ModelID>" \u00e8 gi\u00e0 stato dissociato...!
Error.AlreadyAttachedMV=ATTENZIONE: La versione del modello con ID - '<ModelVersionID>' \u00e8 gi\u00e0 allegata al riferimento...!
Error.AlreadyDetachedMV=ATTENZIONE: La versione del modello con ID - '<ModelVersionID>' \u00e8 gi\u00e0 stata dissociata...!

Error.TypeNotAModel=non \u00e8 un tipo di modello
Error.InternalServerError=errore interno
Error.ObjectNotFound=non trovato
Error.XCADConfigurationNotPossible=impossibile configurare strutture prodotto.

Error.DetachNotPossible.ConfigurationUsage=Impossibile disassociare il modello in quanto \u00e8 utilizzato da una configurazione
Error.DetachNotPossible.EffectivityUsage=Impossibile disassociare il modello in quanto \u00e8 utilizzato da una espressione di validit\u00e0
Error.DetachNotPossible.ConfigurationRevision=Impossibile scollegare il modello perch\u00e9 il riferimento ha revisioni di configurazione
Error.DetachNotPossible.ConfigRevision=Impossibile scollegare il modello perch\u00e9 il riferimento ha revisioni di configurazione

Error.Unset.NoEffectivity=Questa istanza manca del valore di validit\u00e0, annulla impostazione \u00e8 inutile
Error.Unset.Domain.Forbidden=Il dominio di input non \u00e8 consentito
Error.Unset.Instance.Controlled.Change=L'istanza di input \u00e8 controllata da una modifica
Error.Unset.NoEffectivity.ForDomain=Questa istanza manca del valore di validit\u00e0 per questo dominio

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=Il flag non esiste nel database
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=Il flag esiste nel database.

Error.SetEffectivity.CriteriaNotEnabled=I criteri non sono abilitati nel riferimento padre.
Error.SetEffectivity.IncorrectEffectivityXML=L'espressione di validit\u00e0 di input o i dati utilizzati nell'espressione non sono corretti.
Error.SetEffectivity.InvalidInstancePhysicalID=L'identificativo dell'istanza nell'input non \u00e8 valido o non \u00e8 corretto.
Error.SetEffectivity.LoadDictionaryFailed=Impossibile impostare la validit\u00e0 a causa dei dati del dizionario. 
Error.SetEffectivity.3DPartNotConfigurable=Il riferimento radice \u00e8 una 3DPart non configurabile. 
Error.SetEffectivity.XCADNotConfigurable=Il riferimento radice \u00e8 un XCAD controllato non configurabile.
Error.SetEffectivity.ModelNotAccessibleORExist=Il modello specificato nell'espressione di input non \u00e8 accessibile o non esiste.
Error.SetEffectivity.NoModelFoundInExpression=Formato dell'espressione di input non valido (nessun modello trovato).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=I criteri utilizzati nell'espressione di input non sono abilitati nel riferimento padre.
Error.SetEffectivity.ErrorSaveEffectivities=Si \u00e8 verificato un errore durante il salvataggio delle nuove validit\u00e0.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=Si \u00e8 verificato un errore durante l'aggiornamento delle validit\u00e0 della revisione della configurazione.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=L'istanza fa parte di almeno un'evoluzione rilasciata. Impossibile applicare l'espressione della nuova evoluzione.
Error.SetEffectivity.ReferenceNotConfigurable=Il riferimento padre non \u00e8 configurabile.
Error.SetEffectivity.InstanceControlledByChange=L'istanza di input \u00e8 controllata da una modifica.
Error.SetEffectivity.RootNotConfigured=Il riferimento padre di una data istanza non ha un contesto di configurazione.
Error.SetEffectivity.ModelNotAttached=Il modello specificato nell'espressione di input non fa parte del contesto di configurazione.
Error.SetEffectivity.NotAllNecessaryModelsAttached=Non tutti i modelli necessari sono associati nel riferimento padre.
Error.SetEffectivity.InstControlledByChange=L'istanza di input \u00e8 controllata da una modifica.
Error.SetEffectivity.FailureDuringOperation=Errore rilevato durante l'operazione.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=Impossibile impostare l'espressione perch\u00e9 verrebbe aggiunto o rimosso almeno un criterio di evoluzione congelato per la validit\u00e0.
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=L'azione di modifica \u00e8 gi\u00e0 valida e definita come negativa.
Error.SetEffectivity.FailureDueToNoIntersection=Non esiste alcuna intersezione tra l'intervallo di validit\u00e0 dell'istanza e l'intervallo del contesto di creazione.
Error.IsEffsCoverEffRange.FailureDuringOperation=Se le validit\u00e0 di evoluzione coprono un determinato intervallo di validit\u00e0 di evoluzione, si verifica un errore durante la verifica.

Error.AttachCfgContext.FailedDueToMultipleMVs=Non \u00e8 supportata l'associazione di pi\u00f9 versioni modello a un oggetto configurabile. Al momento, \u00e8 supportata l'associazione di una sola versione modello.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=Impossibile disassociare il modello di configurazione in quanto \u00e8 utilizzato da un'espressione di validit\u00e0.

Error.AttributeVersionNotPresent=La versione dell'attributo obbligatorio non \u00e8 presente nel JSON di input.
Error.AttributeVersionIsInvalid=Il valore della versione dell'attributo non \u00e8 corretto nell'input. Il valore valido per la versione \u00e8 1.0.
Error.AttributeResourcesNotPresent=Le risorse dell'attributo obbligatorio non sono presenti nel JSON di input.
Error.AttributeResourcesIsEmpty=Le risorse dell'attributo sono null o vuote nel JSON di input.
Error.AttributeIdentifierNotPresent=L'identificatore dell'attributo obbligatorio non \u00e8 presente nel JSON di input.
Error.AttributeIdentifierIsEmpty=L'identificatore dell'attributo non deve essere null o vuoto nel JSON di input.
Error.AttributeConfigFilterIdentifierNotPresent=L'attributo obbligatorio configFilterIdentifier non \u00e8 presente nel JSON di input.
Error.AttributeConfigFilterIdentifierIsEmpty=Attributo configFilterIdentifier non deve essere null o vuoto nel JSON di input.
Error.AttributeViewIsNotValid=Il valore della vista dell'attributo non \u00e8 valido nell'input. I valori validi per la vista sono Current o Projected.
Error.AttributeModeIsNotValid=Il valore della modalit\u00e0 dell'attributo non \u00e8 valido nell'input. I valori validi per la modalit\u00e0 sono Strict o 150%.
Error.PhysicalIdIsInvalid=L'input contiene un ID fisico dell'istanza non valido.
Error.NotTypeOfVPMInstance=L'input contiene un ID fisico che non \u00e8 un tipo di istanza.
Error.ConfigurationFilterPIDIsInvalid=L'input contiene un ID fisico del filtro di configurazione non valido.
Error.ConfigurationFilterTypeIsNotSupported=L'input contiene un tipo di filtro configurazione non supportato.
Error.InstanceDoesNotHaveStaticMapping=Impossibile aggiornare la mappatura statica dell'istanza perch\u00e9 l'istanza non ha una mappatura statica.

Error.AttributeModelPIDNotPresent=L'attributo obbligatorio modelPID non \u00e8 presente nel JSON di input.
Error.AttributeModelPIDIsEmpty=Attributo modelPID null o vuoto nel JSON di input.
Error.AttributeViewIsInvalid=Il valore della vista dell'attributo non \u00e8 valido. I valori validi per questo attributo sono Current, Projected o All.
Error.AttributeFormatIsInvalid=Il valore del formato dell'attributo non \u00e8 valido. I valori validi per questo attributo sono TXT o XML.
Error.AttributeOccurrencesNotPresent=Le occorrenze dell'attributo obbligatorio non sono presenti nel JSON di input.
Error.AttributeOccurrencesIsEmpty=Le occorrenze dell'attributo sono null o vuote nel JSON di input.

Error.FlagDoesNotExistInDatabase=Il flag non esiste nel database
Error.FlagFoundInDatabase=Il flag esiste nel database.

Error.xRevision.AttachScopeFailed=Si \u00e8 verificato un errore durante il collegamento dell'ambito a questo riferimento.
Error.xRevision.DetachScopeFailed=Si \u00e8 verificato un errore durante lo scollegamento dell'ambito da questo riferimento.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=Non \u00e8 possibile collegare gli ambiti a questo riferimento, poich\u00e9 il grafico xRevision non \u00e8 associato a esso.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=Non \u00e8 possibile scollegare gli ambiti a questo riferimento, poich\u00e9 il grafico xRevision non \u00e8 associato a esso.
Error.xRevision.EnableVariantCriteriaFailed=Non \u00e8 possibile impostare criteri di variante per questo riferimento, poich\u00e9 gli ambiti non sono associati a esso.

Error.xRevision.ReferenceNotConfigurable=Questo riferimento non \u00e8 configurabile.

Error.AttributeVersionIsNotPresent=Versione dell'attributo non presente nell'input.
Error.AttributeVersionIsNotCorrect=Il valore della versione dell'attributo non \u00e8 valido. Il valore valido \u00e8 1.0.
Error.AttributeEvolutionIdentifiersIsNotPresent=Attributo evolutionsIdentifiers non presente nell'input.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=Attributo evolutionsIdentifiers vuoto o null nell'input.
Error.EvolutionPhysicalIsNullOREmpty=Almeno uno degli ID fisici di evoluzione \u00e8 vuoto o null nell'input.
Error.AttributeDetaislRequiredIsNotPresent=Attributo detailsRequired non presente nell'input.
Error.AttributeDetaislRequiredIsNotCorrect=Il valore dell'attributo detailsRequired non \u00e8 valido. Valore valido \u00e8 S\u00ec o No.
Error.MixEvolutionsNotAllowed=L'input contiene vari tipi di evoluzione non supportati. Fornire un tipo di ID fisico di evoluzione.
Error.EvolutionsPIDNotValid=Questo ID fisico di evoluzione non \u00e8 valido.

Error.AttributeWorkUnderCompiledForm=Attributo workUnderCompiledForm null o vuoto nell'input.
Error.AttributeInstancePIDNotPresent=Attributo instancePID non presente nell'input.
Error.AttributeInstancePIDNotValid=Attributo instancePID null o vuoto nell'input.
Error.AttributeEffectivityCompiledFormNotPresent=Attributo effectivityCompiledForm non presente nell'input.
Error.AttributeEffectivityCompiledFormIsInvalid=Attributo effectivityCompiledForm null nell'input.
Error.AtleastOneModelPIDIsNullOREmpty=Almeno un ID fisico del modello nell'input \u00e8 null o vuoto.
Error.RefORInstOrCAOrACShouldBePresent=Nell'input \u00e8 richiesto uno tra: Istanze, Azione di modifica o Contesto di creazione.
Error.AttributeVersionReferencePIDNotPresent=Attributo referencePID non presente nell'input.
Error.AttributeVersionReferencePIDNotInvalid=Attributo referencePID null o vuoto nell'input.
Error.xRevision.CannotCreateXRevGraphModelAttached=Non \u00e8 possibile creare un grafico xRevision su questo riferimento, poich\u00e9 ha gi\u00e0 un modello associato.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=Non \u00e8 possibile creare un grafico xRevision su questo riferimento, poich\u00e9 non esiste alcun grafico xRevision collegato al riferimento di origine.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=Non \u00e8 possibile creare un grafico xRevision su questo riferimento, poich\u00e9 il riferimento di origine ha gi\u00e0 un modello associato.

Error.xRevision.xRevGraphAlreadyHasScope=Il grafico xRevision di questo riferimento ha gi\u00e0 l'ambito.
Error.xRevision.xRevGraphHasNoScopeToDelete=Il grafico xRevision di questo riferimento non ha un ambito da eliminare.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=Il grafico xRevision di questo riferimento ha delle allocazioni, pertanto l'ambito non pu\u00f2 essere eliminato.

Error.InvalidInstancePID=L'ID fisico dell'istanza non \u00e8 valido.

Error.FailedToDisableCriteria=Impossibile disattivare i criteri sugli oggetti configurati in quanto una o pi\u00f9 istanze potrebbero utilizzare <CriteriaName> nella validit\u00e0.
Criteria.Date=Data
Criteria.ManufacturingPlans=Piano di produzione
Criteria.Unit=Unit\u00e0
Criteria.FeatureOption=Varianti e opzioni
Criteria.ModelVersion=Versione modello

Warning.InstanceNotFilterable=L'istanza non supporta l'espressione di validit\u00e0.
Warning.NotPossibleExtendOnThisInstance=L'operazione di estensione non \u00e8 possibile in un'istanza gi\u00e0 disponibile per tutte le evoluzioni.
Error.ExtendFailedOnThisInstance=L'operazione di estensione non \u00e8 possibile in questa istanza.
Error.InvalidPhysicalPID=Questa versione dell'ID fisico non \u00e8 valida.

Cfg.Error.ErrorMissingParameterInWebService=Parametro <key> mancante. Includere tutti i parametri necessari quando si effettua la richiesta.
Cfg.Error.ErrorIncorrectParameterValueInWebService=Valore del parametro errato per <key>. Includere un valore di parametro valido quando si effettua la richiesta.
Cfg.Error.ErrorIncorrectArraySizeInWebService=Dimensioni errate per l'array <key>. Assicurarsi che l'array abbia le dimensioni corrette quando si effettua la richiesta.
Cfg.Error.ErrorExactlyOneParameterRequired=Combinazione di parametri non valida per <key>. Assicurarsi che venga fornito esattamente uno dei parametri richiesti al momento della richiesta.
Cfg.Error.ErrorInvalidPayloadInWebService=Il payload richiesta non \u00e8 conforme allo schema o al formato previsto. Verificare la struttura, i tipi di dati e i campi obbligatori.

Error.xRevision.NotPossibleToAttachScopes=Non \u00e8 possibile collegare l'ambito per almeno uno dei riferimenti in input, perch\u00e9 xRevision Graph non \u00e8 collegato a esso.

Error.ConfigFilterNotFoundOnReference=Non \u00e8 possibile creare una mappatura statica su un'istanza, perch\u00e9 il filtro di configurazione dell'input non si trova su un oggetto di riferimento.
Error.InstanceAlreadyHasStaticMapping=Non \u00e8 possibile creare una mappatura statica su un'istanza, perch\u00e9 questa istanza ha gi\u00e0 una mappatura statica.

Error.NotAccessibleObject=Questo contenuto non \u00e8 pi\u00f9 accessibile o potrebbe essere stato eliminato.
Error.DoesNotExistObject=L'oggetto selezionato non esiste.

Error.ConfigFilterIsTooMature=Non \u00e8 possibile creare una mappatura statica su un'istanza, perch\u00e9 il filtro di configurazione dell'input \u00e8 obsoleto.

Error.ModelVersionAlreadyAttach=Non \u00e8 possibile allegare questo modello quando \u00e8 gi\u00e0 presente una versione del modello.

Error.xRevision.RefDoesNotHaveXRevGraph=Il riferimento in input che si usa per l'allegato come ambito non \u00e8 collegato al grafico xRevision.
Error.xRevision.ErrorNoXGraphFoundForReference=Il riferimento fornito nell'input non ha un xRevision Graph collegato.
