#
#   ConfigXRevisionServicesStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Error.xRevision.AttributeVersionIsNotPresent= El atributo version no est\u00e1 presente en la entrada.
Error.xRevision.AttributeVersionIsInvalid= El atributo version value no es v\u00e1lido. El valor v\u00e1lido es 1.0.

Error.xRevision.AttributeVersionReferencePIDNotPresent= El atributo referencePID no est\u00e1 presente en la entrada.
Error.xRevision.AttributeVersionReferencePIDNotInvalid= El atributo referencePID es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.CannotCreateXRevGraphItIsAlreadyExist= No es posible crear un gr\u00e1fico XRevision en esta referencia porque ya est\u00e1 adjunto.
Error.xRevision.CannotCreateXRevGraphModelAttached= No es posible crear un gr\u00e1fico XRevision en esta referencia porque ya hay un modelo adjunto.

Error.xRevision.AttributeXRevElementPIDIsNotPresent= El atributo xRevisionElementPID no est\u00e1 presente en la entrada.
Error.xRevision.AttributeXRevElementPIDNullOREmpty= El atributo xRevisionElementPID es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AttributeXRevElementPIDNotValid= El physicalid del elemento xRevision no es v\u00e1lido en la entrada.

Error.xRevision.AttributeAllocationsIsNotPresent= El atributo allocations no est\u00e1 presente en la entrada.
Error.xRevision.AttributeAllocationsIsNullOREmpty= El atributo allocations es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AttributeAllocationPIDsIsNotPresent= El atributo allocationPIDs no est\u00e1 presente en la entrada.
Error.xRevision.AttributeAllocationPIDsIsNullOREmpty= El atributo allocationPIDs es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AtleastOneAllocationPIDIsNullOREmpty= Al menos un physicalid de asignaci\u00f3n en la entrada es nulo o est\u00e1 vac\u00edo.
Error.xRevision.MultiAllocationIsNotSupported= Varias asignaciones de cada elemento xRevision a\u00fan no son compatibles.
Error.xRevision.AllocationPIDIsNotValid= La asignaci\u00f3n proporcionada en la entrada no es v\u00e1lida o no forma parte de un gr\u00e1fico xRevision.
Error.xRevision.xRevElementAlreadyHasAllocation= El elemento xRevision ya tiene asignaciones.

Error.xRevision.AttributeXRevElementPIDSIsNotPresent= El atributo xRevisionElementPIDs no est\u00e1 presente en la entrada.
Error.xRevision.AttributeXRevElementPIDSNullOREmpty= El atributo xRevisionElementPIDs es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AtleastOneXRevElementPIDIsNullOREmpty= Al menos uno de los physicalid del elemento xRevision en la entrada es nulo o est\u00e1 vac\u00edo.
Error.xRevision.XRevisionElementPIDNotValid= Este physicalid del elemento xRevision no es v\u00e1lido.

Error.xRevision.AttributeDeallocationsIsNotPresent= El atributo deallocations no est\u00e1 presente en la entrada.
Error.xRevision.AttributeDeallocationsIsNullOREmpty= El atributo deallocations es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AttributeDeallocationPIDsIsNotPresent= El atributo deallocationPIDs no est\u00e1 presente en la entrada.
Error.xRevision.AttributeDeallocationPIDsIsNullOREmpty= El atributo deallocationPIDs es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AtleastOneDeallocationPIDIsNullOREmpty= Al menos uno de los physicalid de desasignaci\u00f3n en la entrada es nulo o est\u00e1 vac\u00edo.
Error.xRevision.MultiDeallocationIsNotSupported= Varias desasignaciones de cada elemento xRevision a\u00fan no son compatibles.
Error.xRevision.DeallocationPIDIsNotValid= La desasignaci\u00f3n proporcionada en la entrada no es v\u00e1lida o no forma parte de un gr\u00e1fico xRevision.
Error.xRevision.xRevElementDoesNotHaveAllocation= Este elemento xRevision no tiene ninguna asignaci\u00f3n.

Error.xRevision.AttributexRevGraphsToAttachIsNotPresent= El atributo xRevisionGraphsToAttach no est\u00e1 presente en la entrada.
Error.xRevision.AttributexRevGraphsToAttachIsEmpty= El atributo xRevisionGraphsToAttach est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AttributeReusableGraphReferenceIsNotPresent= El atributo reusableGraphReferencePID no est\u00e1 presente en la entrada.
Error.xRevision.AttributeReusableGraphReferenceIsEmpty= El atributo reusableGraphReferencePID es nulo o est\u00e1 vac\u00edo en la entrada.
Error.xRevision.AttachExistingXRevGraphFailed= No se ha podido adjuntar el gr\u00e1fico xRevision existente de una referencia a otra referencia para una de las referencias en la entrada.
Error.xRevision.CannotAttachXRevGraphItIsAlreadyExist= No es posible adjuntar un gr\u00e1fico XRevision para una de las referencias, porque la referencia ya tiene un gr\u00e1fico XRevision.
Error.xRevision.AllocationCrossesExistingOne= Esta asignaci\u00f3n cruza una existente. Pruebe a asignar a una versi\u00f3n de modelo superior a esta.
Error.xRevision.ErrorUnableToPerformAutoAllocationDuringSetScope= No se puede realizar la asignaci\u00f3n autom\u00e1tica durante la operaci\u00f3n de establecimiento del \u00e1mbito.
Error.xRevision.ErrorNoVariantsFoundDuringSetScope= No se han encontrado variantes para el contexto de configuraci\u00f3n durante la operaci\u00f3n de establecimiento del \u00e1mbito.


Error.xRevision.ParentNotInFrozen= El padre del elemento xRevision actual tiene el estado Preliminar o En curso; est\u00e1 prohibido su ascenso.
Error.xRevision.AllocatedMVNotReleased= La versi\u00f3n de modelo asignada al elemento xRevision actual no est\u00e1 emitida; est\u00e1 prohibido su ascenso.
Error.xRevision.FoundIncompleteChange= Hay acciones de cambio incompletas que est\u00e1n usando este elemento xRevision; est\u00e1 prohibido su ascenso.
Error.xRevision.ChildFrozen= El hijo del elemento xRevision actual tiene al menos el estado Congelado; est\u00e1 prohibido su descenso.

Error.xRevision.xRevisionDeleteAction= No se puede eliminar un elemento del gr\u00e1fico xRevision o no se puede establecer la referencia primaria.
Error.xRevision.PrimaryReferenceDelete= Est\u00e1 prohibido intentar eliminar la referencia primaria del gr\u00e1fico.
Error.xRevision.PrimaryReferenceDeleteMulti= Est\u00e1 prohibido intentar eliminar una referencia primaria que tenga un gr\u00e1fico con varios elementos xRevision.
Error.xRevision.DeleteCollabSpace= El elemento xRevision no est\u00e1 En curso y no est\u00e1 en el mismo espacio de colaboraci\u00f3n que el usuario; est\u00e1 prohibida su eliminaci\u00f3n.
Error.xRevision.FrozenxRev= El elemento xRevision est\u00e1 en un estado demasiado avanzado para permitir su eliminaci\u00f3n.
Error.xRevision.DeleteOneSingleElement= M\u00e1s de una referencia est\u00e1 utilizando este gr\u00e1fico con un solo elemento, no est\u00e1 permitida su eliminaci\u00f3n
Error.xRevision.DeleteFirstElement= M\u00e1s de una referencia est\u00e1 utilizando este gr\u00e1fico, no est\u00e1 permitida la eliminaci\u00f3n del primer elemento.
Error.xRevision.DeleteOneElement= Se est\u00e1 utilizando un elemento xRevision y no se puede eliminar.
Error.xRevision.ReferenceDeleteChildScope= Est\u00e1 prohibido tratar de eliminar una referencia cuyo gr\u00e1fico tiene gr\u00e1ficos hijos.
Error.xRevision.GraphDeleteChildScope= Tratar de eliminar un gr\u00e1fico que tenga gr\u00e1ficos hijos est\u00e1 prohibido.
Error.xRevision.CreateGraphPhyRevs= No se puede crear un gr\u00e1fico para el elemento actual, ya tiene revisiones f\u00edsicas.
Error.xRevision.CreateGraphNoExistCfg= No se puede crear un gr\u00e1fico para el elemento actual, no existe o no es configurable.
Error.xRevision.ReuseGraphDelSource= No se puede reutilizar un gr\u00e1fico existente para el elemento actual, el elemento de origen no existe.
Error.xRevision.ReuseGraphSourceNoAccess= No se puede reutilizar un gr\u00e1fico existente para el elemento actual, el usuario actual no tiene acceso al elemento de origen.
Error.xRevision.ReuseGraphSourceNoCfg= No se puede reutilizar un gr\u00e1fico existente para el elemento actual, el elemento de origen no es configurable.
Error.xRevision.ReuseGraphSourceNoGraph= No se puede reutilizar un gr\u00e1fico existente para el elemento actual, el elemento de origen no tiene ning\u00fan gr\u00e1fico.
