#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=P\u0159\u00edznak v datab\u00e1zi neexistuje.
Effectivity.Alert.FlagDisabledInDB=P\u0159\u00edznak v datab\u00e1zi existuje a je zak\u00e1z\u00e1n.
Effectivity.Alert.FlagEnabledInDB=P\u0159\u00edznak v datab\u00e1zi existuje a je povolen.
Effectivity.Alert.FilterableERTypesNotExistInDB=V datab\u00e1zi neexistuj\u00ed filtrovateln\u00e9 typy ER.
Effectivity.Alert.FilterableERTypesFoundInDB=V datab\u00e1zi byly nalezeny filtrovateln\u00e9 typy ER.

Error.AlreadyAttached=VAROV\u00c1N\u00cd : Model s ID \u2013 "<ModelID>" je ji\u017e p\u0159ipojen k referenci\u2026!
Error.AlreadyDetached=VAROV\u00c1N\u00cd : Model s ID \u2013 "<ModelID>" je ji\u017e odpojen\u2026!
Error.AlreadyAttachedMV=VAROV\u00c1N\u00cd : Verze modelu s ID \u2013 "<ModelVersionID>" je ji\u017e p\u0159ipojena k referenci\u2026!
Error.AlreadyDetachedMV=VAROV\u00c1N\u00cd : Verze modelu s ID \u2013 "<ModelVersionID>" je ji\u017e odpojena\u2026!

Error.TypeNotAModel=nen\u00ed typ modelu
Error.InternalServerError=intern\u00ed chyba
Error.ObjectNotFound=se nepoda\u0159ilo nal\u00e9zt
Error.XCADConfigurationNotPossible=struktury v\u00fdrobk\u016f nelze konfigurovat.

Error.DetachNotPossible.ConfigurationUsage=Model nelze odpojit, proto\u017ee je pou\u017eit v konfiguraci
Error.DetachNotPossible.EffectivityUsage=Model nelze odpojit, proto\u017ee je pou\u017eit ve v\u00fdrazu platnosti
Error.DetachNotPossible.ConfigurationRevision=Model nelze odpojit, proto\u017ee reference obsahuje revize konfigurace
Error.DetachNotPossible.ConfigRevision=Model nelze odpojit, proto\u017ee reference obsahuje revize konfigurace

Error.Unset.NoEffectivity=Tato instance nem\u00e1 platnost; zru\u0161en\u00ed nastaven\u00ed nebude m\u00edt \u017e\u00e1dn\u00fd \u00fa\u010dinek
Error.Unset.Domain.Forbidden=Vstupn\u00ed dom\u00e9na je zak\u00e1zan\u00e1
Error.Unset.Instance.Controlled.Change=Vstupn\u00ed instance je \u0159\u00edzen\u00e1 zm\u011bnou
Error.Unset.NoEffectivity.ForDomain=Tato instance nem\u00e1 platnost pro tuto dom\u00e9nu

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=P\u0159\u00edznak v datab\u00e1zi neexistuje.
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=P\u0159\u00edznak ji\u017e v datab\u00e1zi existuje.

Error.SetEffectivity.CriteriaNotEnabled=Krit\u00e9ria nejsou na nad\u0159azen\u00e9 referenci povolena.
Error.SetEffectivity.IncorrectEffectivityXML=V\u00fdraz \u00fa\u010dinnosti vstupu nebo data pou\u017eit\u00e1 ve v\u00fdrazu nejsou spr\u00e1vn\u00e1.
Error.SetEffectivity.InvalidInstancePhysicalID=Identifik\u00e1tor instance ve vstupu nen\u00ed platn\u00fd nebo spr\u00e1vn\u00fd.
Error.SetEffectivity.LoadDictionaryFailed=\u00da\u010dinnost nen\u00ed mo\u017en\u00e9 vzhledem k dat\u016fm slovn\u00edku nastavit. 
Error.SetEffectivity.3DPartNotConfigurable=Ko\u0159enov\u00e1 reference je d\u00edl 3DPart, kter\u00fd nen\u00ed konfigurovateln\u00fd. 
Error.SetEffectivity.XCADNotConfigurable=Ko\u0159enov\u00e1 reference je \u0159\u00edzen\u00e1 syst\u00e9mem XCAD, kter\u00fd nen\u00ed konfigurovateln\u00fd.
Error.SetEffectivity.ModelNotAccessibleORExist=Model uveden\u00fd ve vstupn\u00edm v\u00fdrazu nen\u00ed p\u0159\u00edstupn\u00fd nebo neexistuje.
Error.SetEffectivity.NoModelFoundInExpression=Vstupn\u00ed v\u00fdraz nen\u00ed dob\u0159e naform\u00e1tovan\u00fd (model nebyl nalezen).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=Krit\u00e9ria pou\u017eit\u00e1 ve vstupn\u00edm v\u00fdrazu nejsou na nad\u0159azen\u00e9 referenci povolena.
Error.SetEffectivity.ErrorSaveEffectivities=Chyba p\u0159i ukl\u00e1d\u00e1n\u00ed nov\u00fdch \u00fa\u010dinnost\u00ed.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=P\u0159i aktualizaci \u00fa\u010dinnosti revize konfigurace do\u0161lo k chyb\u011b.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=Instance je d\u00edl alespo\u0148 jednoho uvoln\u011bn\u00e9ho rozvinut\u00ed. Dal\u0161\u00ed v\u00fdraz rozvinut\u00ed nen\u00ed mo\u017en\u00e9 pou\u017e\u00edt.
Error.SetEffectivity.ReferenceNotConfigurable=Nad\u0159azen\u00e1 reference nen\u00ed konfigurovateln\u00e1.
Error.SetEffectivity.InstanceControlledByChange=Vstupn\u00ed instance je \u0159\u00edzen\u00e1 zm\u011bnou. \u00da\u010dinnost rozvinut\u00ed nen\u00ed mo\u017en\u00e9 upravit.
Error.SetEffectivity.RootNotConfigured=Nad\u0159azen\u00e1 reference dan\u00e9 instance neobsahuje kontext konfigurace.
Error.SetEffectivity.ModelNotAttached=Model uveden\u00fd ve vstupn\u00edm v\u00fdrazu nen\u00ed d\u00edlem kontextu konfigurace.
Error.SetEffectivity.NotAllNecessaryModelsAttached=K nad\u0159\u00edzen\u00e9 referenci nejsou p\u0159ipojeny v\u0161echny pot\u0159ebn\u00e9 modely.
Error.SetEffectivity.InstControlledByChange=Vstupn\u00ed instance je \u0159\u00edzen\u00e1 zm\u011bnou. \u00da\u010dinnost rozvinut\u00ed nen\u00ed mo\u017en\u00e9 upravit.
Error.SetEffectivity.FailureDuringOperation=P\u0159i operaci bylo zji\u0161t\u011bno selh\u00e1n\u00ed.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=V\u00fdraz nelze nastavit, proto\u017ee by se t\u00edm do \u00fa\u010dinnosti p\u0159idalo alespo\u0148 jedno zmrazen\u00e9 krit\u00e9rium rozvinut\u00ed nebo by se z n\u00ed odebralo.
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=Akce zm\u011bny je ji\u017e \u00fa\u010dinn\u00e1 a je definovan\u00e1 jako z\u00e1porn\u00e1.
Error.SetEffectivity.FailureDueToNoIntersection=Neexistuje \u017e\u00e1dn\u00fd pr\u016fse\u010d\u00edk mezi rozsahem \u00fa\u010dinnosti instance a rozsahem kontextu autorizace.
Error.IsEffsCoverEffRange.FailureDuringOperation=P\u0159i kontrole, jestli \u00fa\u010dinnosti rozvinut\u00ed pokr\u00fdvaj\u00ed rozsah \u00fa\u010dinnosti dan\u00e9ho rozvinut\u00ed, do\u0161lo k chyb\u011b.

Error.AttachCfgContext.FailedDueToMultipleMVs=V\u00edce verz\u00ed model\u016f, kter\u00e9 se maj\u00ed p\u0159ipojit u konfigurovateln\u00e9ho objektu, nen\u00ed podporov\u00e1no. V tuto chv\u00edli je podporov\u00e1na pouze jedna verze modelu, kter\u00e1 se m\u00e1 p\u0159ipojit.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=Kontext konfigurace nelze odpojit, proto\u017ee se pou\u017e\u00edv\u00e1 ve v\u00fdrazu \u00fa\u010dinnosti.

Error.AttributeVersionNotPresent=Verze povinn\u00e9ho atributu nen\u00ed ve vstupu json obsa\u017eena.
Error.AttributeVersionIsInvalid=Hodnota verze atributu ve vstupu nen\u00ed spr\u00e1vn\u00e1. Platn\u00e1 hodnota verze je 1.0.
Error.AttributeResourcesNotPresent=Zdroje povinn\u00e9ho atributu nejsou ve vstupu json obsa\u017eeny.
Error.AttributeResourcesIsEmpty=Zdroje atributu ve vstupu json jsou null nebo pr\u00e1zdn\u00e9.
Error.AttributeIdentifierNotPresent=Identifik\u00e1tor povinn\u00e9ho atributu nen\u00ed ve vstupu json obsa\u017een.
Error.AttributeIdentifierIsEmpty=Identifik\u00e1tor atributu ve vstupu json nesm\u00ed b\u00fdt null nebo pr\u00e1zdn\u00fd.
Error.AttributeConfigFilterIdentifierNotPresent=Hodnota configFilterIdentifier povinn\u00e9ho atributu nen\u00ed ve vstupu json obsa\u017eena.
Error.AttributeConfigFilterIdentifierIsEmpty=Hodnota configFilterIdentifier atributu ve vstupu json nesm\u00ed b\u00fdt null nebo pr\u00e1zdn\u00e1.
Error.AttributeViewIsNotValid=Hodnota zobrazen\u00ed atributu nen\u00ed ve vstupu platn\u00e1. Platn\u00e9 hodnoty pro zobrazen\u00ed jsou Aktu\u00e1ln\u00ed nebo Prom\u00edtan\u00e9.
Error.AttributeModeIsNotValid=Hodnota re\u017eimu atributu nen\u00ed ve vstupu platn\u00e1. Platn\u00e9 hodnoty pro re\u017eim jsou P\u0159\u00edsn\u00fd nebo 150 %.
Error.PhysicalIdIsInvalid=Vstup obsahuje neplatn\u00e9 fyzick\u00e9 ID instance.
Error.NotTypeOfVPMInstance=Vstup obsahuje fyzick\u00e9 ID, kter\u00e9 nen\u00ed typem instance.
Error.ConfigurationFilterPIDIsInvalid=Vstup obsahuje neplatn\u00e9 fyzick\u00e9 ID filtru konfigurace.
Error.ConfigurationFilterTypeIsNotSupported=Vstup obsahuje typ filtru konfigurace, kter\u00fd nen\u00ed podporov\u00e1n.
Error.InstanceDoesNotHaveStaticMapping=Statick\u00e9 mapov\u00e1n\u00ed instance nen\u00ed mo\u017en\u00e9 aktualizovat, proto\u017ee tato instance neobsahuje statick\u00e9 mapov\u00e1n\u00ed.

Error.AttributeModelPIDNotPresent=Hodnota modelPID povinn\u00e9ho atributu nen\u00ed ve vstupu json obsa\u017eena.
Error.AttributeModelPIDIsEmpty=Hodnota modelPID atributu ve vstupu json je null nebo pr\u00e1zdn\u00e1.
Error.AttributeViewIsInvalid=Hodnota zobrazen\u00ed atributu nen\u00ed platn\u00e1. Platn\u00e9 hodnoty u tohoto atributu jsou Aktu\u00e1ln\u00ed, Prom\u00edtan\u00e9 nebo V\u0161e.
Error.AttributeFormatIsInvalid=Hodnota form\u00e1tu atributu nen\u00ed platn\u00e1. Platn\u00e9 hodnoty u tohoto atributu jsou TXT nebo XML.
Error.AttributeOccurrencesNotPresent=V\u00fdskyty povinn\u00e9ho atributu nejsou ve vstupu json p\u0159\u00edtomn\u00e9.
Error.AttributeOccurrencesIsEmpty=V\u00fdskyty atributu ve vstupu json jsou null nebo pr\u00e1zdn\u00e9.

Error.FlagDoesNotExistInDatabase=P\u0159\u00edznak v datab\u00e1zi neexistuje.
Error.FlagFoundInDatabase=P\u0159\u00edznak ji\u017e v datab\u00e1zi existuje.

Error.xRevision.AttachScopeFailed=P\u0159i p\u0159ipojov\u00e1n\u00ed rozsahu k t\u00e9to referenci do\u0161lo k chyb\u011b.
Error.xRevision.DetachScopeFailed=P\u0159i odpojov\u00e1n\u00ed rozsahu od t\u00e9to reference do\u0161lo k chyb\u011b.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=Rozsahy nen\u00ed u t\u00e9to reference mo\u017en\u00e9 p\u0159ipojit, proto\u017ee k n\u00ed nen\u00ed p\u0159ipojen graf xRevision.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=Rozsahy nen\u00ed u t\u00e9to reference mo\u017en\u00e9 odpojit, proto\u017ee k n\u00ed nen\u00ed p\u0159ipojen graf xRevision.
Error.xRevision.EnableVariantCriteriaFailed=Krit\u00e9ria varianty nen\u00ed u t\u00e9to reference mo\u017en\u00e9 nastavit, proto\u017ee k n\u00ed nejsou p\u0159ipojen\u00e9 rozsahy.

Error.xRevision.ReferenceNotConfigurable=Tato reference nen\u00ed konfigurovateln\u00e1.

Error.AttributeVersionIsNotPresent=Verze atributu nen\u00ed ve vstupu obsa\u017eena.
Error.AttributeVersionIsNotCorrect=Hodnota verze atributu nen\u00ed platn\u00e1. Platn\u00e1 hodnota je u n\u011bj 1.0.
Error.AttributeEvolutionIdentifiersIsNotPresent=Hodnoty evolutionsIdentifier atributu nejsou ve vstupu obsa\u017eeny.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=Hodnoty evolutionsIdentifier atributu jsou ve vstupu null nebo pr\u00e1zdn\u00e9.
Error.EvolutionPhysicalIsNullOREmpty=Alespo\u0148 jedna z hodnot physicalid rozvinut\u00ed je ve vstupu pr\u00e1zdn\u00e1 nebo null.
Error.AttributeDetaislRequiredIsNotPresent=Hodnota detailsRequired atributu nen\u00ed ve vstupu p\u0159\u00edtomn\u00e1.
Error.AttributeDetaislRequiredIsNotCorrect=Hodnota detailsRequired atributu nen\u00ed platn\u00e1. Platn\u00e1 hodnota je u n\u011bj Ano nebo Ne.
Error.MixEvolutionsNotAllowed=Vstup obsahuje sm\u011bs typ\u016f rozvinut\u00ed, kter\u00e9 nejsou podporovan\u00e9. Uve\u010fte jeden typ hodnot physicalid rozvinut\u00ed.
Error.EvolutionsPIDNotValid=Hodnota physicalid tohoto rozvinut\u00ed nen\u00ed platn\u00e1.

Error.AttributeWorkUnderCompiledForm=Hodnota workUnderCompiledForm atributu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.AttributeInstancePIDNotPresent=Hodnota instancePID atributu nen\u00ed ve vstupu obsa\u017eena.
Error.AttributeInstancePIDNotValid=Hodnota instancePID atributu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.AttributeEffectivityCompiledFormNotPresent=Hodnota effectivityCompiledForm atributu nen\u00ed ve vstupu obsa\u017eena.
Error.AttributeEffectivityCompiledFormIsInvalid=Hodnota effectivityCompiledForm atributu je ve vstupu null.
Error.AtleastOneModelPIDIsNullOREmpty=Alespo\u0148 jedna z hodnota physicalid modelu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.RefORInstOrCAOrACShouldBePresent=Jedna z mo\u017enost\u00ed je ve vstupu nutn\u00e1, bu\u010f instance, akce zm\u011bny nebo kontext autorizace.
Error.AttributeVersionReferencePIDNotPresent=Hodnota referencePID atributu nen\u00ed ve vstupu obsa\u017eena.
Error.AttributeVersionReferencePIDNotInvalid=Hodnota referencePID atributu je ve vstupu null nebo pr\u00e1zdn\u00e1.
Error.xRevision.CannotCreateXRevGraphModelAttached=Na t\u00e9to referenci nen\u00ed mo\u017en\u00e9 vytvo\u0159it graf XRevision, proto\u017ee je k n\u011bmu ji\u017e p\u0159ipojen model.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=U t\u00e9to reference nen\u00ed mo\u017en\u00e9 vytvo\u0159it graf XRevision, proto\u017ee ke zdrojov\u00e9 referenci nen\u00ed p\u0159ipojen\u00fd \u017e\u00e1dn\u00fd graf xRevision.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=U t\u00e9to reference nen\u00ed mo\u017en\u00e9 vytvo\u0159it graf XRevision, proto\u017ee je ke zdrojov\u00e9 referenci ji\u017e p\u0159ipojen model.

Error.xRevision.xRevGraphAlreadyHasScope=Graf xRevision u t\u00e9to reference ji\u017e m\u00e1 rozsah.
Error.xRevision.xRevGraphHasNoScopeToDelete=Graf xRevision u t\u00e9to reference nem\u00e1 rozsah, kter\u00fd by bylo mo\u017en\u00e9 odstranit.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=Graf xRevision u t\u00e9to reference m\u00e1 p\u0159i\u0159azen\u00ed, tak\u017ee nen\u00ed mo\u017en\u00e9 odstranit rozsah.

Error.InvalidInstancePID=Hodnota physicalid t\u00e9to instance nen\u00ed platn\u00e1.

Error.FailedToDisableCriteria=Na konfigurovan\u00fdch objektech se nepoda\u0159ilo zak\u00e1zat krit\u00e9ria, proto\u017ee jedna nebo v\u00edce instanc\u00ed mo\u017en\u00e1 v \u00fa\u010dinnosti pou\u017eily <CriteriaName>.
Criteria.Date=Datum
Criteria.ManufacturingPlans=Pl\u00e1n v\u00fdroby
Criteria.Unit=Jednotka
Criteria.FeatureOption=Varianty a mo\u017enosti
Criteria.ModelVersion=Verze modelu

Warning.InstanceNotFilterable=Instance nepodporuje v\u00fdraz platnosti.
Warning.NotPossibleExtendOnThisInstance=Operace roz\u0161\u00ed\u0159en\u00ed nen\u00ed mo\u017en\u00e1 na instanci, kter\u00e1 je ji\u017e dostupn\u00e1 pro v\u0161echna rozvinut\u00ed.
Error.ExtendFailedOnThisInstance=Operace roz\u0161\u00ed\u0159en\u00ed na t\u00e9to instanci nen\u00ed mo\u017en\u00e1.
Error.InvalidPhysicalPID=Tato hodnota physicalid nen\u00ed platn\u00e1.

Cfg.Error.ErrorMissingParameterInWebService=Sch\u00e1zej\u00edc\u00ed parametr <key>. P\u0159i vytv\u00e1\u0159en\u00ed po\u017eadavku zahr\u0148te v\u0161echny po\u017eadovan\u00e9 parametry.
Cfg.Error.ErrorIncorrectParameterValueInWebService=Chybn\u00e1 hodnota parametru u <key>. P\u0159i vytv\u00e1\u0159en\u00ed po\u017eadavku zahr\u0148te platnou hodnotu parametru.
Cfg.Error.ErrorIncorrectArraySizeInWebService=Chybn\u00e1 velikost u pole <key>. P\u0159i vytv\u00e1\u0159en\u00ed po\u017eadavku se p\u0159esv\u011bd\u010dte, \u017ee toto pole m\u00e1 spr\u00e1vnou velikost.
Cfg.Error.ErrorExactlyOneParameterRequired=Neplatn\u00e1 kombinace parametr\u016f u <key>. P\u0159i vytv\u00e1\u0159en\u00ed po\u017eadavku se p\u0159esv\u011bd\u010dte, \u017ee je poskytnut p\u0159esn\u011b jeden z po\u017eadovan\u00fdch parametr\u016f.
Cfg.Error.ErrorInvalidPayloadInWebService=Datov\u00e1 \u010d\u00e1st po\u017eadavku neodpov\u00edd\u00e1 o\u010dek\u00e1van\u00e9mu sch\u00e9matu nebo form\u00e1tu. Zkontrolujte pros\u00edm strukturu, datov\u00e9 typy a po\u017eadovan\u00e1 pole.

Error.xRevision.NotPossibleToAttachScopes=Alespo\u0148 k jedn\u00e9 referenci ve vstupu nen\u00ed mo\u017en\u00e9 p\u0159ipojit rozsah, proto\u017ee k n\u00ed nen\u00ed p\u0159ipojen graf xRevision.

Error.ConfigFilterNotFoundOnReference=Na instanci nen\u00ed mo\u017en\u00e9 vytvo\u0159it statick\u00e9 mapov\u00e1n\u00ed, proto\u017ee se na objektu reference nenach\u00e1z\u00ed filtr vstupn\u00ed konfigurace.
Error.InstanceAlreadyHasStaticMapping=Na instanci nen\u00ed mo\u017en\u00e9 vytvo\u0159it statick\u00e9 mapov\u00e1n\u00ed, proto\u017ee instance statick\u00e9 mapov\u00e1n\u00ed ji\u017e m\u00e1.

Error.NotAccessibleObject=Tento obsah ji\u017e nen\u00ed p\u0159\u00edstupn\u00fd nebo byl mo\u017en\u00e1 odstran\u011bn.
Error.DoesNotExistObject=Vybran\u00fd objekt neexistuje.

Error.ConfigFilterIsTooMature=Na instanci nen\u00ed mo\u017en\u00e9 vytvo\u0159it statick\u00e9 mapov\u00e1n\u00ed, proto\u017ee filtr vstupn\u00ed konfigurace je v neaktu\u00e1ln\u00edm stavu.

Error.ModelVersionAlreadyAttach=P\u0159ipojen\u00ed tohoto modelu, kdy\u017e je u\u017e p\u0159ipojen\u00e1 verze modelu, nen\u00ed mo\u017en\u00e9.

Error.xRevision.RefDoesNotHaveXRevGraph=Jedna z referenc\u00ed ve vstupu, kter\u00e1 se pou\u017e\u00edv\u00e1 k p\u0159ipojen\u00ed jako rozsah, k sob\u011b nem\u00e1 p\u0159ipojen\u00fd graf xRevision.
Error.xRevision.ErrorNoXGraphFoundForReference=Odkaz uveden\u00fd ve vstupu nem\u00e1 p\u0159ipojen\u00fd graf xRevision.
