#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=O indicador n\u00e3o existe no banco de dados.
Effectivity.Alert.FlagDisabledInDB=H\u00e1 um indicador no banco de dados e ele est\u00e1 desativado.
Effectivity.Alert.FlagEnabledInDB=H\u00e1 um indicador no banco de dados e ele est\u00e1 ativado.
Effectivity.Alert.FilterableERTypesNotExistInDB=N\u00e3o h\u00e1 tipos de ER filtr\u00e1veis no banco de dados.
Effectivity.Alert.FilterableERTypesFoundInDB=Foram encontrados tipos de ER filtr\u00e1veis no banco de dados.

Error.AlreadyAttached=AVISO: o modelo com c\u00f3digo - "<ModelID>" j\u00e1 est\u00e1 anexado \u00e0 refer\u00eancia...!
Error.AlreadyDetached=AVISO: o modelo com c\u00f3digo - "<ModelID>" j\u00e1 est\u00e1 desanexado...!
Error.AlreadyAttachedMV=AVISO: a vers\u00e3o do modelo com ID - "<ModelVersionID>" j\u00e1 est\u00e1 anexada \u00e0 refer\u00eancia...!
Error.AlreadyDetachedMV=AVISO: a vers\u00e3o do modelo com ID - "<ModelVersionID>" j\u00e1 est\u00e1 desanexada...!

Error.TypeNotAModel=n\u00e3o \u00e9 um tipo de modelo
Error.InternalServerError=erro interno
Error.ObjectNotFound=n\u00e3o foi encontrado
Error.XCADConfigurationNotPossible=n\u00e3o \u00e9 poss\u00edvel configurar as estruturas do produto.

Error.DetachNotPossible.ConfigurationUsage=N\u00e3o \u00e9 poss\u00edvel desanexar o modelo porque ele \u00e9 usado por uma configura\u00e7\u00e3o
Error.DetachNotPossible.EffectivityUsage=N\u00e3o \u00e9 poss\u00edvel desanexar o modelo porque ele \u00e9 usado por uma express\u00e3o de vig\u00eancia
Error.DetachNotPossible.ConfigurationRevision=O modelo n\u00e3o pode ser separado porque a refer\u00eancia tem Revis\u00f5esdeConfigura\u00e7\u00e3o
Error.DetachNotPossible.ConfigRevision=O modelo n\u00e3o pode ser separado porque a refer\u00eancia tem Revis\u00f5es de Configura\u00e7\u00e3o

Error.Unset.NoEffectivity=Esta inst\u00e2ncia n\u00e3o tem vig\u00eancia, \u00e9 in\u00fatil remover a defini\u00e7\u00e3o
Error.Unset.Domain.Forbidden=O dom\u00ednio de entrada \u00e9 proibido
Error.Unset.Instance.Controlled.Change=A inst\u00e2ncia de entrada \u00e9 controlada por uma altera\u00e7\u00e3o
Error.Unset.NoEffectivity.ForDomain=Esta inst\u00e2ncia n\u00e3o tem vig\u00eancia para este dom\u00ednio

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=O indicador n\u00e3o existe no banco de dados.
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=O sinalizador j\u00e1 existe no banco de dados.

Error.SetEffectivity.CriteriaNotEnabled=O contexto de configura\u00e7\u00e3o n\u00e3o pode ser separado porque \u00e9 usado por uma express\u00e3o de efetividade.
Error.SetEffectivity.IncorrectEffectivityXML=A express\u00e3o de efetividade de entrada ou os dados usados na express\u00e3o n\u00e3o est\u00e3o corretos.
Error.SetEffectivity.InvalidInstancePhysicalID=O identificador da inst\u00e2ncia na entrada n\u00e3o \u00e9 v\u00e1lido ou correto.
Error.SetEffectivity.LoadDictionaryFailed=A vig\u00eancia n\u00e3o pode ser definida devido aos dados do dicion\u00e1rio. 
Error.SetEffectivity.3DPartNotConfigurable=A refer\u00eancia raiz \u00e9 uma 3DPart que n\u00e3o \u00e9 configur\u00e1vel. 
Error.SetEffectivity.XCADNotConfigurable=A refer\u00eancia raiz \u00e9 controlada pelo XCAD, o que n\u00e3o \u00e9 configur\u00e1vel.
Error.SetEffectivity.ModelNotAccessibleORExist=O modelo fornecido na express\u00e3o de entrada n\u00e3o est\u00e1 acess\u00edvel ou n\u00e3o existe.
Error.SetEffectivity.NoModelFoundInExpression=Express\u00e3o de entrada n\u00e3o bem formatada (nenhum modelo encontrado).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=O crit\u00e9rio usado na express\u00e3o de entrada n\u00e3o est\u00e1 habilitado na refer\u00eancia pai.
Error.SetEffectivity.ErrorSaveEffectivities=Erro ao salvar as novas efetividades.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=Ocorreu um erro durante a atualiza\u00e7\u00e3o das efetividades da Revis\u00e3o de Configura\u00e7\u00e3o.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=A inst\u00e2ncia faz parte de pelo menos uma Evolu\u00e7\u00e3o lan\u00e7ada. Novas Express\u00f5es de Evolu\u00e7\u00e3o n\u00e3o podem ser aplicadas.
Error.SetEffectivity.ReferenceNotConfigurable=A refer\u00eancia pai n\u00e3o \u00e9 configur\u00e1vel.
Error.SetEffectivity.InstanceControlledByChange=A inst\u00e2ncia de entrada \u00e9 controlada por uma Altera\u00e7\u00e3o. A efetividade da Evolu\u00e7\u00e3o n\u00e3o pode ser editada.
Error.SetEffectivity.RootNotConfigured=A refer\u00eancia pai da inst\u00e2ncia fornecida n\u00e3o tem um Contexto de Configura\u00e7\u00e3o.
Error.SetEffectivity.ModelNotAttached=O modelo fornecido na express\u00e3o de entrada n\u00e3o faz parte do Contexto de Configura\u00e7\u00e3o.
Error.SetEffectivity.NotAllNecessaryModelsAttached=Nem todos os modelos necess\u00e1rios est\u00e3o anexados na refer\u00eancia pai.
Error.SetEffectivity.InstControlledByChange=A inst\u00e2ncia de entrada \u00e9 controlada por uma Altera\u00e7\u00e3o. A efetividade da Evolu\u00e7\u00e3o n\u00e3o pode ser editada.
Error.SetEffectivity.FailureDuringOperation=Falha detectada durante a opera\u00e7\u00e3o.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=Imposs\u00edvel definir a express\u00e3o porque isso adicionaria ou removeria pelo menos um crit\u00e9rio de evolu\u00e7\u00e3o congelado para as efetividades
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=A A\u00e7\u00e3o de Mudan\u00e7a j\u00e1 est\u00e1 em vigor e \u00e9 definida como negativa.
Error.SetEffectivity.FailureDueToNoIntersection=N\u00e3o h\u00e1 interse\u00e7\u00e3o entre o intervalo de efetividade da inst\u00e2ncia e o intervalo do Contexto de Cria\u00e7\u00e3o.
Error.IsEffsCoverEffRange.FailureDuringOperation=Ocorreu um erro ao verificar se as efetividades de evolu\u00e7\u00e3o cobrem um determinado intervalo de efetividade de evolu\u00e7\u00e3o.

Error.AttachCfgContext.FailedDueToMultipleMVs=N\u00e3o h\u00e1 suporte para anexar m\u00faltiplas Vers\u00f5es de Modelo a um objeto configur\u00e1vel. Por enquanto, apenas uma Vers\u00e3o de Modelo \u00e9 suportada.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=O contexto de configura\u00e7\u00e3o n\u00e3o pode ser separado porque \u00e9 usado por uma express\u00e3o de efetividade.

Error.AttributeVersionNotPresent=A vers\u00e3o do atributo obrigat\u00f3rio n\u00e3o est\u00e1 presente no json de entrada.
Error.AttributeVersionIsInvalid=O valor da vers\u00e3o do atributo n\u00e3o est\u00e1 correto na entrada. O valor v\u00e1lido para a vers\u00e3o \u00e9 1.0.
Error.AttributeResourcesNotPresent=O atributo obrigat\u00f3rio resources n\u00e3o est\u00e1 presente no json de entrada.
Error.AttributeResourcesIsEmpty=O atributo resources \u00e9 nulo ou vazio no json de entrada.
Error.AttributeIdentifierNotPresent=O identificador de atributo obrigat\u00f3rio n\u00e3o est\u00e1 presente no json de entrada.
Error.AttributeIdentifierIsEmpty=O identificador de atributo n\u00e3o deve ser nulo ou vazio no json de entrada.
Error.AttributeConfigFilterIdentifierNotPresent=O atributo obrigat\u00f3rio configFilterIdentifier n\u00e3o est\u00e1 presente no json de entrada.
Error.AttributeConfigFilterIdentifierIsEmpty=O atributo configFilterIdentifier n\u00e3o deve ser nulo ou vazio no json de entrada.
Error.AttributeViewIsNotValid=O valor da visualiza\u00e7\u00e3o do atributo n\u00e3o \u00e9 v\u00e1lido na entrada. Os valores v\u00e1lidos para a visualiza\u00e7\u00e3o s\u00e3o Atual ou Projetada.
Error.AttributeModeIsNotValid=O valor do modo de atributo n\u00e3o \u00e9 v\u00e1lido na entrada. Os valores v\u00e1lidos para o modo s\u00e3o Estrito ou 150%.
Error.PhysicalIdIsInvalid=A entrada cont\u00e9m um ID f\u00edsico de inst\u00e2ncia inv\u00e1lido.
Error.NotTypeOfVPMInstance=A entrada cont\u00e9m um ID f\u00edsico que n\u00e3o \u00e9 um tipo de inst\u00e2ncia.
Error.ConfigurationFilterPIDIsInvalid=A entrada cont\u00e9m um ID f\u00edsico de filtro de configura\u00e7\u00e3o inv\u00e1lido.
Error.ConfigurationFilterTypeIsNotSupported=A entrada cont\u00e9m um tipo de filtro de configura\u00e7\u00e3o que n\u00e3o \u00e9 suportado.
Error.InstanceDoesNotHaveStaticMapping=Imposs\u00edvel atualizar o mapeamento est\u00e1tico da inst\u00e2ncia porque esta inst\u00e2ncia n\u00e3o tem mapeamento est\u00e1tico.

Error.AttributeModelPIDNotPresent=O atributo obrigat\u00f3rio modelPID n\u00e3o est\u00e1 presente no json de entrada.
Error.AttributeModelPIDIsEmpty=O atributo modelPID \u00e9 nulo ou vazio no json de entrada.
Error.AttributeViewIsInvalid=O valor da visualiza\u00e7\u00e3o do atributo n\u00e3o \u00e9 v\u00e1lido. Os valores v\u00e1lidos para este atributo s\u00e3o Atual, Projetado ou Todos.
Error.AttributeFormatIsInvalid=O valor do formato do atributo n\u00e3o \u00e9 v\u00e1lido. Os valores v\u00e1lidos para este atribut o s\u00e3o TXT ou XML.
Error.AttributeOccurrencesNotPresent=As ocorr\u00eancias de atributos obrigat\u00f3rios n\u00e3o est\u00e3o presentes no json de entrada.
Error.AttributeOccurrencesIsEmpty=As ocorr\u00eancias de atributo s\u00e3o nulas ou vazias no json de entrada.

Error.FlagDoesNotExistInDatabase=O indicador n\u00e3o existe no banco de dados.
Error.FlagFoundInDatabase=O sinalizador j\u00e1 existe no banco de dados.

Error.xRevision.AttachScopeFailed=Ocorreu um erro ao anexar o escopo a esta refer\u00eancia.
Error.xRevision.DetachScopeFailed=Ocorreu um erro ao desanexar o escopo desta refer\u00eancia.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=N\u00e3o \u00e9 poss\u00edvel anexar escopos para esta refer\u00eancia, porque o xRevision Graph n\u00e3o est\u00e1 anexado a ela.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=N\u00e3o \u00e9 poss\u00edvel destacar escopos para esta refer\u00eancia, porque o xRevision Graph n\u00e3o est\u00e1 anexado a ela.
Error.xRevision.EnableVariantCriteriaFailed=N\u00e3o \u00e9 poss\u00edvel definir crit\u00e9rios variantes para esta refer\u00eancia, porque os escopos n\u00e3o est\u00e3o anexados a ela.

Error.xRevision.ReferenceNotConfigurable=Esta refer\u00eancia n\u00e3o \u00e9 configur\u00e1vel.

Error.AttributeVersionIsNotPresent=A vers\u00e3o do atributo n\u00e3o est\u00e1 presente na entrada.
Error.AttributeVersionIsNotCorrect=O valor da vers\u00e3o do atributo n\u00e3o \u00e9 v\u00e1lido. O valor v\u00e1lido para ele \u00e9 1.0.
Error.AttributeEvolutionIdentifiersIsNotPresent=O atributo evolutionsIdentifiers n\u00e3o est\u00e1 presente na entrada.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=O atributo evolutionsIdentifiers est\u00e1 vazio ou nulo na entrada.
Error.EvolutionPhysicalIsNullOREmpty=Pelo menos um dos physicalid de evolu\u00e7\u00e3o est\u00e1 vazio ou nulo na entrada.
Error.AttributeDetaislRequiredIsNotPresent=O atributo detailsRequired n\u00e3o est\u00e1 presente na entrada.
Error.AttributeDetaislRequiredIsNotCorrect=O valor obrigat\u00f3rio do atributo detailsRequired n\u00e3o \u00e9 v\u00e1lido. O valor v\u00e1lido para ele \u00e9 Sim ou N\u00e3o.
Error.MixEvolutionsNotAllowed=A entrada cont\u00e9m uma mistura de tipos de evolu\u00e7\u00e3o que n\u00e3o s\u00e3o suportados. Forne\u00e7a um tipo de evolu\u00e7\u00e3o f\u00edsica.
Error.EvolutionsPIDNotValid=Esta evolu\u00e7\u00e3o f\u00edsica n\u00e3o \u00e9 v\u00e1lida.

Error.AttributeWorkUnderCompiledForm=O atributo workUnderCompiledForm \u00e9 nulo ou vazio na entrada.
Error.AttributeInstancePIDNotPresent=O atributo instancePID n\u00e3o est\u00e1 presente na entrada.
Error.AttributeInstancePIDNotValid=O atributo instancePID \u00e9 nulo ou vazio na entrada.
Error.AttributeEffectivityCompiledFormNotPresent=O atributo effectivityCompiledForm n\u00e3o est\u00e1 presente na entrada.
Error.AttributeEffectivityCompiledFormIsInvalid=O atributo effectivityCompiledForm \u00e9 nulo na entrada.
Error.AtleastOneModelPIDIsNullOREmpty=Pelo menos um dos physicalid do modelo na entrada \u00e9 nulo ou vazio.
Error.RefORInstOrCAOrACShouldBePresent=Um deles \u00e9 necess\u00e1rio na entrada, seja em Inst\u00e2ncias ou A\u00e7\u00e3o de altera\u00e7\u00e3o ou Contexto de cria\u00e7\u00e3o.
Error.AttributeVersionReferencePIDNotPresent=O atributo referencePID n\u00e3o est\u00e1 presente na entrada.
Error.AttributeVersionReferencePIDNotInvalid=O atributo referencePID \u00e9 nulo ou vazio na entrada.
Error.xRevision.CannotCreateXRevGraphModelAttached=N\u00e3o \u00e9 poss\u00edvel criar um gr\u00e1fico XRevision nesta refer\u00eancia, porque um modelo j\u00e1 est\u00e1 anexado a ele.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=N\u00e3o \u00e9 poss\u00edvel criar um gr\u00e1fico XRevision nesta refer\u00eancia porque n\u00e3o h\u00e1 nenhum gr\u00e1fico xRevision anexado na refer\u00eancia de origem.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=N\u00e3o \u00e9 poss\u00edvel criar um gr\u00e1fico XRevision nesta refer\u00eancia porque um modelo j\u00e1 est\u00e1 anexado na refer\u00eancia de origem.

Error.xRevision.xRevGraphAlreadyHasScope=O gr\u00e1fico xRevision nesta refer\u00eancia j\u00e1 tem o escopo.
Error.xRevision.xRevGraphHasNoScopeToDelete=O gr\u00e1fico xRevision nesta refer\u00eancia n\u00e3o tem escopo para exclus\u00e3o.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=O gr\u00e1fico xRevision nesta refer\u00eancia tem alguma aloca\u00e7\u00e3o, ent\u00e3o n\u00e3o \u00e9 poss\u00edvel excluir o escopo.

Error.InvalidInstancePID=Esta inst\u00e2ncia physicalid n\u00e3o \u00e9 v\u00e1lida.

Error.FailedToDisableCriteria=Falha ao desabilitar crit\u00e9rios em objetos configurados, pois uma/mais inst\u00e2ncias podem ter <CriteriaName> usado em sua efetividade.
Criteria.Date=Data
Criteria.ManufacturingPlans=Plano de fabrica\u00e7\u00e3o
Criteria.Unit=Unidade
Criteria.FeatureOption=Variantes e op\u00e7\u00f5es
Criteria.ModelVersion=Vers\u00e3o do modelo

Warning.InstanceNotFilterable=A inst\u00e2ncia n\u00e3o permite a express\u00e3o de vig\u00eancia.
Warning.NotPossibleExtendOnThisInstance=A opera\u00e7\u00e3o de extens\u00e3o n\u00e3o pode ocorrer em uma inst\u00e2ncia que j\u00e1 est\u00e1 dispon\u00edvel para todas as evolu\u00e7\u00f5es.
Error.ExtendFailedOnThisInstance=A opera\u00e7\u00e3o de extens\u00e3o n\u00e3o pode ocorrer nesta inst\u00e2ncia.
Error.InvalidPhysicalPID=Este ID f\u00edsico n\u00e3o \u00e9 v\u00e1lido.

Cfg.Error.ErrorMissingParameterInWebService=Par\u00e2metro ausente <key>. Inclua todos os par\u00e2metros necess\u00e1rios ao fazer a solicita\u00e7\u00e3o.
Cfg.Error.ErrorIncorrectParameterValueInWebService=Valor de par\u00e2metro incorreto para <key>. Inclua um valor de par\u00e2metro v\u00e1lido ao fazer a solicita\u00e7\u00e3o.
Cfg.Error.ErrorIncorrectArraySizeInWebService=Tamanho errado para a matriz <key>. Certifique-se de que esta matriz tenha o tamanho correto ao fazer a solicita\u00e7\u00e3o.
Cfg.Error.ErrorExactlyOneParameterRequired=Combina\u00e7\u00e3o de par\u00e2metros inv\u00e1lida para <key>. Certifique-se de que exatamente um dos par\u00e2metros necess\u00e1rios seja fornecido ao fazer a solicita\u00e7\u00e3o.
Cfg.Error.ErrorInvalidPayloadInWebService=A carga \u00fatil da solicita\u00e7\u00e3o n\u00e3o est\u00e1 em conformidade com o esquema ou forma esperados. Verifique a estrutura, tipos de datas e os campos obrigat\u00f3rios.

Error.xRevision.NotPossibleToAttachScopes=N\u00e3o \u00e9 poss\u00edvel anexar um escopo para ao menos uma das refer\u00eancias na entrada, pois o gr\u00e1fico xRevision n\u00e3o est\u00e1 anexado a ele.

Error.ConfigFilterNotFoundOnReference=N\u00e3o \u00e9 poss\u00edvel criar mapeamento est\u00e1tico em uma inst\u00e2ncia, pois o filtro de configura\u00e7\u00e3o de entrada n\u00e3o foi encontrado em um objeto de refer\u00eancia.
Error.InstanceAlreadyHasStaticMapping=N\u00e3o \u00e9 poss\u00edvel criar mapeamento est\u00e1tico em uma inst\u00e2ncia, pois esta inst\u00e2ncia j\u00e1 tem um mapeamento est\u00e1tico.

Error.NotAccessibleObject=Este conte\u00fado n\u00e3o est\u00e1 mais acess\u00edvel ou pode ter sido exclu\u00eddo.
Error.DoesNotExistObject=O objeto selecionado n\u00e3o existe.

Error.ConfigFilterIsTooMature=N\u00e3o \u00e9 poss\u00edvel criar mapeamento est\u00e1tico em uma inst\u00e2ncia, pois o filtro de configura\u00e7\u00e3o de entrada est\u00e1 em estado obsoleto.

Error.ModelVersionAlreadyAttach=N\u00e3o \u00e9 poss\u00edvel anexar este modelo quando j\u00e1 existe uma vers\u00e3o de modelo anexada.

Error.xRevision.RefDoesNotHaveXRevGraph=Uma das refer\u00eancias na entrada usada para anexar como escopo n\u00e3o cont\u00e9m o gr\u00e1fico xRevision anexado.
Error.xRevision.ErrorNoXGraphFoundForReference=A refer\u00eancia fornecida na entrada n\u00e3o tem um xRevision Graph anexado a ela.
