#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=\u30d5\u30e9\u30b0\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Effectivity.Alert.FlagDisabledInDB=\u30d5\u30e9\u30b0\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u3001\u7121\u52b9\u3067\u3059
Effectivity.Alert.FlagEnabledInDB=\u30d5\u30e9\u30b0\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u3001\u6709\u52b9\u3067\u3059
Effectivity.Alert.FilterableERTypesNotExistInDB=\u30d5\u30a3\u30eb\u30bf\u53ef\u80fd\u306aER\u30bf\u30a4\u30d7\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Effectivity.Alert.FilterableERTypesFoundInDB=\u30d5\u30a3\u30eb\u30bf\u53ef\u80fd\u306aER\u30bf\u30a4\u30d7\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u898b\u3064\u304b\u308a\u307e\u3057\u305f

Error.AlreadyAttached=\u8b66\u544a\uff1aID - "<ModelID>"\u306e\u30e2\u30c7\u30eb\u306f\u53c2\u7167\u306b\u3059\u3067\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u3059...
Error.AlreadyDetached=\u8b66\u544a\uff1aID - "<ModelID>"\u306e\u30e2\u30c7\u30eb\u306f\u3059\u3067\u306b\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3055\u308c\u3066\u3044\u307e\u3059...
Error.AlreadyAttachedMV=\u8b66\u544a\uff1aID - "<ModelVersionID>"\u306e\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001\u53c2\u7167\u306b\u3059\u3067\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u3059...
Error.AlreadyDetachedMV=\u8b66\u544a\uff1aID - "<ModelVersionID>"\u306e\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001\u3059\u3067\u306b\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3055\u308c\u3066\u3044\u307e\u3059...

Error.TypeNotAModel=\u306f\u30e2\u30c7\u30eb\u306e\u30bf\u30a4\u30d7\u3067\u306f\u3042\u308a\u307e\u305b\u3093
Error.InternalServerError=\u5185\u90e8\u30a8\u30e9\u30fc
Error.ObjectNotFound=\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
Error.XCADConfigurationNotPossible=\u88fd\u54c1\u69cb\u9020\u3092\u69cb\u6210\u3067\u304d\u307e\u305b\u3093

Error.DetachNotPossible.ConfigurationUsage=\u69cb\u6210\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30e2\u30c7\u30eb\u3092\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3067\u304d\u307e\u305b\u3093
Error.DetachNotPossible.EffectivityUsage=\u6709\u52b9\u6027\u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30e2\u30c7\u30eb\u3092\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3067\u304d\u307e\u305b\u3093
Error.DetachNotPossible.ConfigurationRevision=\u53c2\u7167\u306b\u69cb\u6210\u30ea\u30d3\u30b8\u30e7\u30f3\u304c\u3042\u308b\u305f\u3081\u3001\u30e2\u30c7\u30eb\u3092\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3067\u304d\u307e\u305b\u3093
Error.DetachNotPossible.ConfigRevision=\u53c2\u7167\u306b\u69cb\u6210\u30ea\u30d3\u30b8\u30e7\u30f3\u304c\u3042\u308b\u305f\u3081\u3001\u30e2\u30c7\u30eb\u3092\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3067\u304d\u307e\u305b\u3093

Error.Unset.NoEffectivity=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u6709\u52b9\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u8a2d\u5b9a\u89e3\u9664\u306f\u7121\u52b9\u3067\u3059
Error.Unset.Domain.Forbidden=\u5165\u529b\u30c9\u30e1\u30a4\u30f3\u306f\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059
Error.Unset.Instance.Controlled.Change=\u5165\u529b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u5909\u66f4\u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u307e\u3059
Error.Unset.NoEffectivity.ForDomain=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u3001\u3053\u306e\u30c9\u30e1\u30a4\u30f3\u306b\u5bfe\u3059\u308b\u6709\u52b9\u6027\u304c\u3042\u308a\u307e\u305b\u3093

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=\u30d5\u30e9\u30b0\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=\u30d5\u30e9\u30b0\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u307e\u3059

Error.SetEffectivity.CriteriaNotEnabled=\u6761\u4ef6\u304c\u3001\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u3067\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
Error.SetEffectivity.IncorrectEffectivityXML=\u5165\u529b\u6709\u52b9\u6027\u5f0f\u307e\u305f\u306f\u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u30c7\u30fc\u30bf\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093
Error.SetEffectivity.InvalidInstancePhysicalID=\u5165\u529b\u5185\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u8b58\u5225\u5b50\u304c\u3001\u7121\u52b9\u307e\u305f\u306f\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093
Error.SetEffectivity.LoadDictionaryFailed=\u8f9e\u66f8\u30c7\u30fc\u30bf\u304c\u539f\u56e0\u3067\u6709\u52b9\u6027\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093 
Error.SetEffectivity.3DPartNotConfigurable=\u30eb\u30fc\u30c8\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u304c\u3001\u69cb\u6210\u53ef\u80fd\u3067\u306a\u30443D\u30d1\u30fc\u30c4\u3067\u3059 
Error.SetEffectivity.XCADNotConfigurable=\u30eb\u30fc\u30c8\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u304c\u3001\u69cb\u6210\u53ef\u80fd\u3067\u306a\u3044XCAD\u3067\u5236\u5fa1\u3055\u308c\u3066\u3044\u307e\u3059
Error.SetEffectivity.ModelNotAccessibleORExist=\u5165\u529b\u5f0f\u3067\u6307\u5b9a\u3055\u308c\u305f\u30e2\u30c7\u30eb\u306f\u3001\u30a2\u30af\u30bb\u30b9\u3067\u304d\u306a\u3044\u304b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.SetEffectivity.NoModelFoundInExpression=\u5165\u529b\u5f0f\u304c\u6b63\u3057\u304f\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093(\u30e2\u30c7\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093)
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=\u5165\u529b\u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u6761\u4ef6\u304c\u3001\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u3067\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
Error.SetEffectivity.ErrorSaveEffectivities=\u65b0\u3057\u3044\u6709\u52b9\u6027\u306e\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=\u69cb\u6210\u30ea\u30d3\u30b8\u30e7\u30f3\u306e\u6709\u52b9\u6027\u306e\u66f4\u65b0\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u30ea\u30ea\u30fc\u30b9\u6e08\u307f\u5c55\u958b\u306e\u4e00\u90e8\u3067\u3059\u3002\u65b0\u3057\u3044\u5c55\u958b\u5f0f\u306f\u9069\u7528\u3067\u304d\u307e\u305b\u3093
Error.SetEffectivity.ReferenceNotConfigurable=\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u304c\u69cb\u6210\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093
Error.SetEffectivity.InstanceControlledByChange=\u5165\u529b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u5909\u66f4\u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u307e\u3059\u3002\u5c55\u958b\u6709\u52b9\u6027\u306f\u7de8\u96c6\u3067\u304d\u307e\u305b\u3093
Error.SetEffectivity.RootNotConfigured=\u6307\u5b9a\u3055\u308c\u305f\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u306b\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u304c\u3042\u308a\u307e\u305b\u3093
Error.SetEffectivity.ModelNotAttached=\u5165\u529b\u5f0f\u3067\u6307\u5b9a\u3055\u308c\u305f\u30e2\u30c7\u30eb\u306f\u3001\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4e00\u90e8\u3067\u306f\u3042\u308a\u307e\u305b\u3093
Error.SetEffectivity.NotAllNecessaryModelsAttached=\u4e00\u90e8\u306e\u5fc5\u8981\u306a\u30e2\u30c7\u30eb\u304c\u3001\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u305b\u3093
Error.SetEffectivity.InstControlledByChange=\u5165\u529b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u5909\u66f4\u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u307e\u3059\u3002\u5c55\u958b\u6709\u52b9\u6027\u306f\u7de8\u96c6\u3067\u304d\u307e\u305b\u3093
Error.SetEffectivity.FailureDuringOperation=\u64cd\u4f5c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=\u3053\u306e\u5f0f\u306f\u3001\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u51cd\u7d50\u5c55\u958b\u57fa\u6e96\u3092\u6709\u52b9\u6027\u306b\u8ffd\u52a0\u307e\u305f\u306f\u9664\u53bb\u3059\u308b\u3053\u3068\u306b\u306a\u308b\u305f\u3081\u3001\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u306f\u3059\u3067\u306b\u6709\u52b9\u3067\u3042\u308a\u3001\u30cd\u30ac\u30c6\u30a3\u30d6\u3068\u3057\u3066\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u3059
Error.SetEffectivity.FailureDueToNoIntersection=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u6709\u52b9\u6027\u7bc4\u56f2\u3068\u30aa\u30fc\u30b5\u30ea\u30f3\u30b0\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u7bc4\u56f2\u306e\u9593\u306b\u5171\u901a\u90e8\u5206\u304c\u3042\u308a\u307e\u305b\u3093
Error.IsEffsCoverEffRange.FailureDuringOperation=\u5c55\u958b\u6709\u52b9\u6027\u304c\u6307\u5b9a\u3057\u305f\u5c55\u958b\u6709\u52b9\u6027\u7bc4\u56f2\u3092\u30ab\u30d0\u30fc\u3057\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f

Error.AttachCfgContext.FailedDueToMultipleMVs=\u69cb\u6210\u53ef\u80fd\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u8907\u6570\u306e\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u95a2\u9023\u4ed8\u3051\u308b\u3053\u3068\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u73fe\u5728\u306f\u3001\u95a2\u9023\u4ed8\u3051\u3067\u304d\u308b\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u306f1\u3064\u3060\u3051\u3067\u3059
Error.DetachCfgContext.CannotDetachUsedInEffectivity=\u6709\u52b9\u6027\u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3067\u304d\u307e\u305b\u3093

Error.AttributeVersionNotPresent=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeVersionIsInvalid=\u5165\u529b\u306e\u5c5e\u6027\u30d0\u30fc\u30b8\u30e7\u30f3\u5024\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u6709\u52b9\u306a\u5024\u306f1.0\u3067\u3059
Error.AttributeResourcesNotPresent=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u30ea\u30bd\u30fc\u30b9\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeResourcesIsEmpty=\u5c5e\u6027\u30ea\u30bd\u30fc\u30b9\u304c\u5165\u529bJSON\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059
Error.AttributeIdentifierNotPresent=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u8b58\u5225\u5b50\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeIdentifierIsEmpty=\u5c5e\u6027\u8b58\u5225\u5b50\u306f\u5165\u529bJSON\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u306b\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044
Error.AttributeConfigFilterIdentifierNotPresent=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u69cb\u6210\u30d5\u30a3\u30eb\u30bf\u8b58\u5225\u5b50\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeConfigFilterIdentifierIsEmpty=\u5c5e\u6027\u69cb\u6210\u30d5\u30a3\u30eb\u30bf\u8b58\u5225\u5b50\u306f\u5165\u529bJSON\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u306b\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044
Error.AttributeViewIsNotValid=\u5165\u529b\u306e\u5c5e\u6027\u30d3\u30e5\u30fc\u5024\u304c\u7121\u52b9\u3067\u3059\u3002\u30d3\u30e5\u30fc\u306e\u6709\u52b9\u306a\u5024\u306f\u300c\u73fe\u884c\u300d\u307e\u305f\u306f\u300c\u4e88\u5b9a\u300d\u3067\u3059
Error.AttributeModeIsNotValid=\u5165\u529b\u306e\u5c5e\u6027\u30e2\u30fc\u30c9\u5024\u304c\u7121\u52b9\u3067\u3059\u3002\u30e2\u30fc\u30c9\u306e\u6709\u52b9\u306a\u5024\u306f\u300c\u53b3\u5bc6\u300d\u307e\u305f\u306f\u300c150%\u300d\u3067\u3059
Error.PhysicalIdIsInvalid=\u5165\u529b\u306b\u306f\u3001\u7121\u52b9\u306a\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u7269\u7406ID\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
Error.NotTypeOfVPMInstance=\u5165\u529b\u306b\u306f\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30bf\u30a4\u30d7\u3067\u306f\u306a\u3044\u7269\u7406ID\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
Error.ConfigurationFilterPIDIsInvalid=\u5165\u529b\u306b\u306f\u3001\u7121\u52b9\u306a\u69cb\u6210\u30d5\u30a3\u30eb\u30bf\u306e\u7269\u7406ID\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
Error.ConfigurationFilterTypeIsNotSupported=\u5165\u529b\u306b\u306f\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u69cb\u6210\u30d5\u30a3\u30eb\u30bf\u30bf\u30a4\u30d7\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
Error.InstanceDoesNotHaveStaticMapping=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u304c\u306a\u3044\u305f\u3081\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093

Error.AttributeModelPIDNotPresent=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u30e2\u30c7\u30ebPID\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeModelPIDIsEmpty=\u5c5e\u6027\u30e2\u30c7\u30ebPID\u304c\u5165\u529bJSON\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059
Error.AttributeViewIsInvalid=\u5c5e\u6027\u30d3\u30e5\u30fc\u306e\u5024\u304c\u7121\u52b9\u3067\u3059\u3002\u3053\u306e\u5c5e\u6027\u306e\u6709\u52b9\u306a\u5024\u306f\u300c\u73fe\u884c\u300d\u3001\u300c\u4e88\u5b9a\u300d\u3001\u307e\u305f\u306f\u300c\u3059\u3079\u3066\u300d\u3067\u3059
Error.AttributeFormatIsInvalid=\u5c5e\u6027\u5f62\u5f0f\u306e\u5024\u304c\u7121\u52b9\u3067\u3059\u3002\u3053\u306e\u5c5e\u6027\u306e\u6709\u52b9\u306a\u5024\u306fTXT\u307e\u305f\u306fXML\u3067\u3059
Error.AttributeOccurrencesNotPresent=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u30aa\u30ab\u30ec\u30f3\u30b9\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeOccurrencesIsEmpty=\u5c5e\u6027\u30aa\u30ab\u30ec\u30f3\u30b9\u304c\u5165\u529bJSON\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059

Error.FlagDoesNotExistInDatabase=\u30d5\u30e9\u30b0\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.FlagFoundInDatabase=\u30d5\u30e9\u30b0\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5b58\u5728\u3057\u307e\u3059

Error.xRevision.AttachScopeFailed=\u3053\u306e\u53c2\u7167\u306b\u6709\u52b9\u7bc4\u56f2\u3092\u95a2\u9023\u4ed8\u3051\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
Error.xRevision.DetachScopeFailed=\u3053\u306e\u53c2\u7167\u304b\u3089\u6709\u52b9\u7bc4\u56f2\u3092\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3059\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=\u3053\u306e\u53c2\u7167\u306b\u306fxRevision\u30b0\u30e9\u30d5\u304c\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u53c2\u7167\u306b\u6709\u52b9\u7bc4\u56f2\u3092\u95a2\u9023\u4ed8\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=\u3053\u306e\u53c2\u7167\u306b\u306fxRevision\u30b0\u30e9\u30d5\u304c\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u53c2\u7167\u304b\u3089\u6709\u52b9\u7bc4\u56f2\u3092\u95a2\u9023\u4ed8\u3051\u89e3\u9664\u3067\u304d\u307e\u305b\u3093
Error.xRevision.EnableVariantCriteriaFailed=\u3053\u306e\u53c2\u7167\u306b\u306f\u6709\u52b9\u7bc4\u56f2\u304c\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u53c2\u7167\u306b\u30d0\u30ea\u30a2\u30f3\u30c8\u6761\u4ef6\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093

Error.xRevision.ReferenceNotConfigurable=\u3053\u306e\u53c2\u7167\u306f\u69cb\u6210\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093

Error.AttributeVersionIsNotPresent=\u5c5e\u6027\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeVersionIsNotCorrect=\u5c5e\u6027\u30d0\u30fc\u30b8\u30e7\u30f3\u5024\u304c\u7121\u52b9\u3067\u3059\u3002\u6709\u52b9\u306a\u5024\u306f1.0\u3067\u3059
Error.AttributeEvolutionIdentifiersIsNotPresent=\u5c5e\u6027evolutionsIdentifiers\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeEvolutionIdentifiersIsNullOREmpty=\u5c5e\u6027evolutionsIdentifiers\u304c\u5165\u529b\u3067\u7a7a\u307e\u305f\u306f\u30cc\u30eb\u3067\u3059
Error.EvolutionPhysicalIsNullOREmpty=\u5c55\u958b\u7269\u7406ID\u306e\u3046\u3061\u5c11\u306a\u304f\u3068\u30821\u3064\u304c\u5165\u529b\u3067\u7a7a\u307e\u305f\u306f\u30cc\u30eb\u3067\u3059
Error.AttributeDetaislRequiredIsNotPresent=\u5c5e\u6027detailsRequired\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeDetaislRequiredIsNotCorrect=\u5c5e\u6027detailsRequired\u306e\u5024\u304c\u7121\u52b9\u3067\u3059\u3002\u6709\u52b9\u306a\u5024\u306fYes\u307e\u305f\u306fNo\u3067\u3059
Error.MixEvolutionsNotAllowed=\u5165\u529b\u306b\u306f\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u5c55\u958b\u30bf\u30a4\u30d7\u306e\u6df7\u5408\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u5c55\u958b\u7269\u7406ID\u306e\u3046\u3061\u306e1\u3064\u306e\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044
Error.EvolutionsPIDNotValid=\u3053\u306e\u5c55\u958b\u7269\u7406ID\u306f\u7121\u52b9\u3067\u3059

Error.AttributeWorkUnderCompiledForm=\u5c5e\u6027workUnderCompiledForm\u304c\u5165\u529b\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059
Error.AttributeInstancePIDNotPresent=\u5c5e\u6027instancePID\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeInstancePIDNotValid=\u5c5e\u6027instancePID\u304c\u5165\u529b\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059
Error.AttributeEffectivityCompiledFormNotPresent=\u5c5e\u6027effectivityCompiledForm\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeEffectivityCompiledFormIsInvalid=\u5c5e\u6027effectivityCompiledForm\u304c\u5165\u529b\u3067\u30cc\u30eb\u3067\u3059
Error.AtleastOneModelPIDIsNullOREmpty=\u5165\u529b\u306e\u30e2\u30c7\u30eb\u7269\u7406ID\u306e\u3046\u3061\u5c11\u306a\u304f\u3068\u30821\u3064\u304c\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059
Error.RefORInstOrCAOrACShouldBePresent=\u5165\u529b\u306b\u306f\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3001\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u3001\u307e\u305f\u306f\u30aa\u30fc\u30b5\u30ea\u30f3\u30b0\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u3044\u305a\u308c\u304b\u304c\u5fc5\u8981\u3067\u3059
Error.AttributeVersionReferencePIDNotPresent=\u5c5e\u6027referencePID\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093
Error.AttributeVersionReferencePIDNotInvalid=\u5c5e\u6027referencePID\u304c\u5165\u529b\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059
Error.xRevision.CannotCreateXRevGraphModelAttached=\u3053\u306e\u53c2\u7167\u306b\u306f\u3059\u3067\u306b\u30e2\u30c7\u30eb\u304c\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u306e\u53c2\u7167\u306eXRevision\u30b0\u30e9\u30d5\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=\u3059\u3067\u306b\u30bd\u30fc\u30b9\u53c2\u7167\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305fXRevision\u30b0\u30e9\u30d5\u304c\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u53c2\u7167\u306eXRevision\u30b0\u30e9\u30d5\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=\u30bd\u30fc\u30b9\u53c2\u7167\u306b\u30e2\u30c7\u30eb\u304c\u3059\u3067\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u306e\u53c2\u7167\u306eXRevision\u30b0\u30e9\u30d5\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093

Error.xRevision.xRevGraphAlreadyHasScope=\u3053\u306e\u53c2\u7167\u306eXRevision\u30b0\u30e9\u30d5\u306b\u306f\u3059\u3067\u306b\u6709\u52b9\u7bc4\u56f2\u304c\u3042\u308a\u307e\u3059
Error.xRevision.xRevGraphHasNoScopeToDelete=\u3053\u306e\u53c2\u7167\u306exRevision\u30b0\u30e9\u30d5\u306b\u306f\u3001\u524a\u9664\u3067\u304d\u308b\u6709\u52b9\u7bc4\u56f2\u304c\u3042\u308a\u307e\u305b\u3093
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=\u3053\u306e\u53c2\u7167\u306exRevision\u30b0\u30e9\u30d5\u306b\u306f\u5272\u5f53\u3066\u304c\u3042\u308b\u305f\u3081\u3001\u6709\u52b9\u7bc4\u56f2\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093

Error.InvalidInstancePID=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u7269\u7406ID\u306f\u7121\u52b9\u3067\u3059

Error.FailedToDisableCriteria=\u69cb\u6210\u6e08\u307f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u6761\u4ef6\u3092\u7121\u52b9\u5316\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u30021\u3064\u307e\u305f\u306f\u8907\u6570\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u6709\u52b9\u6027\u3067 <CriteriaName> \u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059
Criteria.Date=\u65e5\u4ed8
Criteria.ManufacturingPlans=\u88fd\u9020\u8a08\u753b
Criteria.Unit=\u5358\u4f4d
Criteria.FeatureOption=\u30d0\u30ea\u30a2\u30f3\u30c8\u304a\u3088\u3073\u30aa\u30d7\u30b7\u30e7\u30f3
Criteria.ModelVersion=\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3

Warning.InstanceNotFilterable=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u6709\u52b9\u6027\u5f0f\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
Warning.NotPossibleExtendOnThisInstance=\u3059\u3079\u3066\u306e\u5c55\u958b\u3067\u3059\u3067\u306b\u5229\u7528\u53ef\u80fd\u306a\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u62e1\u5f35\u64cd\u4f5c\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093
Error.ExtendFailedOnThisInstance=\u62e1\u5f35\u64cd\u4f5c\u306f\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093
Error.InvalidPhysicalPID=\u3053\u306e\u7269\u7406ID\u306f\u7121\u52b9\u3067\u3059

Cfg.Error.ErrorMissingParameterInWebService=\u30d1\u30e9\u30e1\u30fc\u30bf <key> \u304c\u3042\u308a\u307e\u305b\u3093\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u884c\u3046\u969b\u306b\u306f\u3001\u5fc5\u8981\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u3059\u3079\u3066\u542b\u3081\u3066\u304f\u3060\u3055\u3044
Cfg.Error.ErrorIncorrectParameterValueInWebService=<key> \u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u5024\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u884c\u3046\u969b\u306b\u306f\u3001\u6709\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u5024\u3092\u542b\u3081\u3066\u304f\u3060\u3055\u3044
Cfg.Error.ErrorIncorrectArraySizeInWebService=\u914d\u5217 <key> \u306e\u30b5\u30a4\u30ba\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u884c\u3046\u969b\u306b\u306f\u3001\u5fc5\u305a\u3053\u306e\u914d\u5217\u3092\u6b63\u3057\u3044\u30b5\u30a4\u30ba\u306b\u3057\u3066\u304f\u3060\u3055\u3044
Cfg.Error.ErrorExactlyOneParameterRequired=<key> \u306b\u5bfe\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u7d44\u307f\u5408\u308f\u305b\u304c\u7121\u52b9\u3067\u3059\u3002\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u884c\u3046\u969b\u306b\u306f\u3001\u5fc5\u8981\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u3046\u30611\u3064\u306e\u307f\u3092\u6307\u5b9a\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044
Cfg.Error.ErrorInvalidPayloadInWebService=\u8981\u6c42\u30da\u30a4\u30ed\u30fc\u30c9\u306f\u60f3\u5b9a\u3055\u308c\u3066\u3044\u308b\u30b9\u30ad\u30fc\u30de\u307e\u305f\u306f\u5f62\u5f0f\u306b\u9069\u5408\u3057\u307e\u305b\u3093\u3002\u69cb\u9020\u3001\u30c7\u30fc\u30bf\u30bf\u30a4\u30d7\u3001\u5fc5\u9808\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044

Error.xRevision.NotPossibleToAttachScopes=\u5165\u529b\u5185\u306e\u53c2\u7167\u306e\u5c11\u306a\u304f\u3068\u30821\u3064\u306b\u6709\u52b9\u7bc4\u56f2\u3092\u95a2\u9023\u4ed8\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002xRevision\u30b0\u30e9\u30d5\u304c\u3053\u306e\u53c2\u7167\u306b\u306f\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3067\u3059

Error.ConfigFilterNotFoundOnReference=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002\u5165\u529b\u3057\u305f\u69cb\u6210\u30d5\u30a3\u30eb\u30bf\u304c\u53c2\u7167\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u898b\u3064\u304b\u3089\u306a\u3044\u305f\u3081\u3067\u3059
Error.InstanceAlreadyHasStaticMapping=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u3059\u3067\u306b\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u304c\u3042\u308b\u305f\u3081\u3067\u3059

Error.NotAccessibleObject=\u3053\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u3067\u306f\u306a\u304f\u306a\u3063\u305f\u304b\u3001\u524a\u9664\u3055\u308c\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059
Error.DoesNotExistObject=\u9078\u629e\u3057\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u5b58\u5728\u3057\u307e\u305b\u3093

Error.ConfigFilterIsTooMature=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002\u5165\u529b\u3057\u305f\u69cb\u6210\u30d5\u30a3\u30eb\u30bf\u304c\u5ec3\u7248\u30b9\u30c6\u30fc\u30c8\u306b\u3042\u308b\u305f\u3081\u3067\u3059

Error.ModelVersionAlreadyAttach=\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u3059\u3067\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u30e2\u30c7\u30eb\u3092\u95a2\u9023\u4ed8\u3051\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093

Error.xRevision.RefDoesNotHaveXRevGraph=\u6709\u52b9\u7bc4\u56f2\u3068\u3057\u3066\u95a2\u9023\u4ed8\u3051\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u5165\u529b\u5185\u306e\u53c2\u7167\u306e1\u3064\u306b\u3001xRevision\u30b0\u30e9\u30d5\u304c\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u305b\u3093
Error.xRevision.ErrorNoXGraphFoundForReference=\u5165\u529b\u3067\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u306b\u3001\u305d\u306e\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308bxRevision\u30b0\u30e9\u30d5\u304c\u3042\u308a\u307e\u305b\u3093
