#
#   ConfigurationStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program


Effectivity.Alert.FlagNotExistInDB=L'indicateur n'existe pas dans la base de donn\u00e9es.
Effectivity.Alert.FlagDisabledInDB=L'indicateur existe dans la base de donn\u00e9es et est d\u00e9sactiv\u00e9.
Effectivity.Alert.FlagEnabledInDB=L'indicateur existe dans la base de donn\u00e9es et est activ\u00e9.
Effectivity.Alert.FilterableERTypesNotExistInDB=Les types d'ER filtrables n'existent pas dans la base de donn\u00e9es.
Effectivity.Alert.FilterableERTypesFoundInDB=Types d'ER filtrables trouv\u00e9s dans la base de donn\u00e9es.

Error.AlreadyAttached=AVERTISSEMENT : le mod\u00e8le avec l'identifiant "<ModelID>" est d\u00e9j\u00e0 attach\u00e9 \u00e0 la r\u00e9f\u00e9rence.
Error.AlreadyDetached=AVERTISSEMENT : le mod\u00e8le avec l'identifiant "<ModelID>" est d\u00e9j\u00e0 d\u00e9tach\u00e9.
Error.AlreadyAttachedMV=AVERTISSEMENT : la version du mod\u00e8le avec l'identifiant "<ModelVersionID>" est d\u00e9j\u00e0 attach\u00e9e \u00e0 la r\u00e9f\u00e9rence !
Error.AlreadyDetachedMV=AVERTISSEMENT : la version du mod\u00e8le avec l'identifiant "<ModelVersionID>" est d\u00e9j\u00e0 d\u00e9tach\u00e9e !

Error.TypeNotAModel=n'est pas un type de mod\u00e8le
Error.InternalServerError=erreur interne
Error.ObjectNotFound=introuvable
Error.XCADConfigurationNotPossible=structures de produit ne peuvent \u00eatre configur\u00e9es.

Error.DetachNotPossible.ConfigurationUsage=Impossible de d\u00e9tacher le mod\u00e8le, car il est utilis\u00e9 par une configuration
Error.DetachNotPossible.EffectivityUsage=Impossible de d\u00e9tacher le mod\u00e8le, car il est utilis\u00e9 par une expression d'effectivit\u00e9
Error.DetachNotPossible.ConfigurationRevision=Impossible de d\u00e9tacher le mod\u00e8le, car la r\u00e9f\u00e9rence poss\u00e8de des r\u00e9visions de configuration
Error.DetachNotPossible.ConfigRevision=Impossible de d\u00e9tacher le mod\u00e8le, car la r\u00e9f\u00e9rence poss\u00e8de des r\u00e9visions de configuration

Error.Unset.NoEffectivity=Cette instance n'a pas d'effectivit\u00e9, l'annulation est inutile
Error.Unset.Domain.Forbidden=Ce domaine d'entr\u00e9e est interdit
Error.Unset.Instance.Controlled.Change=L'instance d'entr\u00e9e est contr\u00f4l\u00e9e par une modification
Error.Unset.NoEffectivity.ForDomain=Cette instance n'a pas d'effectivit\u00e9 pour ce domaine

Effectivity.Alert.DisableEditVariantInWebAppFlagNotExistInDB=L'indicateur n'existe pas dans la base de donn\u00e9es.
Effectivity.Alert.DisableEditVariantInWebAppFlagFoundInDB=L'indicateur existe dans la base de donn\u00e9es.

Error.SetEffectivity.CriteriaNotEnabled=Le crit\u00e8re n'est pas activ\u00e9 sur la r\u00e9f\u00e9rence parent.
Error.SetEffectivity.IncorrectEffectivityXML=L'expression d'effectivit\u00e9 ou les donn\u00e9es d'entr\u00e9e utilis\u00e9es dans l'expression ne sont pas correctes.
Error.SetEffectivity.InvalidInstancePhysicalID=L'identifiant de l'instance d'entr\u00e9e n'est pas valide ou correct.
Error.SetEffectivity.LoadDictionaryFailed=Impossible de d\u00e9finir l'effectivit\u00e9 en raison des donn\u00e9es de dictionnaire. 
Error.SetEffectivity.3DPartNotConfigurable=La r\u00e9f\u00e9rence racine est une pi\u00e8ce 3D qui n'est pas configurable. 
Error.SetEffectivity.XCADNotConfigurable=La r\u00e9f\u00e9rence racine est contr\u00f4l\u00e9e par XCAD, ce qui n'est pas configurable.
Error.SetEffectivity.ModelNotAccessibleORExist=Le mod\u00e8le fourni dans l'expression d'entr\u00e9e n'est pas accessible ou n'existe pas.
Error.SetEffectivity.NoModelFoundInExpression=L'expression d'entr\u00e9e n'est pas format\u00e9e correctement (aucun mod\u00e8le trouv\u00e9).
Error.SetEffectivity.CriteriaUsedInXMLNotEnabled=Le crit\u00e8re utilis\u00e9 dans l'expression d'entr\u00e9e n'est pas activ\u00e9 sur la r\u00e9f\u00e9rence parent.
Error.SetEffectivity.ErrorSaveEffectivities=Une erreur s'est produite lors de l'enregistrement des nouvelles effectivit\u00e9s.
Error.SetEffectivity.ErrorDueToUpdateConfigRevEff=Une erreur s'est produite lors de la mise \u00e0 jour des effectivit\u00e9s de r\u00e9vision de configuration.
Error.SetEffectivity.SetEffFailedDueFrozenEvolution=L'instance fait partie d'au moins une \u00e9volution distribu\u00e9e. La nouvelle expression d'\u00e9volution ne peut pas \u00eatre appliqu\u00e9e.
Error.SetEffectivity.ReferenceNotConfigurable=La r\u00e9f\u00e9rence parent n'est pas configurable.
Error.SetEffectivity.InstanceControlledByChange=L'instance d'entr\u00e9e est contr\u00f4l\u00e9e par une modification. L'effectivit\u00e9 d'\u00e9volution ne peut pas \u00eatre modifi\u00e9e.
Error.SetEffectivity.RootNotConfigured=La r\u00e9f\u00e9rence parent de la relation donn\u00e9e ne comporte pas de contexte de configuration.
Error.SetEffectivity.ModelNotAttached=Le mod\u00e8le fourni dans l'expression d'entr\u00e9e ne fait pas partie du contexte de configuration.
Error.SetEffectivity.NotAllNecessaryModelsAttached=Tous les mod\u00e8les n\u00e9cessaires ne sont pas attach\u00e9s \u00e0 la r\u00e9f\u00e9rence parent.
Error.SetEffectivity.InstControlledByChange=L'instance d'entr\u00e9e est contr\u00f4l\u00e9e par une modification. L'effectivit\u00e9 d'\u00e9volution ne peut pas \u00eatre modifi\u00e9e.
Error.SetEffectivity.FailureDuringOperation=Erreur d\u00e9tect\u00e9e lors de l'op\u00e9ration.
Error.SetEffectivity.SetEffFailedDueToFrozenCriteria=Impossible de d\u00e9finir l'expression car cela ajouterait ou enl\u00e8verait au moins un crit\u00e8re d'\u00e9volution fig\u00e9 pour les effectivit\u00e9s.
Error.SetEffectivity.SetVarFailedDueToAlreadyExistingCA=L'action de modification est d\u00e9j\u00e0 dans l'effectivit\u00e9 et d\u00e9finie comme n\u00e9gative.
Error.SetEffectivity.FailureDueToNoIntersection=Il n'existe aucune intersection entre la plage d'effectivit\u00e9 de l'instance et la plage du contexte de cr\u00e9ation.
Error.IsEffsCoverEffRange.FailureDuringOperation=Une erreur s'est produite lors de la v\u00e9rification de la couverture d'une plage d'effectivit\u00e9 d'\u00e9volution donn\u00e9e par les effectivit\u00e9s d'\u00e9volution.

Error.AttachCfgContext.FailedDueToMultipleMVs=L'association de plusieurs versions de mod\u00e8le \u00e0 un objet configurable n'est pas prise en charge. Actuellement, une seule version de mod\u00e8le peut \u00eatre associ\u00e9e.
Error.DetachCfgContext.CannotDetachUsedInEffectivity=Impossible de d\u00e9tacher le contexte de configuration, car il est utilis\u00e9 par une expression d'effectivit\u00e9.

Error.AttributeVersionNotPresent=L'attribut version obligatoire est absent de l'entr\u00e9e JSON.
Error.AttributeVersionIsInvalid=La valeur de l'attribut version n'est pas correcte dans l'entr\u00e9e. La valeur valide pour la version est 1.0.
Error.AttributeResourcesNotPresent=L'attribut resources obligatoire est absent de l'entr\u00e9e JSON.
Error.AttributeResourcesIsEmpty=L'attribut resources est nul ou vide dans l'entr\u00e9e.
Error.AttributeIdentifierNotPresent=L'attribut identifier obligatoire est absent de l'entr\u00e9e JSON.
Error.AttributeIdentifierIsEmpty=L'attribut identifier ne doit pas \u00eatre nul ou vide dans l'entr\u00e9e JSON.
Error.AttributeConfigFilterIdentifierNotPresent=L'attribut configFilterIdentifier obligatoire est absent de l'entr\u00e9e JSON.
Error.AttributeConfigFilterIdentifierIsEmpty=L'attribut configFilterIdentifier ne doit pas \u00eatre nul ou vide dans l'entr\u00e9e JSON.
Error.AttributeViewIsNotValid=La valeur de l'attribut view n'est pas correcte dans l'entr\u00e9e. Les valeurs valides pour l'affichage sont Courant ou Projet\u00e9.
Error.AttributeModeIsNotValid=La valeur de l'attribut mode n'est pas correcte dans l'entr\u00e9e. Les valeurs valides sont Strict ou 150 %.
Error.PhysicalIdIsInvalid=L'entr\u00e9e contient un ID physique d'instance non valide.
Error.NotTypeOfVPMInstance=L'entr\u00e9e contient un ID physique qui n'est pas un type d'instance.
Error.ConfigurationFilterPIDIsInvalid=L'entr\u00e9e contient un ID physique de filtre de configuration non valide.
Error.ConfigurationFilterTypeIsNotSupported=L'entr\u00e9e contient un type de filtre de configuration qui n'est pas pris en charge.
Error.InstanceDoesNotHaveStaticMapping=Impossible de mettre \u00e0 jour le mappage statique de l'instance, car cette instance n'en poss\u00e8de pas.

Error.AttributeModelPIDNotPresent=L'attribut modelPID obligatoire est absent de l'entr\u00e9e JSON.
Error.AttributeModelPIDIsEmpty=L'attribut modelPID est nul ou vide dans l'entr\u00e9e JSON.
Error.AttributeViewIsInvalid=La valeur de l'attribut view n'est pas valide. Les valeurs valides pour cet attribut sont Courant, Projet\u00e9 ou Tout.
Error.AttributeFormatIsInvalid=La valeur de l'attribut format n'est pas valide. Les valeurs valides pour cet attribut sont TXT ou XML.
Error.AttributeOccurrencesNotPresent=L'attribut occurrences obligatoire est absent de l'entr\u00e9e JSON.
Error.AttributeOccurrencesIsEmpty=L'attribut occurrences est nul ou vide dans l'entr\u00e9e JSON.

Error.FlagDoesNotExistInDatabase=L'indicateur n'existe pas dans la base de donn\u00e9es.
Error.FlagFoundInDatabase=L'indicateur existe dans la base de donn\u00e9es.

Error.xRevision.AttachScopeFailed=Une erreur s'est produite lors de l'association de la port\u00e9e \u00e0 cette r\u00e9f\u00e9rence.
Error.xRevision.DetachScopeFailed=Une erreur s'est produite lors de la dissociation de la port\u00e9e de cette r\u00e9f\u00e9rence.
Error.xRevision.AttachScopeFailedAsNoXRevGraphToReference=Impossible d'associer des port\u00e9es pour cette r\u00e9f\u00e9rence, car le graphique xRevision n'y est pas associ\u00e9.
Error.xRevision.DetachScopeFailedAsNoXRevGraphToReference=Impossible de dissocier des port\u00e9es de cette r\u00e9f\u00e9rence, car le graphique xRevision n'y est pas associ\u00e9.
Error.xRevision.EnableVariantCriteriaFailed=Impossible de d\u00e9finir des crit\u00e8res de variante pour cette r\u00e9f\u00e9rence, car aucune port\u00e9e n'y est associ\u00e9e.

Error.xRevision.ReferenceNotConfigurable=Cette r\u00e9f\u00e9rence ne peut pas \u00eatre configur\u00e9e.

Error.AttributeVersionIsNotPresent=L'attribut version n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.AttributeVersionIsNotCorrect=La valeur de l'attribut version n'est pas valide. La valeur valide pour cet attribut est 1.0.
Error.AttributeEvolutionIdentifiersIsNotPresent=L'attribut evolutionsIdentifiers n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.AttributeEvolutionIdentifiersIsNullOREmpty=L'attribut evolutionsIdentifiers est vide ou nul dans l'entr\u00e9e.
Error.EvolutionPhysicalIsNullOREmpty=Au moins un attribut evolution physicalid est vide ou nul dans l'entr\u00e9e.
Error.AttributeDetaislRequiredIsNotPresent=L'attribut detailsRequired n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.AttributeDetaislRequiredIsNotCorrect=La valeur de l'attribut detailsRequired n'est pas valide. La valeur valide pour cet attribut est Oui ou Non.
Error.MixEvolutionsNotAllowed=L'entr\u00e9e contient divers types d'\u00e9volution, ce qui n'est pas pris en charge. Veuillez s\u00e9lectionner un seul type d'attribut evolution physicalids.
Error.EvolutionsPIDNotValid=Cet attribut evolution physicalid n'est pas valide.

Error.AttributeWorkUnderCompiledForm=L'attribut workUnderCompiledForm est nul ou vide dans l'entr\u00e9e.
Error.AttributeInstancePIDNotPresent=L'attribut instancePID n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.AttributeInstancePIDNotValid=L'attribut instancePID est nul ou vide dans l'entr\u00e9e.
Error.AttributeEffectivityCompiledFormNotPresent=L'attribut effectivityCompiledForm n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.AttributeEffectivityCompiledFormIsInvalid=L'attribut effectivityCompiledForm est nul dans l'entr\u00e9e.
Error.AtleastOneModelPIDIsNullOREmpty=Au moins un des attributs Model physicalid dans l'entr\u00e9e est nul ou vide.
Error.RefORInstOrCAOrACShouldBePresent=L'un d'entre eux est requis dans l'entr\u00e9e (Instances, Action de modification ou Contexte de cr\u00e9ation).
Error.AttributeVersionReferencePIDNotPresent=L'attribut referencePID n'est pas pr\u00e9sent dans l'entr\u00e9e.
Error.AttributeVersionReferencePIDNotInvalid=L'attribut referencePID est nul ou vide dans l'entr\u00e9e.
Error.xRevision.CannotCreateXRevGraphModelAttached=Impossible de cr\u00e9er un graphique XRevision sur cette r\u00e9f\u00e9rence, car un mod\u00e8le y est d\u00e9j\u00e0 associ\u00e9.
Error.xRevision.CannotCreateXRevGraphNoXRevAttached=Impossible de cr\u00e9er un graphique XRevision sur cette r\u00e9f\u00e9rence, car aucun graphique xRevision n'est associ\u00e9 sur la r\u00e9f\u00e9rence source.
Error.xRevision.CannotCreateXRevGraphModelAttachedOnSourceRef=Impossible de cr\u00e9er un graphique XRevision sur cette r\u00e9f\u00e9rence, car un mod\u00e8le est d\u00e9j\u00e0 associ\u00e9 sur la r\u00e9f\u00e9rence source.

Error.xRevision.xRevGraphAlreadyHasScope=Le graphique xRevision sur cette r\u00e9f\u00e9rence a d\u00e9j\u00e0 une port\u00e9e.
Error.xRevision.xRevGraphHasNoScopeToDelete=Le graphique xRevision sur cette r\u00e9f\u00e9rence n'a pas de port\u00e9e \u00e0 supprimer.
Error.xRevision.xRevGraphHasAllocationCannotDeleteScope=Le graphique xRevision sur cette r\u00e9f\u00e9rence a des allocations, il est donc impossible de supprimer la port\u00e9e.

Error.InvalidInstancePID=Cet attribut instance physicalid n'est pas valide.

Error.FailedToDisableCriteria=Echec de la d\u00e9sactivation des crit\u00e8res sur les objets configur\u00e9s car une ou plusieurs instances peuvent avoir utilis\u00e9 <CriteriaName> dans l'effectivit\u00e9.
Criteria.Date=Date
Criteria.ManufacturingPlans=Plan de fabrication
Criteria.Unit=Unit\u00e9
Criteria.FeatureOption=Variantes et options
Criteria.ModelVersion=Version du mod\u00e8le

Warning.InstanceNotFilterable=L'instance ne prend pas en charge l'expression d'effectivit\u00e9.
Warning.NotPossibleExtendOnThisInstance=L'op\u00e9ration Etendre n'est pas possible sur une instance qui est d\u00e9j\u00e0 disponible pour toutes les \u00e9volutions.
Error.ExtendFailedOnThisInstance=L'op\u00e9ration Etendre n'est pas possible sur cette instance.
Error.InvalidPhysicalPID=Cet ID physique n'est pas valide.

Cfg.Error.ErrorMissingParameterInWebService=Param\u00e8tre <key> manquant. Veuillez inclure tous les param\u00e8tres requis lors de la cr\u00e9ation de la demande.
Cfg.Error.ErrorIncorrectParameterValueInWebService=Valeur de param\u00e8tre incorrecte pour <key>. Veuillez inclure une valeur de param\u00e8tre valide lors de la cr\u00e9ation de la demande.
Cfg.Error.ErrorIncorrectArraySizeInWebService=Taille incorrecte pour le tableau <key>. Veuillez vous assurer que ce tableau a la taille correcte lors de la cr\u00e9ation de la demande.
Cfg.Error.ErrorExactlyOneParameterRequired=Combinaison de param\u00e8tres non valide pour <key>. Veuillez vous assurer qu'exactement un des param\u00e8tres requis est fourni lors de la cr\u00e9ation de la demande.
Cfg.Error.ErrorInvalidPayloadInWebService=La charge utile de la requ\u00eate n'est pas conforme au sch\u00e9ma ou au format attendu. Veuillez v\u00e9rifier la structure, les types de donn\u00e9es et les champs obligatoires.

Error.xRevision.NotPossibleToAttachScopes=Impossible d'associer une port\u00e9e pour au moins une des r\u00e9f\u00e9rences en entr\u00e9e, car le graphique xRevision n'y est pas associ\u00e9.

Error.ConfigFilterNotFoundOnReference=Impossible de cr\u00e9er un mappage statique sur une instance, car aucun filtre de configuration d'entr\u00e9e n'a \u00e9t\u00e9 trouv\u00e9 sur un objet de r\u00e9f\u00e9rence.
Error.InstanceAlreadyHasStaticMapping=Impossible de cr\u00e9er un mappage statique sur une instance, car cette instance poss\u00e8de d\u00e9j\u00e0 un mappage statique.

Error.NotAccessibleObject=Ce contenu n'est plus accessible ou a peut-\u00eatre \u00e9t\u00e9 supprim\u00e9.
Error.DoesNotExistObject=L'objet s\u00e9lectionn\u00e9 n'existe pas.

Error.ConfigFilterIsTooMature=Impossible de cr\u00e9er un mappage statique sur une instance, car le filtre de configuration d'entr\u00e9e est \u00e0 l'\u00e9tat obsol\u00e8te.

Error.ModelVersionAlreadyAttach=Impossible d'ajouter ce mod\u00e8le quand une version du mod\u00e8le est d\u00e9j\u00e0 associ\u00e9e.

Error.xRevision.RefDoesNotHaveXRevGraph=Aucun graphique xRevision n'est associ\u00e9 \u00e0 celui de la r\u00e9f\u00e9rence en entr\u00e9e qui est utilis\u00e9 pour associer en tant que port\u00e9e.
Error.xRevision.ErrorNoXGraphFoundForReference=La r\u00e9f\u00e9rence donn\u00e9e en entr\u00e9e n'a pas de graphique xRevision joint.
