<meta charset=UTF-8/>
ECMBusinessLogicResources.Alias=\u5909\u66f4\u7ba1\u7406\u30ea\u30bd\u30fc\u30b9
ECMBusinessLogicResources.Description=\u5909\u66f4\u7ba1\u7406\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3(\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af)\u306b\u5fc5\u8981\u306a\u30ea\u30bd\u30fc\u30b9\u306e\u5b9a\u7fa9

AreCAStandaloneAllowed.Alias=\u30b9\u30bf\u30f3\u30c9\u30a2\u30ed\u30f3\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u304b
AreCAStandaloneAllowed.Description=\u30b9\u30bf\u30f3\u30c9\u30a2\u30ed\u30f3\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u7121\u80fd\u5316\u307e\u305f\u306f\u7121\u52b9\u5316
AreCAStandaloneAllowed.Validation.Alias=\u8a31\u53ef\u3092\u5236\u5fa1\u3059\u308b\u30d6\u30fc\u30eb\u578b

ApprovalSchemaInitialization.Alias=\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u627f\u8a8d\u30b9\u30ad\u30fc\u30de\u306e\u5b9a\u7fa9\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af
ApprovalSchemaInitialization.Description=\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u306e\u627f\u8a8d\u30b9\u30ad\u30fc\u30de\u3092\u5b9a\u7fa9\u304a\u3088\u3073\u591a\u91cd\u5b9a\u7fa9\u3059\u308b\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af
ApprovalSchemaInitialization.ChangeAction.Alias=\u627f\u8a8d\u306e\u305f\u3081\u306b\u30b9\u30c6\u30fc\u30c8\u30a2\u30c3\u30d7\u3055\u308c\u305f\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3
ApprovalSchemaInitialization.ImpactedObjects.Alias=\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u306b\u3088\u3063\u3066\u5f71\u97ff\u3092\u53d7\u3051\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30ea\u30b9\u30c8
ApprovalSchemaInitialization.Approvers.Alias=\u5909\u66f4\u30a2\u30af\u30b7\u30e7\u30f3\u306e\u660e\u793a\u7684\u627f\u8a8d\u8005\u3068\u3057\u3066\u5b9a\u7fa9\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc
ApprovalSchemaInitialization.ComputedApprovalSchema.Alias=\u51fa\u529b\u627f\u8a8d\u30b9\u30ad\u30fc\u30de

ApprovalSchemaInitializationForChangeRequest.Alias=\u5909\u66f4\u30ea\u30af\u30a8\u30b9\u30c8\u627f\u8a8d\u30b9\u30ad\u30fc\u30de\u306e\u5b9a\u7fa9\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af
ApprovalSchemaInitializationForChangeRequest.Description=\u5909\u66f4\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u627f\u8a8d\u30b9\u30ad\u30fc\u30de\u3092\u5b9a\u7fa9\u304a\u3088\u3073\u591a\u91cd\u5b9a\u7fa9\u3059\u308b\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af
ApprovalSchemaInitializationForChangeRequest.ChangeRequest.Alias=\u627f\u8a8d\u306e\u305f\u3081\u306b\u30b9\u30c6\u30fc\u30c8\u30a2\u30c3\u30d7\u3055\u308c\u305f\u5909\u66f4\u30ea\u30af\u30a8\u30b9\u30c8
ApprovalSchemaInitializationForChangeRequest.ComputedApprovalSchema.Alias=\u51fa\u529b\u627f\u8a8d\u30b9\u30ad\u30fc\u30de

ApprovalSchemaInitializationForChangeOrder.Alias=\u5909\u66f4\u6307\u793a\u627f\u8a8d\u30b9\u30ad\u30fc\u30de\u306e\u5b9a\u7fa9\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af
ApprovalSchemaInitializationForChangeOrder.Description=\u5909\u66f4\u6307\u793a\u306e\u627f\u8a8d\u30b9\u30ad\u30fc\u30de\u3092\u5b9a\u7fa9\u304a\u3088\u3073\u591a\u91cd\u5b9a\u7fa9\u3059\u308b\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af
ApprovalSchemaInitializationForChangeOrder.ChangeOrder.Alias=\u627f\u8a8d\u306e\u305f\u3081\u306b\u30b9\u30c6\u30fc\u30c8\u30a2\u30c3\u30d7\u3055\u308c\u305f\u5909\u66f4\u6307\u793a
ApprovalSchemaInitializationForChangeOrder.ComputedApprovalSchema.Alias=\u51fa\u529b\u627f\u8a8d\u30b9\u30ad\u30fc\u30de

ECM_DependencyEstablishment.Alias=\u4f9d\u5b58\u95a2\u4fc2\u3001\u5171\u5b58\u95a2\u4fc2\u3001\u30d5\u30ed\u30fc\u30c0\u30a6\u30f3\u306e\u78ba\u7acb
ECM_DependencyEstablishment.Description=\u4f9d\u5b58\u95a2\u4fc2\u3001\u5171\u5b58\u95a2\u4fc2\u3001\u30d5\u30ed\u30fc\u30c0\u30a6\u30f3\u306e\u78ba\u7acb\u3092\u691c\u8a3c\u3059\u308b\u305f\u3081\u306e\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af
ECM_DependencyEstablishment.FromObject.Alias=\u3053\u306e\u30ea\u30f3\u30af\u306e\u30a2\u30c3\u30d7\u30b9\u30c8\u30ea\u30fc\u30e0\u30aa\u30d6\u30b8\u30a7\u30af\u30c8
ECM_DependencyEstablishment.ToObject.Alias=\u3053\u306e\u30ea\u30f3\u30af\u306e\u30c0\u30a6\u30f3\u30b9\u30c8\u30ea\u30fc\u30e0\u30aa\u30d6\u30b8\u30a7\u30af\u30c8
ECM_DependencyEstablishment.KindOfLink.Alias=\u5171\u5b58\u95a2\u4fc2\u3001\u4f9d\u5b58\u95a2\u4fc2\u3001\u30d5\u30ed\u30fc\u30c0\u30a6\u30f3\u306e\u4e2d\u306e\u30ea\u30f3\u30af\u306e\u30bb\u30de\u30f3\u30c6\u30a3\u30c3\u30af
ECM_DependencyEstablishment.UserDefined.Alias=\u30ea\u30f3\u30af\u304c\u660e\u793a\u7684\u306b\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u30ea\u30af\u30a8\u30b9\u30c8\u3055\u308c\u305f\u304b\u3069\u3046\u304b\u3092\u793a\u3059\u30d6\u30fc\u30eb\u578b(\u4f9d\u5b58\u95a2\u4fc2\u3092\u6301\u3063\u305f\u59d4\u8b72\u306e\u5834\u5408\u306f\u507d)
