Generic.InvalidPhid= \uc120\ud0dd\ud55c \uac1c\uccb4\uc5d0 \uc561\uc138\uc2a4\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc798\ubabb\ub41c ID\uc785\ub2c8\ub2e4.
Generic.MissingArgument= \uc694\uccad\uc774 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc778\uc218\uac00 \ub204\ub77d\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
Generic.InvalidParameters= \uc120\ud0dd\ud55c \uac1c\uccb4\ub97c \uc774 \ub300\uc0c1\uc5d0 \ubd99\uc5ec\ub123\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. 
Generic.BNDestination= \uac80\uc0c9 \ub178\ub4dc\ub97c \uac80\uc0c9 \uad6c\uc870 \uc139\uc158 \uc544\ub798 \ubd99\uc5ec\ub123\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Generic.BSDestination= \uac80\uc0c9 \uad6c\uc870\ub294 \uac80\uc0c9 \uad6c\uc870 \uc139\uc158 \uc544\ub798\uc5d0\ub9cc \ubd99\uc5ec\ub123\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4.

Expand.LevelToLow= \ud655\uc7a5 \ub808\ubca8\uc740 0 \ubbf8\ub9cc\uc77c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Copy.MaxReached= \uac80\uc0c9 \uad6c\uc870 \uc218\uac00 \uc2b9\uc778\ub41c \ud55c\ub3c4\uc5d0 \ub3c4\ub2ec\ud588\uc2b5\ub2c8\ub2e4. \ubcf5\uc0ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Copy.ErrorExist= \ubcf5\uc0ac\ub41c \uac80\uc0c9 \ub178\ub4dc \uc774\ub984 \uc911 \ud558\ub098 \uc774\uc0c1\uc774 \uac80\uc0c9 \uad6c\uc870 \uacc4\uce35\uc5d0 \uc788\uc2b5\ub2c8\ub2e4. \ubcf5\uc0ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Copy.Generic= \ubcf5\uc0ac \ubc0f \ubd99\uc5ec\ub123\uae30 \uc911\uc5d0 \ub0b4\ubd80 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4. \uad00\ub9ac\uc790\uc5d0\uac8c \ubb38\uc758\ud558\uc2ed\uc2dc\uc624.
Copy.ExistingBS= \uac80\uc0c9 \uad6c\uc870\ub97c \ubcf5\uc0ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uac19\uc740 \uc81c\ubaa9\uc758 \uac80\uc0c9 \uad6c\uc870\uac00 \uc774\ubbf8 \uc788\uc2b5\ub2c8\ub2e4.

New.ErrorTitle= \uc0dd\uc131 \uc2e4\ud328
New.ErrorBN= \uac80\uc0c9 \ub178\ub4dc \uc0dd\uc131\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4. 
New.BNMissingParent= \uc0dd\uc131 \uc694\uccad\uc774 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uac80\uc0c9 \ub178\ub4dc\ub294 \uc0c1\uc704 \ub178\ub4dc \uc5c6\uc774 \uc0dd\uc131\ub420 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
New.InvalidTitle= \uac1c\uccb4 \uc81c\ubaa9\uc5d0\ub294 \uacf5\ubc31\ub9cc \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
New.CreationBSOKButConversionFailed= \uac80\uc0c9 \uad6c\uc870\uac00 \uc0dd\uc131\ub418\uc5c8\uc9c0\ub9cc \uc11c\ubc84\uc5d0\uc11c \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
New.CreationBNOKButConversionFailed= \uac80\uc0c9 \ub178\ub4dc\uac00 \uc0dd\uc131\ub418\uc5c8\uc9c0\ub9cc \uc11c\ubc84\uc5d0\uc11c \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
New.NameComputation= \uc0dd\uc131 \uc2dc \uacc4\uc0b0\ub428
New.MaxReachedTitle= \uac80\uc0c9 \uad6c\uc870\ub97c \uc0dd\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
New.MaxReached= \uac80\uc0c9 \uad6c\uc870 \uc218\uac00 \uc2b9\uc778\ub41c \ud55c\ub3c4\uc5d0 \ub3c4\ub2ec\ud588\uc2b5\ub2c8\ub2e4.
New.CreateBSError= \ub2e4\uc74c \uac1c\uccb4\ub97c \uc0dd\uc131\ud560 \uc218 \uc5c6\uc74c: \uac80\uc0c9 \uad6c\uc870
New.CreateBNError= \ub2e4\uc74c \uac1c\uccb4\ub97c \uc0dd\uc131\ud560 \uc218 \uc5c6\uc74c: \uac80\uc0c9 \ub178\ub4dc
New.CreateErrorAccessSub= \uc62c\ubc14\ub978 \uc790\uaca9\uc99d\uba85\uc744 \uc0ac\uc6a9\ud558\uace0 \uc788\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
New.CreateErrorAccessMsg= \uc774 \uc720\ud615\uc758 \uac1c\uccb4\ub97c \uc0dd\uc131\ud558\ub294 \ub370 \ub300\uc0c1 \ud611\uc5c5 \uacf5\uac04\uc5d0 \ud544\uc694\ud55c \uc561\uc138\uc2a4 \uc5ed\ud560\uc774 \uc5c6\uc744 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.
New.NoAccessOnParent= \ub300\uc0c1 \ud611\uc5c5 \uacf5\uac04\uc5d0\uc11c \uc120\ud0dd\ud55c \uac1c\uccb4 \uc544\ub798\uc5d0 \uac80\uc0c9 \ub178\ub4dc\ub97c \uc0dd\uc131\ud558\ub294 \ub370 \ud544\uc694\ud55c \uc9c1\ubb34\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
New.notEnoughRights= \uc0c8 \uac80\uc0c9 \ub178\ub4dc \ub610\ub294 \uac80\uc0c9 \uad6c\uc870\ub97c \uc791\uc131\ud560 \uc218 \uc788\ub294 \uad8c\ud55c\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
New.TitleUniqueness= \uac80\uc0c9 \ub178\ub4dc\ub97c \uc0dd\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc81c\ubaa9 {attValue}\uc774(\uac00) \uc0c1\uc704 \uac80\uc0c9 \uad6c\uc870\uc5d0\uc11c \uc774\ubbf8 \uc0ac\uc6a9\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
New.TitlePrefix.Term= \uac80\uc0c9 \ub178\ub4dc
New.TitlePrefix.Terminology= \uac80\uc0c9 \uad6c\uc870
New.ParentReleased= \uac80\uc0c9 \ub178\ub4dc\ub97c \uc0dd\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc0c1\uc704 \uac80\uc0c9 \uad6c\uc870\uac00 \ub3d9\uacb0\ub428 \ub610\ub294 \ub9b4\ub9ac\uc988\ub428 \uc0c1\ud0dc\uc785\ub2c8\ub2e4. 

dsbsd.Error.TermUniqueness= \uac1c\uccb4\ub294 \ub3d9\uc77c\ud55c \uac80\uc0c9 \uad6c\uc870\uc758 \uc5ec\ub7ec \ub178\ub4dc\uc5d0 \uc5f0\uacb0\ub420 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
dsbsd.Error.BSNotReleased= \uac1c\uccb4\ub294 \ub9b4\ub9ac\uc988\ub41c \uac80\uc0c9 \uad6c\uc870\uc5d0\ub9cc \uc5f0\uacb0\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
expand.tooManyToExpand= \ub108\ubb34 \ub9ce\uc740 \uac80\uc0c9 \ud56d\ubaa9\uc774 \uac80\uc0c9\ub418\uc5c8\uc73c\ubbc0\ub85c \uac80\uc0c9 \ud56d\ubaa9\uc744 \ud655\uc7a5\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ubaa8\ub450 \ucd95\uc18c\ud558\uace0 \ud55c \ub808\ubca8\ub9cc \ud655\uc7a5\ud558\uc2ed\uc2dc\uc624.
expand.overflow= \ud655\uc7a5\ud574\uc57c \ud560 \uac80\uc0c9 \ud56d\ubaa9\uc774 \ub108\ubb34 \ub9ce\uc2b5\ub2c8\ub2e4. \ud3bc\uce58\uae30 \ub808\ubca8\uc744 \uc120\ud0dd\ud558\uac70\ub098 \ud3bc\uce58\uae30 \uc804\uc5d0 \ubaa8\ub450 \ucd95\uc18c\ud558\uc2ed\uc2dc\uc624.
