Generic.InvalidPhid= Keine Zugriffsrechte auf ausgew\u00e4hlte Objekte. Ung\u00fcltige ID.
Generic.MissingArgument= Ung\u00fcltige Anfrage, Argument fehlt.
Generic.InvalidParameters= Die ausgew\u00e4hlten Objekte k\u00f6nnen nicht in dieses Ziel eingef\u00fcgt werden. 
Generic.BNDestination= Zu durchsuchende Knoten k\u00f6nnen nicht in den Abschnitt 'Zu durchsuchende Strukturen' kopiert werden.
Generic.BSDestination= Zu durchsuchende Struktur kann nur in den Abschnitt 'Zu durchsuchende Struktur' kopiert werden.

Expand.LevelToLow= Erweiterungsebene darf nicht unter 0 liegen.
Copy.MaxReached= Die Anzahl der zu durchsuchenden Strukturen hat die maximal zul\u00e4ssige Anzahl erreicht. Kopieren unm\u00f6glich.
Copy.ErrorExist= Mindestens eine Kopie des zu durchsuchenden Knotennamens liegt in der zu durchsuchenden Strukturen-Hierarchie vor. Kopieren unm\u00f6glich.
Copy.Generic= Beim Kopieren/Einf\u00fcgen ist ein interner Fehler aufgetreten. Wenden Sie sich an Ihren Administrator.
Copy.ExistingBS= Zu durchsuchende Struktur kann nicht kopiert werden. Eine zu durchsuchende Struktur mit dem geleichen Titel existiert bereits.

New.ErrorTitle= Erstellung fehlschlagen
New.ErrorBN= Erstellung des zu durchsuchenden Knotens fehlgeschlagen. 
New.BNMissingParent= Erstellungsanfrage ung\u00fcltig. Zu durchsuchende Knoten k\u00f6nnen nicht ohne \u00fcbergeordnetes Objekt erstellt werden.
New.InvalidTitle= Der Titel des Objekts darf nicht nur Leerzeichen enthalten
New.CreationBSOKButConversionFailed= Zu durchsuchende Struktur wurde erfolgreich erstellt, aber auf dem Server ist ein Fehler aufgetreten
New.CreationBNOKButConversionFailed= Zu durchsuchender Knoten wurde erfolgreich erstellt, aber auf dem Server ist ein Fehler aufgetreten
New.NameComputation= Bei Erstellung berechnet
New.MaxReachedTitle= Die zu durchsuchende Struktur konnte nicht erstellt werden.
New.MaxReached= Die Anzahl der zu durchsuchenden Strukturen hat den H\u00f6chstwert erreicht.
New.CreateBSError= Sie k\u00f6nnen dieses Objekt nicht erstellen: zu durchsuchende Struktur
New.CreateBNError= Sie k\u00f6nnen dieses Objekt nicht erstellen: zu durchsuchender Knoten
New.CreateErrorAccessSub= Stellen Sie sicher, dass Sie die korrekten Anmeldedaten verwenden.
New.CreateErrorAccessMsg= M\u00f6glicherweise verf\u00fcgen Sie nicht \u00fcber die erforderliche Zugriffsrolle im Ziel-Teamarbeitsbereich, um diesen Objekttyp zu erstellen.
New.NoAccessOnParent= M\u00f6glicherweise verf\u00fcgen Sie nicht \u00fcber die erforderliche Zust\u00e4ndigkeit im Ziel-Teamarbeitsbereich, um diesen zu durchsuchenden Knoten unter dem ausgew\u00e4hlten Objekt zu erstellen.
New.notEnoughRights= Sie sind nicht berechtigt, einen neuen durchsuchenden Knoten oder eine neue durchsuchende Struktur zu erstellen.
New.TitleUniqueness= Durchsuchungsknoten kann nicht erstellt werden. Der Titel {attValue} wird bereits in der \u00fcbergeordneten Durchsuchungsstruktur verwendet.
New.TitlePrefix.Term= Durchsuchungsknoten
New.TitlePrefix.Terminology= Durchsuchungsstruktur
New.ParentReleased= Der zu durchsuchende Knoten kann nicht erstellt werden. Die \u00fcbergeordnete zu durchsuchende Struktur befindet sich im Stadium Eingefroren oder Freigegeben. 

dsbsd.Error.TermUniqueness= Das Objekt kann nicht mehrfachen Knoten derselben zu dursuchenden Struktur zugeordnet sein.
dsbsd.Error.BSNotReleased= Das Objekt kann nur mit einer ver\u00f6ffentlichten durchsuchenden Struktur verkn\u00fcpft werden.
expand.tooManyToExpand= Das zu durchsuchende Element kann nicht erweitert werden, da zu viele Lesezeichen abgerufen wurden. Blenden Sie diese alle aus und erweitern Sie nur eine Ebene.
expand.overflow= Zu viele zu durchsuchende Elemente m\u00fcssen erweitert werden. W\u00e4hlen Sie eine Erweiterungsebene aus oder blenden Sie alle aus, bevor Sie die Erweiterung vornehmen.
