Generic.InvalidPhid= \u9078\u629e\u3057\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002\u7121\u52b9\u306aID\u3067\u3059
Generic.MissingArgument= \u7121\u52b9\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3059\u3002\u5f15\u6570\u304c\u3042\u308a\u307e\u305b\u3093
Generic.InvalidParameters= \u9078\u629e\u3057\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u3053\u306e\u30b3\u30d4\u30fc\u5148\u306b\u30da\u30fc\u30b9\u30c8\u3067\u304d\u307e\u305b\u3093 
Generic.BNDestination= \u53c2\u7167\u30ce\u30fc\u30c9\u3092\u53c2\u7167\u69cb\u9020\u30bb\u30af\u30b7\u30e7\u30f3\u306e\u4e0b\u306b\u30da\u30fc\u30b9\u30c8\u3067\u304d\u307e\u305b\u3093
Generic.BSDestination= \u53c2\u7167\u69cb\u9020\u306f\u53c2\u7167\u69cb\u9020\u30bb\u30af\u30b7\u30e7\u30f3\u306e\u4e0b\u306b\u306e\u307f\u30da\u30fc\u30b9\u30c8\u3067\u304d\u307e\u3059

Expand.LevelToLow= \u5c55\u958b\u30ec\u30d9\u30eb\u306f0\u3088\u308a\u4e0b\u306b\u3067\u304d\u307e\u305b\u3093
Copy.MaxReached= \u53c2\u7167\u69cb\u9020\u306e\u6570\u304c\u627f\u8a8d\u3055\u308c\u305f\u5236\u9650\u306b\u9054\u3057\u307e\u3057\u305f\u3002\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093
Copy.ErrorExist= \u30b3\u30d4\u30fc\u3055\u308c\u305f\u53c2\u7167\u30ce\u30fc\u30c9\u540d\u304c\u5c11\u306a\u304f\u3068\u30821\u3064\u53c2\u7167\u69cb\u9020\u968e\u5c64\u306b\u5b58\u5728\u3057\u307e\u3059\u3002\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093
Copy.Generic= \u30b3\u30d4\u30fc\uff0f\u30da\u30fc\u30b9\u30c8\u4e2d\u306b\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044
Copy.ExistingBS= \u53c2\u7167\u69cb\u9020\u3092\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093\u3002\u540c\u3058\u30bf\u30a4\u30c8\u30eb\u306e\u53c2\u7167\u69cb\u9020\u304c\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059

New.ErrorTitle= \u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f
New.ErrorBN= \u53c2\u7167\u30ce\u30fc\u30c9\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f 
New.BNMissingParent= \u4f5c\u6210\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u7121\u52b9\u3067\u3059\u3002\u53c2\u7167\u30ce\u30fc\u30c9\u306f\u89aa\u306a\u3057\u306b\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
New.InvalidTitle= \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30bf\u30a4\u30c8\u30eb\u306b\u30b9\u30da\u30fc\u30b9\u306e\u307f\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
New.CreationBSOKButConversionFailed= \u53c2\u7167\u69cb\u9020\u306f\u6b63\u5e38\u306b\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30b5\u30fc\u30d0\u30fc\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
New.CreationBNOKButConversionFailed= \u53c2\u7167\u30ce\u30fc\u30c9\u306f\u6b63\u5e38\u306b\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30b5\u30fc\u30d0\u30fc\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
New.NameComputation= \u4f5c\u6210\u6642\u306b\u8a08\u7b97\u6e08\u307f
New.MaxReachedTitle= \u53c2\u7167\u69cb\u9020\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
New.MaxReached= \u53c2\u7167\u69cb\u9020\u306e\u6570\u304c\u627f\u8a8d\u3055\u308c\u305f\u5236\u9650\u306b\u9054\u3057\u307e\u3057\u305f
New.CreateBSError= \u3053\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\uff1a\u53c2\u7167\u69cb\u9020
New.CreateBNError= \u3053\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\uff1a\u53c2\u7167\u30ce\u30fc\u30c9
New.CreateErrorAccessSub= \u6b63\u3057\u3044\u8cc7\u683c\u60c5\u5831\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044
New.CreateErrorAccessMsg= \u3053\u306e\u30bf\u30a4\u30d7\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u30a2\u30af\u30bb\u30b9\u30ed\u30fc\u30eb\u304c\u30bf\u30fc\u30b2\u30c3\u30c8\u30b3\u30e9\u30dc\u30ec\u30fc\u30b7\u30e7\u30f3\u30b9\u30da\u30fc\u30b9\u306b\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059
New.NoAccessOnParent= \u9078\u629e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u4e0b\u306b\u53c2\u7167\u30ce\u30fc\u30c9\u3092\u4f5c\u6210\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u30ec\u30b9\u30dd\u30f3\u30b7\u30d3\u30ea\u30c6\u30a3\u304c\u30bf\u30fc\u30b2\u30c3\u30c8\u30b3\u30e9\u30dc\u30ec\u30fc\u30b7\u30e7\u30f3\u30b9\u30da\u30fc\u30b9\u306b\u3042\u308a\u307e\u305b\u3093
New.notEnoughRights= \u65b0\u3057\u3044\u53c2\u7167\u30ce\u30fc\u30c9\u3084\u53c2\u7167\u69cb\u9020\u3092\u4f5c\u6210\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093
New.TitleUniqueness= \u53c2\u7167\u30ce\u30fc\u30c9\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002\u30bf\u30a4\u30c8\u30eb\u300c{attValue}\u300d\u306f\u89aa\u53c2\u7167\u69cb\u9020\u306e\u4e0b\u3067\u3059\u3067\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059
New.TitlePrefix.Term= \u53c2\u7167\u30ce\u30fc\u30c9
New.TitlePrefix.Terminology= \u53c2\u7167\u69cb\u9020
New.ParentReleased= \u53c2\u7167\u30ce\u30fc\u30c9\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002\u89aa\u306e\u53c2\u7167\u69cb\u9020\u304c\u51cd\u7d50\u307e\u305f\u306f\u30ea\u30ea\u30fc\u30b9\u6e08\u307f\u30b9\u30c6\u30fc\u30c8\u306b\u3042\u308a\u307e\u3059 

dsbsd.Error.TermUniqueness= \u540c\u3058\u53c2\u7167\u69cb\u9020\u306e\u8907\u6570\u306e\u30ce\u30fc\u30c9\u306b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u30ea\u30f3\u30af\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
dsbsd.Error.BSNotReleased= \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u3001\u30ea\u30ea\u30fc\u30b9\u6e08\u307f\u53c2\u7167\u69cb\u9020\u306b\u306e\u307f\u30ea\u30f3\u30af\u3067\u304d\u307e\u3059
expand.tooManyToExpand= \u591a\u6570\u306e\u53c2\u7167\u9805\u76ee\u3092\u53d6\u5f97\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u53c2\u7167\u9805\u76ee\u3092\u5c55\u958b\u3067\u304d\u307e\u305b\u3093\u3002\u3059\u3079\u3066\u6298\u308a\u305f\u305f\u3093\u30671\u30ec\u30d9\u30eb\u306e\u307f\u5c55\u958b\u3057\u3066\u304f\u3060\u3055\u3044
expand.overflow= \u5c55\u958b\u3059\u308b\u53c2\u7167\u9805\u76ee\u304c\u591a\u3059\u304e\u307e\u3059\u3002\u5c55\u958b\u3059\u308b\u30ec\u30d9\u30eb\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u5c55\u958b\u3059\u308b\u524d\u306b\u3059\u3079\u3066\u6298\u308a\u305f\u305f\u3093\u3067\u304f\u3060\u3055\u3044
