Generic.InvalidPhid= No se puede acceder al objeto seleccionado. ID no v\u00e1lido.
Generic.MissingArgument= Solicitud no valida, falta un argumento.
Generic.InvalidParameters= No se pueden pegar los objetos seleccionados en este destino. 
Generic.BNDestination= No es posible pegar nodos de navegaci\u00f3n en la secci\u00f3n de estructuras de navegaci\u00f3n.
Generic.BSDestination= Solo se puede pegar la estructura de navegaci\u00f3n en la secci\u00f3n de estructuras de navegaci\u00f3n.

Expand.LevelToLow= El nivel de ampliaci\u00f3n no puede estar por debajo de 0.
Copy.MaxReached= El n\u00famero de estructuras de navegaci\u00f3n ha alcanzado el l\u00edmite autorizado. No se puede copiar.
Copy.ErrorExist= Al menos uno de los nombres de estructura de navegaci\u00f3n existe en la jerarqu\u00eda de estructuras de navegaci\u00f3n. No se puede copiar.
Copy.Generic= Se ha producido un error interno al copiar y pegar. Contacte con el administrador.
Copy.ExistingBS= No se puede copiar la estructura de navegaci\u00f3n. Ya existe una estructura de navegaci\u00f3n con ese nombre.

New.ErrorTitle= Error de creaci\u00f3n
New.ErrorBN= Error al crear el nodo de navegaci\u00f3n. 
New.BNMissingParent= La solicitud de creaci\u00f3n no es v\u00e1lida. No se puede crean un nodo sin un nodo principal.
New.InvalidTitle= El t\u00edtulo del objeto no puede contener solo espacios
New.CreationBSOKButConversionFailed= Se ha creado correctamente la estructura de navegaci\u00f3n, pero se ha producido un error en el servidor
New.CreationBNOKButConversionFailed= Se ha creado correctamente el nodo de navegaci\u00f3n, pero se ha producido un error en el servidor
New.NameComputation= Calculado al crear
New.MaxReachedTitle= No se puede crear la estructura de navegaci\u00f3n.
New.MaxReached= El n\u00famero de estructuras de navegaci\u00f3n ha alcanzado el l\u00edmite autorizado.
New.CreateBSError= No puede crear este objeto: estructura de navegaci\u00f3n
New.CreateBNError= No puede crear este objeto: nodo de navegaci\u00f3n
New.CreateErrorAccessSub= Compruebe que est\u00e1 utilizando las credenciales correctas.
New.CreateErrorAccessMsg= Es posible que no tenga la funci\u00f3n de acceso necesaria en el espacio de colaboraci\u00f3n de destino para crear este tipo de objeto.
New.NoAccessOnParent= Es posible que no disponga de la responsabilidad necesaria en el espacio de colaboraci\u00f3n de destino para crear un nodo de navegaci\u00f3n en el objeto seleccionado.
New.notEnoughRights= No est\u00e1 autorizado a crear un nuevo nodo de navegaci\u00f3n o estructura de navegaci\u00f3n.
New.TitleUniqueness= No se puede crear el nodo de navegaci\u00f3n. El t\u00edtulo {attValue} ya se utiliza bajo la estructura de navegaci\u00f3n principal.
New.TitlePrefix.Term= Nodo de exploraci\u00f3n
New.TitlePrefix.Terminology= Estructura de exploraci\u00f3n
New.ParentReleased= No se puede crear el nodo de exploraci\u00f3n. La estructura de exploraci\u00f3n principal est\u00e1 en estado Congelado o Emitido. 

dsbsd.Error.TermUniqueness= No es posible vincular el objeto a varios nodos de la misma estructura de navegaci\u00f3n.
dsbsd.Error.BSNotReleased= El objeto solo se puede vincular a una estructura de navegaci\u00f3n emitida.
expand.tooManyToExpand= El elemento de navegaci\u00f3n no se puede expandir puesto que se han recuperado demasiados elementos de navegaci\u00f3n. Contraiga todo y expanda solo un nivel.
expand.overflow= Hay muchos elementos de navegaci\u00f3n que expandir. Seleccione y expanda el nivel, o contraiga todo antes de expandir.
