#
#   ExpressionStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program

#   static const char RCSID[] = "$Id: ExpressionStringResource.properties.rca  $"
#

# --- General

General.Model= Model
General.ModelVersion= Wersja modelu

# Criteria
Criteria.Date= Data
Criteria.Products= Produkty
Criteria.ManufacturingPlans= Plany produkcyjne
Criteria.Unit= Jednostka
Criteria.Milestone= Kamie\u0144 milowy
Criteria.FeatureOption= Warianty i opcje


# --- Success

# Effectivity
Effectivity.Success.SetEvolutionOperationSuccess= Operacja ustawienia skuteczno\u015bci ewolucji zosta\u0142a pomy\u015blnie wykonana.


# --- Errors

Error.InternalServerError= b\u0142\u0105d wewn\u0119trzny

# General
General.Error.InvalidCategoryTypeSetting= Typ kategorii jest nieprawid\u0142owy. Sprawd\u017a, jakie ustawienia ma prawid\u0142owy typ kategorii.
General.Range.Error.SequenceValues= Polecenie Wstaw jako zakres wymaga jednej lub dw\u00f3ch warto\u015bci sekwencji. Liczba znalezionych warto\u015bci sekwencji: 
General.Range.Error.DatesValues= Polecenie Wstaw jako zakres wymaga jednej lub dw\u00f3ch dat. Liczba znalezionych warto\u015bci daty: 
General.Error.UnsupportedDateWithRelational= Nie mo\u017cna u\u017cywa\u0107 daty w po\u0142\u0105czeniu z relacyjnym typem skuteczno\u015bci. Usu\u0144 jeden typ skuteczno\u015bci z w\u0142a\u015bciwo\u015bci administracyjnej tej relacji lub typu.
General.Error.UnsupportedGlobalWithMultipleContexts= W jednym wyra\u017ceniu nie mo\u017cna po\u0142\u0105czy\u0107 globalnego kontekstu konfiguracji z innym kontekstem konfiguracji. Usu\u0144 globalny kontekst konfiguracji lub wszystkie pozosta\u0142e konteksty konfiguracji.
General.Error.TimeOut= Polecenie trwa\u0142o zbyt d\u0142ugo, \u017ceby pobra\u0107 wszystkie konieczne informacje. Spr\u00f3buj ponownie lub skontaktuj si\u0119 z administratorem w celu uzyskania pomocy.

# Criteria
Criteria.Error.UnsupportedCriteriaType= Typ kryteri\u00f3w jest nieobs\u0142ugiwany. Okre\u015bl obs\u0142ugiwany typ kryteri\u00f3w.
Criteria.Error.TypeNotAModel= nie jest typem modelu
Criteria.Error.TypeNotAModelVersion= nie jest typem wersji modelu
Criteria.Error.NoAccessToModel= jest modelem, do kt\u00f3rego u\u017cytkownik nie ma dost\u0119pu
Criteria.Error.DeletedObject= jest obiektem usuni\u0119tym

# Effectivity
Effectivity.Error.MismatchEffectivityTypesAndExpression_bus= Wyra\u017cenie skuteczno\u015bci zawiera pewne typy skuteczno\u015bci, kt\u00f3re nie zosta\u0142y zastosowane w tym obiekcie.
Effectivity.Error.NoEffectivityTypeFound= Nie znaleziono typu skuteczno\u015bci. U\u017cyj prawid\u0142owego typu skuteczno\u015bci okre\u015blonego w schemacie.
Effectivity.Error.EffectivityUsageCannotDelete= Obiekt jest u\u017cywany w wyra\u017ceniu skuteczno\u015bci, dlatego nie mo\u017cna go usun\u0105\u0107. Je\u017celi chcesz usun\u0105\u0107 obiekt, najpierw wykasuj go ze wszystkich wyra\u017ce\u0144 skuteczno\u015bci.
Effectivity.FalseExpression.Display= Nieprawid\u0142owy
Effectivity.TrueExpression.Display= Prawid\u0142owe
Effectivity.Error.OnlyEvolutionEffectivity= To wyst\u0105pienie ma ustawion\u0105 tylko skuteczno\u015b\u0107 w domenie Ewolucja.
Effectivity.Error.EffectivityUsageCannotRemoveObject= Obiekt <object_type> <object_name> jest u\u017cywany w skonfigurowanym wyra\u017ceniu (Filtr, Skuteczno\u015b\u0107 itp.), dlatego nie mo\u017cna go usun\u0105\u0107. Aby usun\u0105\u0107 obiekt, najpierw usu\u0144 kryteria ze wszystkich skonfigurowanych wyra\u017ce\u0144.
Effectivity.Error.EffectivityUsageCannotModifyObject= Obiekt <object_type> <object_name> jest u\u017cywany w skonfigurowanym wyra\u017ceniu (Filtr, Skuteczno\u015b\u0107 itp.), dlatego nie mo\u017cna go zmodyfikowa\u0107. Je\u017celi chcesz zmodyfikowa\u0107 obiekt, najpierw wykasuj kryteria ze wszystkich skonfigurowanych wyra\u017ce\u0144.
Effectivity.Error.ChangeApplicabilityAndEffectivitieDoNotIntersect= Nie mo\u017cna zmodyfikowa\u0107 skuteczno\u015bci, poniewa\u017c wyra\u017cenie nie ma cz\u0119\u015bci wsp\u00f3lnej ze stosowalno\u015bci\u0105. W celu zmodyfikowania skuteczno\u015bci wariantu u\u017cyj zmodernizowanego wyst\u0105pienia.
Effectivity.Error.ChangeApplicabilityAndEffectivitieAreEqual= Wyra\u017cenie skuteczno\u015bci pokrywa si\u0119 ze stosowalno\u015bci\u0105: nie mo\u017cna wykona\u0107 tej operacji.
Effectivity.Error.Unset.NoEffectivity= To wyst\u0105pienie nie ma skuteczno\u015bci, wy\u0142\u0105czenie nic nie zmieni

# Expression
Expression.Error.MissingAttachedModels= Nie wszystkie niezb\u0119dne modele s\u0105 do\u0142\u0105czone do nadrz\u0119dnego elementu referencyjnego.  
Expression.Error.MissingAttachedXRev= Wykres do\u0142\u0105czony do odniesienia nadrz\u0119dnego r\u00f3\u017cni si\u0119 od wykresu okre\u015blonego w Praca w ramach.  
Effectivity.Error.ParentNotAttachedAllModelsFromAC= Odwo\u0142anie do obiektu nadrz\u0119dnego nie ma do\u0142\u0105czonych niekt\u00f3rych modeli z kontekstu tworzenia.
Effectivity.Error.ParentNotEnabledAllCriteriaFromAC= Odwo\u0142anie do obiektu nadrz\u0119dnego nie ma w\u0142\u0105czonych niekt\u00f3rych kryteri\u00f3w z kontekstu tworzenia.
Expression.Error.InvalidExpression= Faktyczne wyra\u017cenie jest nieprawid\u0142owe.

# Reference
Expression.Error.AttachContextDeniedSinceReferenceIsRevised= Za\u0142\u0105czanie Kontekstu konfiguracji nie jest obs\u0142ugiwane w poprawionym obiekcie. Za\u0142\u0105czanie <modelType> nie powiod\u0142o si\u0119
Expression.Error.CriterionInXMLButNotEnabled= XML wej\u015bciowy zawiera <critType>, ale kryterium to nie jest w\u0142\u0105czone w odniesieniu <name>
Expression.Error.CriteriaNotDisabled= Nie uda\u0142o si\u0119 wy\u0142\u0105czy\u0107 kryteri\u00f3w w obiektach, poniewa\u017c zdefiniowano skuteczno\u015b\u0107 <critType> dla jednego lub wi\u0119cej wyst\u0105pie\u0144
Expression.Error.LastCriteriaCannotBeDisabled= Nie uda\u0142o si\u0119 wy\u0142\u0105czy\u0107 kryteri\u00f3w w obiektach, poniewa\u017c w\u0142\u0105czenie wi\u0119kszej liczby by\u0142oby niemo\u017cliwe, a co najmniej jeden model jest nadal przypisany
Expression.Error.EvolCriteriaCannotBeDisabled.FrozenInstance= Nie mo\u017cna wy\u0142\u0105czy\u0107 kryterium ewolucji, poniewa\u017c zawiera ono zamro\u017cone elementy, kt\u00f3re s\u0105 wa\u017cne dla co najmniej jednego wyst\u0105pienia
Expression.Error.EvolCriteriaCannotBeEnabled.FrozenInstance= Nie mo\u017cna w\u0142\u0105czy\u0107 kryterium ewolucji, poniewa\u017c zawiera ono zamro\u017cone elementy, kt\u00f3re sta\u0142yby si\u0119 wa\u017cne dla co najmniej jednego wyst\u0105pienia
Expression.Error.DetachNotPossible.ConfigurationUsage= Nie mo\u017cna od\u0142\u0105czy\u0107 modelu, poniewa\u017c jest on u\u017cywany w konfiguracji
Expression.Error.DetachNotPossible.EffectivityUsage= Nie mo\u017cna od\u0142\u0105czy\u0107 modelu, poniewa\u017c jest on u\u017cywany w wyra\u017ceniu skuteczno\u015bci
Expression.Error.DetachNotPossible.ConfigurationRevision= Od\u0142\u0105czenie modelu nie jest mo\u017cliwe, poniewa\u017c odniesienie zawiera poprawki konfiguracji
Expression.Error.DetachNotPossible.FrozenInstancesDefinedWithModel= Nie mo\u017cna od\u0142\u0105czy\u0107 modelu <marketingName>, poniewa\u017c zawiera kryterium zamro\u017conej ewolucji i co najmniej jedno wyst\u0105pienie w strukturze jest zamro\u017cone
Expression.Error.AttachNotPossible.InstanceBecomesValidForFrozenCriteria= Nie mo\u017cna powi\u0105za\u0107 modelu <marketingName>, poniewa\u017c zawiera kryterium zamro\u017conej ewolucji i co najmniej jedno wyst\u0105pienie w strukturze sta\u0142oby si\u0119 prawdziwe dla tych kryter\u00f3w zamro\u017cenia w przypadku powi\u0105zania
Expression.Error.AttachNotPossible.ObsoleteModel= Nie mo\u017cna do\u0142\u0105czy\u0107 modelu <marketingName>, poniewa\u017c jest on przestarza\u0142y
Expression.Error.ParentPartIsNotConfigured= Nadrz\u0119dna cz\u0119\u015b\u0107 podanej relacji nie ma kontekstu konfiguracji.
Expression.Error.RefNotConfigured= Odniesienie <name> nie jest skonfigurowane.
Expression.Error.CriterionNotEnabled= Kryterium <critType> nie jest w\u0142\u0105czone w odniesieniu <name>
Expression.Error.RefModelVarOnlyNotUniqueCannotAttachMoreModels= Za\u0142\u0105czanie wi\u0119cej ni\u017c 1 modelu nie jest mo\u017cliwe na poprawionym/wyprowadzonym obiekcie umo\u017cliwiaj\u0105cym zastosowanie kryterium wariantowego
Expression.Error.ExplicitVarCannotBeSynchronized= Odniesienie <name> <type> jest jawne i do\u0142\u0105cza Wersj\u0119 modelu. Takiego odniesienia nie mo\u017cna zsynchronizowa\u0107.

# Immutability
Expression.Error.FrozenCriteriaInEffs= Nie mo\u017cna fizycznie zmieni\u0107 wyst\u0105pie\u0144, poniewa\u017c skuteczno\u015bci zawieraj\u0105 przynajmniej jedno zamro\u017cone kryterium. U\u017cyj polecenia'Praca pochodna'.
Expression.Error.FrozenCfgRevImpacted= Brak mo\u017cliwo\u015bci przeprowadzenia operacji: wp\u0142ynie ona na co najmniej jedn\u0105 poprawk\u0119 konfiguracji
Expression.Error.FrozenRangeOfEffImpactedBySetExpression= Ustawienie wyra\u017ce\u0144 jest niemo\u017cliwe, poniewa\u017c spowodowa\u0142oby to dodanie lub usuni\u0119cie co najmniej jednego zamro\u017conego kryterium ewolucji do skuteczno\u015bci
Expression.Error.ExpressionContainsFrozen= Wyra\u017cenie zawiera co najmniej jedno zamro\u017cone kryterium ewolucji, wi\u0119c nie mo\u017cna go u\u017cy\u0107 do zdefiniowania stosowalno\u015bci/skuteczno\u015bci. Zaktualizuj wyra\u017cenie, aby usun\u0105\u0107 zamro\u017cone elementy
Expression.Error.FailedToRetrieveFrozenFilterOfModels= Nie mo\u017cna wykona\u0107 tej operacji. Prawdopodobnie niekt\u00f3re modele u\u017cywane do sprawdzania poprawno\u015bci operacji nie istniej\u0105
Expression.Error.FailedToDetermineWhetherToDoImmutabilityChecks= Nie mo\u017cna okre\u015bli\u0107, czy nale\u017cy przestrzega\u0107 regu\u0142 niezmienno\u015bci, poniewa\u017c niekt\u00f3re obiekty nie znajduj\u0105 si\u0119 w tych samych obszarach wsp\u00f3\u0142pracy 
Expression.Error.DeniedModelFilters= Wykonanie operacji niemo\u017cliwe. Przynajmniej jeden do\u0142\u0105czony model jest niedost\u0119pny, poniewa\u017c nale\u017cy do ograniczonego obszaru wsp\u00f3\u0142pracy
Expression.Error.FrozenEffCannotBeUnset= Nie mo\u017cemy usun\u0105\u0107 ustawienia efektywno\u015bci, poniewa\u017c nale\u017ca\u0142oby wtedy usun\u0105\u0107 zamro\u017cone kryterium z ewolucji cz\u0119\u015bci

# Static Mapping
StaticMapping.Error.Disabled= W \u015brodowisku mapowanie statyczne jest wy\u0142\u0105czone
StaticMapping.Error.FrozenInstanceCantCreateStaticMapping= Nie mo\u017cna utworzy\u0107 mapowania statycznego w tym wyst\u0105pieniu, poniewa\u017c jest ono zamro\u017cone
StaticMapping.Error.FrozenInstanceCantDeleteStaticMapping= Nie mo\u017cna usun\u0105\u0107 mapowania statycznego w tym wyst\u0105pieniu, poniewa\u017c jest ono zamro\u017cone
StaticMapping.Error.FrozenInstanceCantChangeStaticMapping= Nie mo\u017cna zmieni\u0107 mapowania statycznego w tym wyst\u0105pieniu, poniewa\u017c jest ono zamro\u017cone
StaticMapping.Error.FrozenInstanceCantChangeFilterUsedByStaticMapping= Nie mo\u017cna zmieni\u0107 filtra u\u017cywanego w tym mapowaniu statycznym w tym wyst\u0105pieniu, poniewa\u017c jest ono zamro\u017cone
StaticMapping.Error.FrozenInstanceCantUpdatePC= Nie mo\u017cna zaktualizowa\u0107 konfiguracji produktu, poniewa\u017c jest wykorzystywana w mapowaniu statycznym w zamro\u017conych wyst\u0105pieniach

# Granular reject
Expression.Error.CANotRejectableForEffectivities= Akcji zmiany <name>\u200b nie mo\u017cna odrzuci\u0107 dla co najmniej jednego z tych wyst\u0105pie\u0144
Expression.Error.OperationForbiddenWithAlreadyRejectedCA= Nie przeprowadzi\u0107 operacji w ramach akcji zmiany, kt\u00f3ra zosta\u0142a odrzucona dla danych wyst\u0105pie\u0144

# Configured Operations
Expression.Error.SplitUnderCACannotBeDoneOnVarOnlyStructure= Nie mo\u017cna przeprowadzi\u0107 operacji rozdzia\u0142u w ramach akcji zmiany dla struktury zawieraj\u0105cej jedynie warianty;
CfgOperation.Error.EffectivityCannotBeExtended= Operacja rozszerzania ma zastosowanie tylko do skuteczno\u015bci z wyra\u017ceniem ewolucji.
CfgOperation.Error.Extend.InstanceWithoutEffectivity= Nie mo\u017cna wykona\u0107 operacji rozszerzania w przypadku wyst\u0105pie\u0144 bez skuteczno\u015bci
CfgOperation.Error.Extend.ExpressionTrue= Nie mo\u017cna wykona\u0107 operacji rozszerzania w przypadku zawsze prawid\u0142owych wyst\u0105pie\u0144
CfgOperation.Error.Extend.VariantOnlyEffectivity= Nie mo\u017cna wykona\u0107 operacji rozszerzania w przypadku wyst\u0105pie\u0144, kt\u00f3re maj\u0105 jedynie cz\u0119\u015b\u0107 wariantu w zakresie swojej skuteczno\u015bci, poniewa\u017c s\u0105 one zawsze prawid\u0142owe
CfgOperation.Error.Extend.UselessExtension= Nie mo\u017cna rozszerzy\u0107 wyst\u0105pie\u0144 o zakres wa\u017cno\u015bci, kt\u00f3ry mie\u015bci si\u0119 w pe\u0142ni w istniej\u0105cym zakresie wa\u017cno\u015bci
CfgOperation.Error.Reparent.CriterionNotEnabledOnParentRefOfDuplicate= Kryterium <critType> nie jest w\u0142\u0105czone w nowym odniesieniu nadrz\u0119dnym <name>, ale kryterium to jest u\u017cywane w skuteczno\u015bci
CfgOperation.Error.Reparent.ConfigContextsNotCoherentSourceTarget= Istnieje model stosowany w skuteczno\u015bci oryginalnego filtrowanego elementu, kt\u00f3ry nie jest do\u0142\u0105czony do odniesienia nadrz\u0119dnego filtrowanego elementu. Nie mo\u017cemy skopiowa\u0107 \u200bskuteczno\u015bci i dokona\u0107 zmiany nadrz\u0119dno\u015bci
CfgOperation.Error.Reparent.NoModelAttachedOnTarget= Do odniesienia nadrz\u0119dnego <name> filtrowanego elementu nie jest do\u0142\u0105czony \u017caden model. Nie mo\u017cemy skopiowa\u0107 \u200bskuteczno\u015bci i dokona\u0107 zmiany nadrz\u0119dno\u015bci

# Work Under
Change.Error.ParentPartIsNotCompliantWithChange= Zmiana okre\u015blona w ustawieniu "Trwaj\u0105 prace" u\u017cywa tryb\u00f3w, kt\u00f3re s\u0105 niedost\u0119pne w kontek\u015bcie konfiguracji nadrz\u0119dnej cz\u0119\u015bci.
Change.Error.ChangeApplicabilityIsEmptyAtFinalize= Wyra\u017cenie stosowalno\u015bci jest puste, ale istniej\u0105 obj\u0119te elementy wymagaj\u0105ce aktualizacji.
Change.Error.ApplicabilityRead= B\u0142\u0105d podczas odczytywania informacji o stosowalno\u015bci
Change.Error.ApplicabilityWrite= B\u0142\u0105d podczas zapisywania stosowalno\u015bci. By\u0107 mo\u017ce u\u017cytkownik nie ma uprawnie\u0144 do modyfikowania stosowalno\u015bci
Change.Error.Applicability.Finalization.Models= Nie mo\u017cna zako\u0144czy\u0107 <type> \u2014 nie wszystkie powi\u0105zane modele s\u0105 do\u0142\u0105czone w odniesieniu. 
Change.Error.Applicability.Finalization.RefModels= Nie mo\u017cna zako\u0144czy\u0107 <type> \u2014 nie wszystkie modele odniesienia s\u0105 do\u0142\u0105czone w akcji zmiany 
Change.Error.FalseExpression= Model jest zdefiniowany w stosowalno\u015bci Akcji zmiany ale nie zdefinowano dok\u0142adnej stosowalno\u015bci.
Change.Error.FinalState= Wyra\u017cenie stosowalno\u015bci znajduje si\u0119 ju\u017c w stanie ko\u0144cowym.
Change.Error.EmptyExpression= Wyra\u017cenie stosowalno\u015bci jest puste.
AuthContext.Error.ContainsFrozen= Wyra\u017cenie kontekstu tworzenia zawiera niekt\u00f3re z kryteri\u00f3w zamro\u017cenia
AuthContext.Error.NoIntersectionInstanceVsAC= Kontekst tworzenia okre\u015bla wyra\u017cenie, kt\u00f3rego nie mo\u017cna zastosowa\u0107 do odniesienia podrz\u0119dnego. <name> (<marketingName>), poniewa\u017c to wyra\u017cenie nie dzieli \u017cadnego zakresu wa\u017cno\u015bci z wyra\u017ceniem odniesienia podrz\u0119dnego.
