#
#   ExpressionStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program

#   static const char RCSID[] = "$Id: ExpressionStringResource.properties.rca  $"
#

# --- General

General.Model= Model
General.ModelVersion= Model S\u00fcr\u00fcm\u00fc

# Criteria
Criteria.Date= Tarih
Criteria.Products= \u00dcr\u00fcnler
Criteria.ManufacturingPlans= \u0130malat Planlar\u0131
Criteria.Unit= Birim
Criteria.Milestone= Kilometre Ta\u015f\u0131
Criteria.FeatureOption= Varyantlar ve Se\u00e7enekler


# --- Success

# Effectivity
Effectivity.Success.SetEvolutionOperationSuccess= Evrim Etkilili\u011fini ayarlama i\u015flemi ba\u015far\u0131l\u0131 oldu.


# --- Errors

Error.InternalServerError= dahili hata

# General
General.Error.InvalidCategoryTypeSetting= Kategori tipi ge\u00e7ersiz. L\u00fctfen ge\u00e7erli kategori tipi ayarlar\u0131n\u0131 kontrol edin.
General.Range.Error.SequenceValues= Aral\u0131k Olarak Ekle bir veya iki dizi de\u011feri gerektirir. Bulunan dizi de\u011ferlerinin say\u0131s\u0131: 
General.Range.Error.DatesValues= Aral\u0131k Olarak Ekle bir veya iki tarih gerektirir. Bulunan tarih de\u011ferlerinin say\u0131s\u0131: 
General.Error.UnsupportedDateWithRelational= Tarih, \u0130li\u015fkisel ge\u00e7erlilik tipiyle desteklenmiyor. L\u00fctfen bu ili\u015fki veya tip i\u00e7in y\u00f6netici \u00f6zelli\u011finden ge\u00e7erlilik tiplerinden birini kald\u0131r\u0131n.
General.Error.UnsupportedGlobalWithMultipleContexts= Global konfig\u00fcrasyon ba\u011flam\u0131, ayn\u0131 ifadedeki di\u011fer konfig\u00fcrasyon ba\u011flam\u0131yla birle\u015ftirilemez. L\u00fctfen Global konfig\u00fcrasyon ba\u011flam\u0131n\u0131 veya di\u011fer t\u00fcm konfig\u00fcrasyon ba\u011flamlar\u0131n\u0131 kald\u0131r\u0131n.
General.Error.TimeOut= Komutun gerekli t\u00fcm bilgileri alabilmesi \u00e7ok uzun s\u00fcrd\u00fc. Tekrar deneyin veya destek i\u00e7in y\u00f6neticinizle ileti\u015fime ge\u00e7in.

# Criteria
Criteria.Error.UnsupportedCriteriaType= Kriter tipi desteklenmiyor. L\u00fctfen desteklenen bir kriter tipi belirtin.
Criteria.Error.TypeNotAModel= bir Model tipi de\u011fil
Criteria.Error.TypeNotAModelVersion= bir Model S\u00fcr\u00fcm\u00fc tipi de\u011fil
Criteria.Error.NoAccessToModel= kullan\u0131c\u0131n\u0131n eri\u015femedi\u011fi bir Modeldir
Criteria.Error.DeletedObject= silinmi\u015f bir nesnedir

# Effectivity
Effectivity.Error.MismatchEffectivityTypesAndExpression_bus= Etkililik ifadesi, bu nesneye uygulanmam\u0131\u015f baz\u0131 etkililik tipleri i\u00e7eriyor.
Effectivity.Error.NoEffectivityTypeFound= Etkililik tipi bulunamad\u0131. L\u00fctfen \u015femada tan\u0131mland\u0131\u011f\u0131 gibi ge\u00e7erli bir etkililik tipi kullan\u0131n.
Effectivity.Error.EffectivityUsageCannotDelete= Nesne, ge\u00e7erlilik ifadesinde kullan\u0131l\u0131yor ve silinemez. Silinmesine izin vermek i\u00e7in l\u00fctfen nesneyi t\u00fcm ge\u00e7erlilik ifadelerinden kald\u0131r\u0131n.
Effectivity.FalseExpression.Display= Ge\u00e7ersiz
Effectivity.TrueExpression.Display= Ge\u00e7erli
Effectivity.Error.OnlyEvolutionEffectivity= Bu \u00f6rnek yaln\u0131zca Evolution etki alan\u0131 ge\u00e7erlili\u011fine sahip.
Effectivity.Error.EffectivityUsageCannotRemoveObject= <object_type> <object_name>, yap\u0131land\u0131r\u0131lm\u0131\u015f bir ifadede (Filtre, Ge\u00e7erlilik, ...) kullan\u0131l\u0131yor ve kald\u0131r\u0131lam\u0131yor. Kald\u0131rmaya izin vermek i\u00e7in l\u00fctfen kriterleri t\u00fcm yap\u0131land\u0131r\u0131lm\u0131\u015f ifadelerden kald\u0131r\u0131n.
Effectivity.Error.EffectivityUsageCannotModifyObject= <object_type> <object_name>, yap\u0131land\u0131r\u0131lm\u0131\u015f bir ifadede (Filtre, Ge\u00e7erlilik, ...) kullan\u0131l\u0131yor ve de\u011fi\u015ftirilemiyor. De\u011fi\u015fikli\u011fe izin vermek i\u00e7in l\u00fctfen kriterleri t\u00fcm yap\u0131land\u0131r\u0131lm\u0131\u015f ifadelerden kald\u0131r\u0131n.
Effectivity.Error.ChangeApplicabilityAndEffectivitieDoNotIntersect= \u0130fade uygulanabilirlik ile kesi\u015fmedi\u011finden ge\u00e7erlilik d\u00fczenlenemiyor. Varyant ge\u00e7erlili\u011fini de\u011fi\u015ftirmek i\u00e7in evrilmi\u015f bir \u00f6rnek kullan\u0131n.
Effectivity.Error.ChangeApplicabilityAndEffectivitieAreEqual= Ge\u00e7erlilik \u0130fadesi Uygulanabilirli\u011fe e\u015fit : Bu i\u015flem uygulanamaz.
Effectivity.Error.Unset.NoEffectivity= Bu \u00f6rne\u011fin ge\u00e7erlili\u011fi yok, belirlenmemi\u015f olmas\u0131 yarars\u0131z

# Expression
Expression.Error.MissingAttachedModels= Gerekli t\u00fcm modeller \u00fcst referansa eklenmedi.  
Expression.Error.MissingAttachedXRev= \u00dcst referansa ili\u015ftirilmi\u015f grafik, Alt\u0131nda \u00c7al\u0131\u015f k\u0131sm\u0131nda belirtilenden farkl\u0131.  
Effectivity.Error.ParentNotAttachedAllModelsFromAC= \u00dcst referans, i\u00e7erik olu\u015fturma ba\u011flam\u0131ndan eklenen t\u00fcm modellere sahip de\u011fil.
Effectivity.Error.ParentNotEnabledAllCriteriaFromAC= \u00dcst referans, i\u00e7erik olu\u015fturma ba\u011flam\u0131ndan etkinle\u015ftirilen t\u00fcm kriterlere sahip de\u011fil.
Expression.Error.InvalidExpression= Fiili ifade ge\u00e7ersiz.

# Reference
Expression.Error.AttachContextDeniedSinceReferenceIsRevised= Revize edilmi\u015f nesnede Konfig\u00fcrasyon Ba\u011flam\u0131n\u0131n eklenmesi desteklenmiyor. <modelType> eklenemedi
Expression.Error.CriterionInXMLButNotEnabled= Girdi XML'i <critType> i\u00e7eriyor ancak bu kriter <name> referans\u0131nda etkin de\u011fil
Expression.Error.CriteriaNotDisabled= Bir veya daha fazla \u00f6rnek kapsam\u0131nda <critType> etkilili\u011fi tan\u0131mland\u0131\u011f\u0131 i\u00e7in nesneler \u00fczerinde kriterler devre d\u0131\u015f\u0131 b\u0131rak\u0131lamad\u0131
Expression.Error.LastCriteriaCannotBeDisabled= H\u00e2l\u00e2 en az bir model eklenmi\u015f durumdayken daha fazla kriter etkinle\u015ftirilmeyece\u011fi i\u00e7in nesneler \u00fczerinde kriterler devre d\u0131\u015f\u0131 b\u0131rak\u0131lamad\u0131
Expression.Error.EvolCriteriaCannotBeDisabled.FrozenInstance= Evrim kriteri, en az bir \u00f6rnek i\u00e7in ge\u00e7erli olan baz\u0131 dondurulmu\u015f elemanlara sahip oldu\u011fu i\u00e7in devre d\u0131\u015f\u0131 b\u0131rak\u0131lam\u0131yor
Expression.Error.EvolCriteriaCannotBeEnabled.FrozenInstance= Evrim kriteri, en az bir \u00f6rnek i\u00e7in ge\u00e7erli olacak baz\u0131 dondurulmu\u015f elemanlara sahip oldu\u011fu i\u00e7in etkinle\u015ftirilemiyor
Expression.Error.DetachNotPossible.ConfigurationUsage= Model ayr\u0131lam\u0131yor \u00e7\u00fcnk\u00fc bir konfig\u00fcrasyon taraf\u0131ndan kullan\u0131l\u0131yor
Expression.Error.DetachNotPossible.EffectivityUsage= Model ayr\u0131lam\u0131yor \u00e7\u00fcnk\u00fc bir ge\u00e7erlilik ifadesi taraf\u0131ndan kullan\u0131l\u0131yor
Expression.Error.DetachNotPossible.ConfigurationRevision= Referans\u0131n Konfig\u00fcrasyon Revizyonlar\u0131 oldu\u011fu i\u00e7in Model ayr\u0131lam\u0131yor
Expression.Error.DetachNotPossible.FrozenInstancesDefinedWithModel= <marketingName> modeli, dondurulmu\u015f evrim kriterleri i\u00e7erdi\u011fi ve yap\u0131daki en az bir \u00f6rnek dondurulmu\u015f oldu\u011fu i\u00e7in ayr\u0131lam\u0131yor
Expression.Error.AttachNotPossible.InstanceBecomesValidForFrozenCriteria= Dondurulmu\u015f evrim kriterleri i\u00e7erdi\u011fi ve eklenmesi halinde yap\u0131daki en az bir \u00f6rne\u011fin ilgili dondurulmu\u015f kriterler i\u00e7in ge\u00e7erli olacak olmas\u0131 nedeniyle <marketingName> modeli eklenemiyor
Expression.Error.AttachNotPossible.ObsoleteModel= <marketingName> modeli, eski oldu\u011fu i\u00e7in eklenemiyor
Expression.Error.ParentPartIsNotConfigured= Verilen ili\u015fkinin \u00fcst par\u00e7as\u0131nda bir Konfig\u00fcrasyon ba\u011flam\u0131 yok.
Expression.Error.RefNotConfigured= <name> referans\u0131 yap\u0131land\u0131r\u0131lmam\u0131\u015f
Expression.Error.CriterionNotEnabled= <critType> kriteri, <name> referans\u0131nda etkin de\u011fil
Expression.Error.RefModelVarOnlyNotUniqueCannotAttachMoreModels= Varyant kriterini etkinle\u015ftiren revize edilen/t\u00fcretilmi\u015f bir nesneye 1'den fazla Model eklenemez
Expression.Error.ExplicitVarCannotBeSynchronized= <name> <type> referans\u0131 a\u00e7\u0131k ve bir Model S\u00fcr\u00fcm\u00fcne ekleniyor. B\u00f6yle bir referans senkronize edilemez

# Immutability
Expression.Error.FrozenCriteriaInEffs= Etkililikleri en az bir dondurulmu\u015f kriter i\u00e7erdi\u011fi i\u00e7in \u00f6rnekleri fiziksel olarak de\u011fi\u015ftiremezsiniz. 'Alt\u0131nda \u00c7al\u0131\u015f' se\u00e7ene\u011fini kullan\u0131n.
Expression.Error.FrozenCfgRevImpacted= \u0130\u015flem ger\u00e7ekle\u015ftirilemiyor: En az bir dondurulmu\u015f Konfig\u00fcrasyon Revizyonunu etkiliyor
Expression.Error.FrozenRangeOfEffImpactedBySetExpression= Etkililiklere en az bir dondurulmu\u015f evrim kriteri ekleyece\u011fi veya kald\u0131raca\u011f\u0131 i\u00e7in ifadeler ayarlanam\u0131yor
Expression.Error.ExpressionContainsFrozen= \u0130fade en az bir dondurulmu\u015f evrim kriteri i\u00e7erdi\u011finden Uygulanabilirlik/Etkililik tan\u0131m\u0131 i\u00e7in kullan\u0131lamaz. L\u00fctfen ifadeyi g\u00fcncelleyerek dondurulmu\u015f elemanlar\u0131 kald\u0131r\u0131n
Expression.Error.FailedToRetrieveFrozenFilterOfModels= Bu i\u015flem ger\u00e7ekle\u015ftirilemiyor. \u0130\u015flemin ge\u00e7erlili\u011fini kontrol etmek i\u00e7in kullan\u0131lan baz\u0131 Modeller mevcut de\u011fil
Expression.Error.FailedToDetermineWhetherToDoImmutabilityChecks= Baz\u0131 nesneler ayn\u0131 i\u015f birli\u011fi alanlar\u0131nda olmad\u0131\u011f\u0131 i\u00e7in de\u011fi\u015fmezlik kurallar\u0131na uyulup uyulmayaca\u011f\u0131 belirlenemiyor 
Expression.Error.DeniedModelFilters= \u0130\u015flem ger\u00e7ekle\u015ftirilemiyor. K\u0131s\u0131tl\u0131 bir i\u015f birli\u011fi alan\u0131na ait oldu\u011fu i\u00e7in en az bir ekli modele eri\u015filemiyor
Expression.Error.FrozenEffCannotBeUnset= Evrim par\u00e7as\u0131ndan dondurulmu\u015f kriterleri kald\u0131rmam\u0131z\u0131 gerektirece\u011fi i\u00e7in ge\u00e7erlilik ayar\u0131n\u0131 kald\u0131ram\u0131yoruz

# Static Mapping
StaticMapping.Error.Disabled= Statik E\u015fleme bu ortamda devre d\u0131\u015f\u0131 b\u0131rak\u0131ld\u0131
StaticMapping.Error.FrozenInstanceCantCreateStaticMapping= Dondurulmu\u015f oldu\u011fu i\u00e7in bu \u00f6rnekte statik e\u015fleme olu\u015fturulam\u0131yor
StaticMapping.Error.FrozenInstanceCantDeleteStaticMapping= Dondurulmu\u015f oldu\u011fu i\u00e7in bu \u00f6rnekteki statik e\u015fleme silinemiyor
StaticMapping.Error.FrozenInstanceCantChangeStaticMapping= Dondurulmu\u015f oldu\u011fu i\u00e7in bu \u00f6rnekteki statik e\u015fleme de\u011fi\u015ftirilemiyor
StaticMapping.Error.FrozenInstanceCantChangeFilterUsedByStaticMapping= Dondurulmu\u015f oldu\u011fu i\u00e7in bu \u00f6rnekteki statik e\u015fleme taraf\u0131ndan kullan\u0131lan filtre de\u011fi\u015ftirilemiyor
StaticMapping.Error.FrozenInstanceCantUpdatePC= \u00dcr\u00fcn Konfig\u00fcrasyonu, dondurulmu\u015f \u00f6rnekler taraf\u0131ndan ta\u015f\u0131nan statik e\u015flemelerde kullan\u0131ld\u0131\u011f\u0131 i\u00e7in g\u00fcncellenemiyor

# Granular reject
Expression.Error.CANotRejectableForEffectivities= De\u011fi\u015fiklik Eylemi <name>, bu \u00f6rneklerden en az biri i\u00e7in reddedilemiyor
Expression.Error.OperationForbiddenWithAlreadyRejectedCA= \u0130\u015flem, ilgili \u00f6rnekler i\u00e7in reddedilmi\u015f olan bir De\u011fi\u015fiklik Eylemiyle y\u00fcr\u00fct\u00fclemez

# Configured Operations
Expression.Error.SplitUnderCACannotBeDoneOnVarOnlyStructure= De\u011fi\u015fiklik Eylemi alt\u0131ndaki ay\u0131rma i\u015flemi, yaln\u0131zca varyantl\u0131 yap\u0131da y\u00fcr\u00fct\u00fclemez;
CfgOperation.Error.EffectivityCannotBeExtended= Uzatma i\u015flemi yaln\u0131zca evrim ifadesiyle etkililik i\u00e7in ge\u00e7erli.
CfgOperation.Error.Extend.InstanceWithoutEffectivity= Uzatma i\u015flemi, etkililikleri olmayan \u00f6rneklerde ger\u00e7ekle\u015ftirilemez
CfgOperation.Error.Extend.ExpressionTrue= Her zaman ge\u00e7erli \u00f6rneklerde uzatma i\u015flemi ger\u00e7ekle\u015ftirilemez
CfgOperation.Error.Extend.VariantOnlyEffectivity= Her zaman ge\u00e7erli olduklar\u0131 i\u00e7in etkililiklerinde yaln\u0131zca bir varyant par\u00e7a i\u00e7eren \u00f6rneklerde uzatma i\u015flemi ger\u00e7ekle\u015ftirilemez
CfgOperation.Error.Extend.UselessExtension= \u00d6rnekler, mevcut ge\u00e7erlilik aral\u0131\u011f\u0131 taraf\u0131ndan tam olarak kapsanan bir ge\u00e7erlilik aral\u0131\u011f\u0131yla geni\u015fletilemez
CfgOperation.Error.Reparent.CriterionNotEnabledOnParentRefOfDuplicate= <critType> kriteri, yeni <name> \u00fcst referans\u0131nda etkinle\u015ftirilmedi ancak etkililiklerde bu kriter kullan\u0131l\u0131yor
CfgOperation.Error.Reparent.ConfigContextsNotCoherentSourceTarget= Orijinal filtrelenebilir \u00f6\u011fenin etkilili\u011finde kullan\u0131lan ve filtrelenebilir \u00f6\u011fenin \u00fcst \u00f6\u011fe referans\u0131na ekli olmayan bir model bulunuyor. Etkilili\u011fi kopyalayam\u0131yoruz ve yeniden \u00fcst \u00f6\u011fe haline getirme i\u015flemini ger\u00e7ekle\u015ftiremiyoruz
CfgOperation.Error.Reparent.NoModelAttachedOnTarget= Filtrelenebilir \u00f6\u011fenin <name> \u00fcst \u00f6\u011fe referans\u0131na eklenmi\u015f model yok. Etkilili\u011fi kopyalayam\u0131yoruz ve yeniden \u00fcst \u00f6\u011fe haline getirme i\u015flemini ger\u00e7ekle\u015ftiremiyoruz

# Work Under
Change.Error.ParentPartIsNotCompliantWithChange= 'Alt\u0131nda \u00e7al\u0131\u015fma' olarak kullan\u0131lan De\u011fi\u015fiklik, \u00fcst par\u00e7an\u0131n Konfig\u00fcrasyon Ba\u011flam\u0131nda kullan\u0131lamayan modelleri kullan\u0131yor.
Change.Error.ChangeApplicabilityIsEmptyAtFinalize= Uygulanabilirlik ifadesi bo\u015f ancak g\u00fcncellenecek etkilenen \u00f6\u011feler var.
Change.Error.ApplicabilityRead= Uygulanabilirlik okunurken hata olu\u015ftu
Change.Error.ApplicabilityWrite= Ge\u00e7erlilik yaz\u0131l\u0131rken hata olu\u015ftu; kullan\u0131c\u0131n\u0131n ge\u00e7erlili\u011fi de\u011fi\u015ftirme yetkisi olmayabilir
Change.Error.Applicability.Finalization.Models= T\u00fcm modelleri referansa eklenmedi\u011fi i\u00e7in <type> tamamlanam\u0131yor 
Change.Error.Applicability.Finalization.RefModels= Referans\u0131n t\u00fcm Modelleri De\u011fi\u015fiklik Eylemine ekli olmad\u0131\u011f\u0131 i\u00e7in <type> tamamlanam\u0131yor 
Change.Error.FalseExpression= Model, De\u011fi\u015fiklik Eyleminin uygulanabilirli\u011finde tan\u0131mland\u0131 ancak tam uygulanabilirlik tan\u0131mlanmad\u0131.
Change.Error.FinalState= Uygulanabilirlik ifadesi, zaten nihai durumda.
Change.Error.EmptyExpression= Uygulanabilirlik ifadesi bo\u015f.
AuthContext.Error.ContainsFrozen= \u0130\u00e7erik Olu\u015fturma Ba\u011flam\u0131 ifadesi baz\u0131 dondurulmu\u015f kriterler i\u00e7eriyor
AuthContext.Error.NoIntersectionInstanceVsAC= Yazarl\u0131k Ba\u011flam\u0131 <name> (<marketingName>) alt referans\u0131na uygulanamayan bir ifade tan\u0131ml\u0131yor \u00e7\u00fcnk\u00fc bu ifade alt referans\u0131nkiyle hi\u00e7bir ge\u00e7erlilik aral\u0131\u011f\u0131 payla\u015fm\u0131yor
