#
#   ExpressionStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program

#   static const char RCSID[] = "$Id: ExpressionStringResource.properties.rca  $"
#

# --- General

General.Model= Mod\u00e8le
General.ModelVersion= Version du mod\u00e8le

# Criteria
Criteria.Date= Date
Criteria.Products= Produits
Criteria.ManufacturingPlans= Plans de fabrication
Criteria.Unit= Unit\u00e9
Criteria.Milestone= Jalon
Criteria.FeatureOption= Variantes et options


# --- Success

# Effectivity
Effectivity.Success.SetEvolutionOperationSuccess= D\u00e9finition de l'effectivit\u00e9 d'\u00e9volution termin\u00e9e avec succ\u00e8s.


# --- Errors

Error.InternalServerError= erreur interne

# General
General.Error.InvalidCategoryTypeSetting= Type de cat\u00e9gorie invalide. V\u00e9rifiez les r\u00e9glages de type de cat\u00e9gorie.
General.Range.Error.SequenceValues= L'insertion comme plage requiert une ou deux valeurs de s\u00e9quence. Le nombre de valeurs de s\u00e9quence d\u00e9tect\u00e9 \u00e9tait : 
General.Range.Error.DatesValues= L'insertion comme plage requiert une ou deux dates. Le nombre de valeurs de date d\u00e9tect\u00e9 \u00e9tait : 
General.Error.UnsupportedDateWithRelational= La date n'est pas prise en charge avec le type d'effectivit\u00e9 relationnelle. Enlevez un des types d'effectivit\u00e9 de la propri\u00e9t\u00e9 admin pour cette relation ou ce type.
General.Error.UnsupportedGlobalWithMultipleContexts= Impossible de combiner le contexte de configuration global avec un autre contexte de configuration dans la m\u00eame expression. Enlevez le contexte de configuration global ou tous les autres contextes de configuration.
General.Error.TimeOut= La commande a pris trop de temps pour obtenir toutes les informations n\u00e9cessaires. R\u00e9essayez ou contactez votre administrateur pour obtenir de l'aide.

# Criteria
Criteria.Error.UnsupportedCriteriaType= Type de crit\u00e8re non pris en charge. Sp\u00e9cifiez un type de crit\u00e8re pris en charge.
Criteria.Error.TypeNotAModel= n'est pas un type de mod\u00e8le
Criteria.Error.TypeNotAModelVersion= n'est pas un type de version de mod\u00e8le
Criteria.Error.NoAccessToModel= est un mod\u00e8le auquel l'utilisateur n'a pas acc\u00e8s
Criteria.Error.DeletedObject= est un objet supprim\u00e9

# Effectivity
Effectivity.Error.MismatchEffectivityTypesAndExpression_bus= L\u2019expression d'effectivit\u00e9 contient des types d\u2019effectivit\u00e9 pas encore appliqu\u00e9s \u00e0 cet objet.
Effectivity.Error.NoEffectivityTypeFound= Aucun type d\u2019effectivit\u00e9 d\u00e9tect\u00e9. Utilisez un type d\u2019effectivit\u00e9 valide comme d\u00e9fini dans le sch\u00e9ma.
Effectivity.Error.EffectivityUsageCannotDelete= L\u2019objet est utilis\u00e9 dans une expression d\u2019effectivit\u00e9 et ne peut pas \u00eatre supprim\u00e9. Enlevez l\u2019objet de toutes les expressions d\u2019effectivit\u00e9 pour permettre sa suppression.
Effectivity.FalseExpression.Display= Non valide
Effectivity.TrueExpression.Display= Valide
Effectivity.Error.OnlyEvolutionEffectivity= Cette instance comporte uniquement une effectivit\u00e9 de domaine d'\u00e9volution.
Effectivity.Error.EffectivityUsageCannotRemoveObject= L'objet <object_type> <object_name> est utilis\u00e9 dans une expression configur\u00e9e (filtre, effectivit\u00e9, etc.) et ne peut \u00eatre enlev\u00e9. Enlevez le crit\u00e8re de toutes les expressions configur\u00e9es pour pouvoir l'enlever.
Effectivity.Error.EffectivityUsageCannotModifyObject= L'objet <object_type> <object_name> est utilis\u00e9 dans une expression configur\u00e9e (filtre, effectivit\u00e9, etc.) et ne peut \u00eatre modifi\u00e9. Enlevez le crit\u00e8re de toutes les expressions configur\u00e9es pour pouvoir le modifier.
Effectivity.Error.ChangeApplicabilityAndEffectivitieDoNotIntersect= Impossible de modifier l'effectivit\u00e9 car l'expression n\u2019entrecoupe pas l'applicabilit\u00e9. Utilisez une instance \u00e9volu\u00e9e pour modifier l'effectivit\u00e9 de variante.
Effectivity.Error.ChangeApplicabilityAndEffectivitieAreEqual= L\u2019expression d\u2019effectivit\u00e9 est \u00e9gale \u00e0 l'applicabilit\u00e9 : impossible d\u2019effectuer cette op\u00e9ration.
Effectivity.Error.Unset.NoEffectivity= Cette instance n'a pas d'effectivit\u00e9, l'annulation est inutile

# Expression
Expression.Error.MissingAttachedModels= Tous les mod\u00e8les n\u00e9cessaires ne sont pas attach\u00e9s \u00e0 la r\u00e9f\u00e9rence parent.  
Expression.Error.MissingAttachedXRev= Le graphique joint \u00e0 la r\u00e9f\u00e9rence parent est diff\u00e9rent de celui sp\u00e9cifi\u00e9 dans Travailler sous.  
Effectivity.Error.ParentNotAttachedAllModelsFromAC= La r\u00e9f\u00e9rence parent ne contient pas tous les mod\u00e8les du contexte de cr\u00e9ation.
Effectivity.Error.ParentNotEnabledAllCriteriaFromAC= Tous les crit\u00e8res du contexte de cr\u00e9ation ne sont pas activ\u00e9s dans la r\u00e9f\u00e9rence parent.
Expression.Error.InvalidExpression= Expression r\u00e9elle invalide

# Reference
Expression.Error.AttachContextDeniedSinceReferenceIsRevised= L'attachement d'un contexte de configuration n'est pas pris en charge sur l'objet r\u00e9vis\u00e9. L'attachement de <modelType> a \u00e9chou\u00e9
Expression.Error.CriterionInXMLButNotEnabled= L'entr\u00e9e XML contient <critType>, mais ce crit\u00e8re n'est pas activ\u00e9 sur la r\u00e9f\u00e9rence <name>
Expression.Error.CriteriaNotDisabled= Echec de la d\u00e9sactivation des crit\u00e8res sur les objets, car une ou plusieurs instances ont une effectivit\u00e9 <critType>  d\u00e9finie
Expression.Error.LastCriteriaCannotBeDisabled= \u00c9chec de la d\u00e9sactivation des crit\u00e8res sur les objets car plus aucun crit\u00e8re ne serait activ\u00e9 alors qu'il y a toujours au moins un mod\u00e8le attach\u00e9.
Expression.Error.EvolCriteriaCannotBeDisabled.FrozenInstance= Le crit\u00e8re d'\u00e9volution ne peut pas \u00eatre d\u00e9sactiv\u00e9, car certains de ses \u00e9l\u00e9ments fig\u00e9s sont valides pour au moins une instance.
Expression.Error.EvolCriteriaCannotBeEnabled.FrozenInstance= Le crit\u00e8re d'\u00e9volution ne peut pas \u00eatre activ\u00e9, car il contient des \u00e9l\u00e9ments fig\u00e9s qui deviendraient valides pour au moins une instance.
Expression.Error.DetachNotPossible.ConfigurationUsage= Impossible de d\u00e9tacher le mod\u00e8le, car il est utilis\u00e9 par une configuration
Expression.Error.DetachNotPossible.EffectivityUsage= Impossible de d\u00e9tacher le mod\u00e8le, car il est utilis\u00e9 par une expression d'effectivit\u00e9
Expression.Error.DetachNotPossible.ConfigurationRevision= Le mod\u00e8le ne peut pas \u00eatre d\u00e9tach\u00e9 car la r\u00e9f\u00e9rence poss\u00e8de des r\u00e9visions de configuration
Expression.Error.DetachNotPossible.FrozenInstancesDefinedWithModel= Le mod\u00e8le <marketingName> ne peut pas \u00eatre d\u00e9tach\u00e9, car il contient des crit\u00e8res d'\u00e9volution fig\u00e9s et au moins une instance de la structure est fig\u00e9e
Expression.Error.AttachNotPossible.InstanceBecomesValidForFrozenCriteria= Le mod\u00e8le <marketingName> ne peut pas \u00eatre rattach\u00e9 car il contient des crit\u00e8res d'\u00e9volution fig\u00e9s et au moins une instance de la structure deviendrait valide pour ces crit\u00e8res fig\u00e9s si nous le rattachons.
Expression.Error.AttachNotPossible.ObsoleteModel= Le mod\u00e8le <marketingName> ne peut pas \u00eatre associ\u00e9 car il est obsol\u00e8te
Expression.Error.ParentPartIsNotConfigured= La pi\u00e8ce parent de la relation donn\u00e9e ne comporte pas de contexte de configuration.
Expression.Error.RefNotConfigured= La r\u00e9f\u00e9rence <name> n'est pas configur\u00e9e
Expression.Error.CriterionNotEnabled= Le crit\u00e8re <critType> n'est pas activ\u00e9 sur la r\u00e9f\u00e9rence <name>
Expression.Error.RefModelVarOnlyNotUniqueCannotAttachMoreModels= L'ajout de plusieurs mod\u00e8les n'est pas autoris\u00e9 sur un objet r\u00e9vis\u00e9/d\u00e9riv\u00e9 permettant le crit\u00e8re de variante
Expression.Error.ExplicitVarCannotBeSynchronized= La r\u00e9f\u00e9rence <name> <type> est explicite et associe une version de mod\u00e8le. Une telle r\u00e9f\u00e9rence ne peut pas \u00eatre synchronis\u00e9e

# Immutability
Expression.Error.FrozenCriteriaInEffs= Vous ne pouvez pas modifier physiquement les instances, car leurs effectivit\u00e9s contiennent au moins un crit\u00e8re fig\u00e9. Utilisez un 'Travail sous'.
Expression.Error.FrozenCfgRevImpacted= Impossible d'effectuer l'op\u00e9ration : cela impacte au moins une r\u00e9vision de configuration fig\u00e9e
Expression.Error.FrozenRangeOfEffImpactedBySetExpression= Impossible de d\u00e9finir les expressions car cela ajouterait ou enl\u00e8verait au moins un crit\u00e8re d'\u00e9volution fig\u00e9 pour les effectivit\u00e9s
Expression.Error.ExpressionContainsFrozen= L'expression contient au moins un crit\u00e8re d'\u00e9volution fig\u00e9, elle ne peut donc pas \u00eatre utilis\u00e9e pour la d\u00e9finition d'applicabilit\u00e9/d'effectivit\u00e9. Veuillez mettre \u00e0 jour l'expression pour enlever les \u00e9l\u00e9ments fig\u00e9s
Expression.Error.FailedToRetrieveFrozenFilterOfModels= Impossible de r\u00e9aliser cette op\u00e9ration. Certains mod\u00e8les utilis\u00e9s pour v\u00e9rifier la validit\u00e9 de l'op\u00e9ration semblent ne pas exister
Expression.Error.FailedToDetermineWhetherToDoImmutabilityChecks= Impossible de d\u00e9terminer si les r\u00e8gles d'immunit\u00e9 doivent \u00eatre respect\u00e9es, car certains objets ne se situent pas dans les m\u00eames espaces de collaboration 
Expression.Error.DeniedModelFilters= Impossible d'effectuer cette op\u00e9ration. Au moins un mod\u00e8le joint est inaccessible, car il appartient \u00e0 un espace de collaboration restreint
Expression.Error.FrozenEffCannotBeUnset= Nous ne pouvons pas annuler l'effectivit\u00e9 au risque d'enlever les crit\u00e8res fig\u00e9s de la pi\u00e8ce d'\u00e9volution

# Static Mapping
StaticMapping.Error.Disabled= La cartographie statique est d\u00e9sactiv\u00e9e dans cet environnement
StaticMapping.Error.FrozenInstanceCantCreateStaticMapping= Impossible de cr\u00e9er un mappage statique sur cette instance, car cette derni\u00e8re est fig\u00e9e
StaticMapping.Error.FrozenInstanceCantDeleteStaticMapping= Impossible de supprimer le mappage statique sur cette instance, car cette derni\u00e8re est fig\u00e9e
StaticMapping.Error.FrozenInstanceCantChangeStaticMapping= Impossible de modifier le mappage statique sur cette instance, car cette derni\u00e8re est fig\u00e9e
StaticMapping.Error.FrozenInstanceCantChangeFilterUsedByStaticMapping= Impossible de modifier le filtre utilis\u00e9 par le mappage statique sur cette instance, car cette derni\u00e8re est fig\u00e9e
StaticMapping.Error.FrozenInstanceCantUpdatePC= Impossible de mettre \u00e0 jour la configuration de produit, car elle est utilis\u00e9e dans des mappages statiques transmis par des instances fig\u00e9es

# Granular reject
Expression.Error.CANotRejectableForEffectivities= L'action de modification <name> ne peut pas \u00eatre rejet\u00e9e pour au moins l'une de ces instances
Expression.Error.OperationForbiddenWithAlreadyRejectedCA= L'op\u00e9ration ne peut pas \u00eatre ex\u00e9cut\u00e9e avec une action de modification ayant \u00e9t\u00e9 rejet\u00e9e pour les instances donn\u00e9es.

# Configured Operations
Expression.Error.SplitUnderCACannotBeDoneOnVarOnlyStructure= L'op\u00e9ration de s\u00e9paration sous l'action de modification ne peut pas \u00eatre ex\u00e9cut\u00e9e sur une structure uniquement compos\u00e9e de variantes ;
CfgOperation.Error.EffectivityCannotBeExtended= L'op\u00e9ration Etendre n'est applicable que sur l'effectivit\u00e9 avec une expression d'\u00e9volution.
CfgOperation.Error.Extend.InstanceWithoutEffectivity= L'op\u00e9ration Etendre ne peut pas \u00eatre effectu\u00e9e sur des instances sans effectivit\u00e9s
CfgOperation.Error.Extend.ExpressionTrue= L'op\u00e9ration Etendre ne peut pas \u00eatre effectu\u00e9e sur des instances toujours valides
CfgOperation.Error.Extend.VariantOnlyEffectivity= L'op\u00e9ration Etendre ne peut pas \u00eatre effectu\u00e9e sur des instances qui n'ont qu'une pi\u00e8ce de variante dans leurs effectivit\u00e9s, car elles sont toujours valides
CfgOperation.Error.Extend.UselessExtension= Les instances ne peuvent pas \u00eatre \u00e9tendues par une plage de validit\u00e9 qui est totalement contenue dans leur plage de validit\u00e9 existante
CfgOperation.Error.Reparent.CriterionNotEnabledOnParentRefOfDuplicate= Le crit\u00e8re <critType> n'est pas activ\u00e9 sur la nouvelle r\u00e9f\u00e9rence parentale <name>, mais ce crit\u00e8re est utilis\u00e9 dans les effectivit\u00e9s.
CfgOperation.Error.Reparent.ConfigContextsNotCoherentSourceTarget= Un mod\u00e8le est utilis\u00e9 dans l'efficacit\u00e9 du filtre d'origine qui n'est pas associ\u00e9 \u00e0 la r\u00e9f\u00e9rence parent du filtre. Nous ne pouvons pas copier l'effectivit\u00e9 et modifier le parent
CfgOperation.Error.Reparent.NoModelAttachedOnTarget= Il n'y a aucun mod\u00e8le associ\u00e9 \u00e0 la r\u00e9f\u00e9rence parent <name> du filtre, nous ne pouvons pas copier l'effectivit\u00e9 et modifier le parent

# Work Under
Change.Error.ParentPartIsNotCompliantWithChange= La modification utilis\u00e9e comme 'Travail sous' utilise des mod\u00e8les indisponibles dans le contexte de configuration de la pi\u00e8ce parent.
Change.Error.ChangeApplicabilityIsEmptyAtFinalize= L'expression d'applicabilit\u00e9 est vide mais il existe des \u00e9l\u00e9ments concern\u00e9s \u00e0 mettre \u00e0 jour.
Change.Error.ApplicabilityRead= Erreur lors de la lecture de l'applicabilit\u00e9
Change.Error.ApplicabilityWrite= Erreur lors de l'\u00e9criture de l'applicabilit\u00e9, l'utilisateur n'a peut-\u00eatre pas le droit de modifier l'applicabilit\u00e9
Change.Error.Applicability.Finalization.Models= Impossible de finaliser l'\u00e9l\u00e9ment <type>, car tous ses mod\u00e8les ne sont pas attach\u00e9s \u00e0 la r\u00e9f\u00e9rence 
Change.Error.Applicability.Finalization.RefModels= Impossible de finaliser l'\u00e9l\u00e9ment <type>, car tous les mod\u00e8les de la r\u00e9f\u00e9rence ne sont pas attach\u00e9s \u00e0 l'action de modification 
Change.Error.FalseExpression= Un mod\u00e8le est d\u00e9fini dans l'applicabilit\u00e9 de l'action de modification mais aucune applicabilit\u00e9 exacte n'est d\u00e9finie.
Change.Error.FinalState= L'expression d'applicabilit\u00e9 est d\u00e9j\u00e0 dans un \u00e9tat final.
Change.Error.EmptyExpression= L'expression d'applicabilit\u00e9 est vide.
AuthContext.Error.ContainsFrozen= L'expression Contexte de cr\u00e9ation contient des crit\u00e8res fig\u00e9s
AuthContext.Error.NoIntersectionInstanceVsAC= Le contexte de cr\u00e9ation d\u00e9finit une expression qui ne peut pas \u00eatre appliqu\u00e9e \u00e0 la r\u00e9f\u00e9rence enfant <name> (<marketingName>) car cette expression ne partage aucune plage de validit\u00e9 avec celle de la r\u00e9f\u00e9rence enfant
