#
#   ExpressionStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program

#   static const char RCSID[] = "$Id: ExpressionStringResource.properties.rca  $"
#

# --- General

General.Model= Modello
General.ModelVersion= Versione modello

# Criteria
Criteria.Date= Data
Criteria.Products= Prodotti
Criteria.ManufacturingPlans= Piani di produzione
Criteria.Unit= Unit\u00e0
Criteria.Milestone= Milestone
Criteria.FeatureOption= Varianti e opzioni


# --- Success

# Effectivity
Effectivity.Success.SetEvolutionOperationSuccess= La validit\u00e0 dell'evoluzione \u00e8 stata impostata correttamente.


# --- Errors

Error.InternalServerError= errore interno

# General
General.Error.InvalidCategoryTypeSetting= Tipo di categoria non valido. Selezionare impostazioni valide del tipo di categoria.
General.Range.Error.SequenceValues= Inserisci come intervallo richiede uno o due valori di sequenza. Il numero di valori di sequenza trovati \u00e8: 
General.Range.Error.DatesValues= Inserisci come intervallo richiede una o due date. Il numero di valori di date trovati \u00e8: 
General.Error.UnsupportedDateWithRelational= Data non supportata con il tipo di validit\u00e0 Relazionale. Rimuovere uno dei tipi di validit\u00e0 dalla propriet\u00e0 admin per questa relazione o tipo.
General.Error.UnsupportedGlobalWithMultipleContexts= Impossibile combinare il contesto di configurazione globale con un altro contesto di configurazione nella stessa espressione. Rimuovere il contesto di configurazione globale o tutti gli altri contesti di configurazione.
General.Error.TimeOut= Il comando ha impiegato troppo tempo per ottenere tutte le informazioni necessarie. Riprovare o contattare l'amministratore per assistenza.

# Criteria
Criteria.Error.UnsupportedCriteriaType= Tipo di criteri non supportato. Specificare un tipo di criteri supportato.
Criteria.Error.TypeNotAModel= non \u00e8 un tipo di modello
Criteria.Error.TypeNotAModelVersion= non \u00e8 un tipo di versione del modello
Criteria.Error.NoAccessToModel= \u00e8 un modello a cui l'utente non ha accesso
Criteria.Error.DeletedObject= \u00e8 un oggetto eliminato

# Effectivity
Effectivity.Error.MismatchEffectivityTypesAndExpression_bus= L'espressione di validit\u00e0 contiene alcuni tipi di validit\u00e0 che non sono stati applicati a questo oggetto.
Effectivity.Error.NoEffectivityTypeFound= Nessun tipo di validit\u00e0 trovato. Usare un tipo di validit\u00e0 valido, come definito nello schema.
Effectivity.Error.EffectivityUsageCannotDelete= L'oggetto \u00e8 usato in una espressione di validit\u00e0 e non pu\u00f2 essere eliminato. Rimuovere l'oggetto da tutte le espressioni di validit\u00e0 per consentirne l'eliminazione.
Effectivity.FalseExpression.Display= Non valida
Effectivity.TrueExpression.Display= Valido
Effectivity.Error.OnlyEvolutionEffectivity= Questa istanza ha solo il valore di validit\u00e0 del dominio Evoluzione.
Effectivity.Error.EffectivityUsageCannotRemoveObject= L'oggetto <object_type> <object_name> \u00e8 usato in un'espressione di configurazione (Filtro, Validit\u00e0...) e non pu\u00f2 essere rimosso. Rimuovere l'oggetto da tutte le espressioni di configurazione per consentirne la rimozione.
Effectivity.Error.EffectivityUsageCannotModifyObject= L'oggetto <object_type> <object_name> \u00e8 usato in un'espressione di configurazione (Filtro, Validit\u00e0...) e non pu\u00f2 essere modificato. Rimuovere l'oggetto da tutte le espressioni di configurazione per consentirne la modifica.
Effectivity.Error.ChangeApplicabilityAndEffectivitieDoNotIntersect= Impossibile modificare la validit\u00e0 perch\u00e9 l'espressione non si interseca con l'applicabilit\u00e0. Utilizzare un'istanza evoluta per modificare la validit\u00e0 della variante.
Effectivity.Error.ChangeApplicabilityAndEffectivitieAreEqual= L'espressione di Validit\u00e0 \u00e8 uguale all'Applicabilit\u00e0: impossibile applicare questa operazione.
Effectivity.Error.Unset.NoEffectivity= Questa istanza manca del valore di validit\u00e0, annulla impostazione \u00e8 inutile

# Expression
Expression.Error.MissingAttachedModels= Non tutti i modelli necessari sono associati nel riferimento padre.  
Expression.Error.MissingAttachedXRev= Il grafico associato al riferimento padre \u00e8 diverso da quello specificato in Lavora in.  
Effectivity.Error.ParentNotAttachedAllModelsFromAC= Il riferimento padre non ha tutti i modelli collegati dal contesto di creazione.
Effectivity.Error.ParentNotEnabledAllCriteriaFromAC= Il riferimento padre non ha tutti i criteri attivati dal contesto di creazione.
Expression.Error.InvalidExpression= Espressione effettiva non valida

# Reference
Expression.Error.AttachContextDeniedSinceReferenceIsRevised= L'associazione del contesto di configurazione non \u00e8 supportata su un oggetto revisionato. Associazione di <modelType> non riuscita
Expression.Error.CriterionInXMLButNotEnabled= L'XML di input contiene <critType> ma questo criterio non \u00e8 abilitato nel riferimento <name>
Expression.Error.CriteriaNotDisabled= Impossibile disattivare i criteri sugli oggetti poich\u00e9 per una o pi\u00f9 istanze \u00e8 stata definita la validit\u00e0 dei criteri <critType>
Expression.Error.LastCriteriaCannotBeDisabled= Impossibile disattivare i criteri sugli oggetti perch\u00e9 non sarebbe attivato alcun altro criterio quando vi \u00e8 ancora almeno un modello associato
Expression.Error.EvolCriteriaCannotBeDisabled.FrozenInstance= Il criterio di evoluzione non pu\u00f2 essere disattivato perch\u00e9 contiene alcuni elementi congelati che sono validi per almeno un'istanza
Expression.Error.EvolCriteriaCannotBeEnabled.FrozenInstance= Il criterio di evoluzione non pu\u00f2 essere attivato perch\u00e9 contiene alcuni elementi congelati che diventerebbero validi per almeno un'istanza
Expression.Error.DetachNotPossible.ConfigurationUsage= Impossibile disassociare il modello in quanto \u00e8 utilizzato da una configurazione
Expression.Error.DetachNotPossible.EffectivityUsage= Impossibile disassociare il modello in quanto \u00e8 utilizzato da una espressione di validit\u00e0
Expression.Error.DetachNotPossible.ConfigurationRevision= Impossibile scollegare il modello perch\u00e9 il riferimento ha revisioni di configurazione
Expression.Error.DetachNotPossible.FrozenInstancesDefinedWithModel= Impossibile disassociare il modello <marketingName> perch\u00e9 contiene criteri di evoluzione bloccati e almeno un'istanza nella struttura \u00e8 bloccata
Expression.Error.AttachNotPossible.InstanceBecomesValidForFrozenCriteria= Impossibile associare il modello <marketingName> perch\u00e9 contiene criteri di evoluzione bloccati. Se il modello viene associato, almeno un'istanza nella struttura diventer\u00e0 valida per i criteri bloccati
Expression.Error.AttachNotPossible.ObsoleteModel= Impossibile allegare il modello <marketingName> perch\u00e9 \u00e8 obsoleto
Expression.Error.ParentPartIsNotConfigured= La parte padre di una data relazione non ha un Contesto di configurazione.
Expression.Error.RefNotConfigured= Il riferimento <name> non \u00e8 configurato
Expression.Error.CriterionNotEnabled= Il criterio <critType> non \u00e8 abilitato nel riferimento <name>
Expression.Error.RefModelVarOnlyNotUniqueCannotAttachMoreModels= Non \u00e8 consentito allegare pi\u00f9 di 1 modello a un oggetto rivisto/derivato che abilita il criterio della variante
Expression.Error.ExplicitVarCannotBeSynchronized= Il riferimento <name> <type> \u00e8 esplicito ed \u00e8 collegato a una versione del modello. Impossibile sincronizzare riferimenti di questo tipo

# Immutability
Expression.Error.FrozenCriteriaInEffs= Impossibile alterare fisicamente le istanze perch\u00e9 la loro validit\u00e0 contiene almeno un criterio congelato. Utilizzare 'Lavora in'.
Expression.Error.FrozenCfgRevImpacted= Impossibile effettuare l'operazione: ha effetto su almeno una Revisione configurazione congelata
Expression.Error.FrozenRangeOfEffImpactedBySetExpression= Impossibile impostare le espressioni perch\u00e9 verrebbe aggiunto o rimosso almeno un criterio di evoluzione congelato per la validit\u00e0
Expression.Error.ExpressionContainsFrozen= L'espressione contiene almeno un criterio di evoluzione bloccato e non pu\u00f2, pertanto, essere utilizzata per la definizione di applicabilit\u00e0/validit\u00e0. Aggiornare l'espressione per rimuovere gli elementi bloccati
Expression.Error.FailedToRetrieveFrozenFilterOfModels= Impossibile effettuare questa operazione. Sembra che alcuni modelli utilizzati per verificare la validit\u00e0 dell'operazione non esistono
Expression.Error.FailedToDetermineWhetherToDoImmutabilityChecks= Impossibile determinare se rispettare o meno le regole di immutabilit\u00e0 perch\u00e9 alcuni oggetti non sono nelle stesse aree di collaborazione 
Expression.Error.DeniedModelFilters= Impossibile effettuare l'operazione. Almeno un modello allegato non \u00e8 accessibile perch\u00e9 appartiene a un'area di collaborazione con restrizioni
Expression.Error.FrozenEffCannotBeUnset= Impossibile annullare l'impostazione della validit\u00e0 perch\u00e9 comporterebbe la rimozione di criteri bloccati dalla parte di evoluzione

# Static Mapping
StaticMapping.Error.Disabled= Mappatura statica disattivata in questo ambiente
StaticMapping.Error.FrozenInstanceCantCreateStaticMapping= Impossibile creare un mapping statico su questa istanza perch\u00e9 quest'ultima \u00e8 congelata
StaticMapping.Error.FrozenInstanceCantDeleteStaticMapping= Impossibile eliminare il mapping statico su questa istanza perch\u00e9 quest'ultima \u00e8 congelata
StaticMapping.Error.FrozenInstanceCantChangeStaticMapping= Impossibile modificare il mapping statico su questa istanza perch\u00e9 quest'ultima \u00e8 congelata
StaticMapping.Error.FrozenInstanceCantChangeFilterUsedByStaticMapping= Impossibile modificare il filtro utilizzato dal mapping statico su questa istanza perch\u00e9 quest'ultima \u00e8 congelata
StaticMapping.Error.FrozenInstanceCantUpdatePC= Impossibile aggiornare la configurazione prodotto perch\u00e9 \u00e8 utilizzata nei mapping statici contenuti nelle istanze congelate

# Granular reject
Expression.Error.CANotRejectableForEffectivities= L'azione di modifica <name> non pu\u00f2 essere rifiutata per almeno una di queste istanze
Expression.Error.OperationForbiddenWithAlreadyRejectedCA= Impossibile eseguire l'operazione con un'azione di modifica rifiutata per le istanze specificate

# Configured Operations
Expression.Error.SplitUnderCACannotBeDoneOnVarOnlyStructure= L'operazione di divisione in Azione di modifica non pu\u00f2 essere eseguita in una struttura di sole varianti;
CfgOperation.Error.EffectivityCannotBeExtended= L'operazione di estensione \u00e8 applicabile solo alla validit\u00e0 con espressione di evoluzione.
CfgOperation.Error.Extend.InstanceWithoutEffectivity= Impossibile eseguire l'operazione di estensione sulle istanze che non hanno validit\u00e0
CfgOperation.Error.Extend.ExpressionTrue= Impossibile eseguire l'operazione di estensione sulle istanze sempre valide
CfgOperation.Error.Extend.VariantOnlyEffectivity= Impossibile eseguire l'operazione di estensione sulle istanze che hanno solo una variante nella loro validit\u00e0 perch\u00e9 sono sempre valide
CfgOperation.Error.Extend.UselessExtension= Impossibile estendere le istanze da un intervallo di validit\u00e0 interamente contenuto nel relativo intervallo di validit\u00e0 esistente
CfgOperation.Error.Reparent.CriterionNotEnabledOnParentRefOfDuplicate= Il criterio <critType> non \u00e8 attivato sul nuovo riferimento padre <name>, ma viene utilizzato nelle validit\u00e0
CfgOperation.Error.Reparent.ConfigContextsNotCoherentSourceTarget= Un modello utilizzato nella validit\u00e0 dell'elemento filtrabile originale non \u00e8 associato al riferimento padre dell'elemento filtrabile. Impossibile copiare la validit\u00e0 e ripristinare l'associazione al padre
CfgOperation.Error.Reparent.NoModelAttachedOnTarget= Nessun modello \u00e8 collegato al riferimento padre <name> dell'elemento filtrabile. Impossibile copiare la validit\u00e0 e ripristinare l'associazione al padre

# Work Under
Change.Error.ParentPartIsNotCompliantWithChange= La modifica utilizzata come 'Lavoro sotto' utilizza modelli che non sono disponibili sul contesto di configurazione della parte padre.
Change.Error.ChangeApplicabilityIsEmptyAtFinalize= L'espressione di applicabilit\u00e0 \u00e8 vuota ma esistono elementi interessati da aggiornare.
Change.Error.ApplicabilityRead= Errore durante la lettura dell'applicabilit\u00e0
Change.Error.ApplicabilityWrite= Errore durante la scrittura dell'applicabilit\u00e0, forse l'utente non ha il diritto di modificare l'applicabilit\u00e0
Change.Error.Applicability.Finalization.Models= Impossibile completare <type> perch\u00e9 non tutti i relativi modelli sono collegati nel riferimento 
Change.Error.Applicability.Finalization.RefModels= Impossibile completare <type> perch\u00e9 non tutti i modelli del riferimento sono collegati nell'azione di modifica 
Change.Error.FalseExpression= Un modello \u00e8 definito nell'applicabilit\u00e0 dell'azione di modifica, ma non \u00e8 definita un'applicabilit\u00e0 esatta.
Change.Error.FinalState= L'espressione di applicabilit\u00e0 \u00e8 gi\u00e0 in uno stato finale.
Change.Error.EmptyExpression= L'espressione di applicabilit\u00e0 \u00e8 vuota.
AuthContext.Error.ContainsFrozen= L'espressione di contesto creazione contiene alcuni criteri congelati
AuthContext.Error.NoIntersectionInstanceVsAC= Il Contesto di creazione definisce un'espressione che non pu\u00f2 essere applicata al riferimento figlio <name> (<marketingName>) perch\u00e9 questa espressione non condivide alcun intervallo di validit\u00e0 con quello del riferimento figlio
