#
#   ExpressionStringResource.properties -- Properties file.
#
#   Copyright (c) 1992-2015 Dassault Systemes.
#   All Rights Reserved.
#   This program contains proprietary and trade secret information of MatrixOne,
#   Inc.  Copyright notice is precautionary only
#   and does  not evidence any actual or intended publication of such program

#   static const char RCSID[] = "$Id: ExpressionStringResource.properties.rca  $"
#

# --- General

General.Model= \ubaa8\ub378
General.ModelVersion= \ubaa8\ub378 \ubc84\uc804

# Criteria
Criteria.Date= \ub0a0\uc9dc
Criteria.Products= \uc81c\ud488
Criteria.ManufacturingPlans= \uc81c\uc870 \uacc4\ud68d
Criteria.Unit= \ub2e8\uc704
Criteria.Milestone= \ub9c8\uc77c\uc2a4\ud1a4
Criteria.FeatureOption= \ud30c\uc0dd \ubc0f \uc635\uc158


# --- Success

# Effectivity
Effectivity.Success.SetEvolutionOperationSuccess= \uc804\uac1c \uc720\ud6a8\uc131 \uc791\uc5c5\uc744 \uc124\uc815\ud588\uc2b5\ub2c8\ub2e4.


# --- Errors

Error.InternalServerError= \ub0b4\ubd80 \uc624\ub958

# General
General.Error.InvalidCategoryTypeSetting= \ubc94\uc8fc \uc720\ud615\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc62c\ubc14\ub978 \ubc94\uc8fc \uc720\ud615 \uc124\uc815\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
General.Range.Error.SequenceValues= \ubc94\uc704\ub85c \uc0bd\uc785\ud558\ub824\uba74 \ud558\ub098 \ub610\ub294 \ub450 \uac1c\uc758 \uc21c\uc11c \uac12\uc774 \ud544\uc694\ud569\ub2c8\ub2e4. \ucc3e\uc740 \uc21c\uc11c \uac12 \uac1c\uc218: 
General.Range.Error.DatesValues= \ubc94\uc704\ub85c \uc0bd\uc785\ud558\ub824\uba74 \ud558\ub098 \ub610\ub294 \ub450 \uac1c\uc758 \ub0a0\uc9dc\uac00 \ud544\uc694\ud569\ub2c8\ub2e4. \ucc3e\uc740 \ub0a0\uc9dc \uac12 \uac1c\uc218: 
General.Error.UnsupportedDateWithRelational= \uad00\uacc4 \uc720\ud6a8\uc131 \uc720\ud615\uc5d0\uc11c \ub0a0\uc9dc\uac00 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc774 \uad00\uacc4 \ub610\ub294 \uc720\ud615\uc5d0 \ub300\ud55c \uad00\ub9ac \uc18d\uc131\uc5d0\uc11c \uc720\ud6a8\uc131 \uc720\ud615 \uc911 \ud558\ub098\ub97c \uc81c\uac70\ud558\uc2ed\uc2dc\uc624.
General.Error.UnsupportedGlobalWithMultipleContexts= \uae00\ub85c\ubc8c \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\ub97c \ub3d9\uc77c\ud55c \ud45c\ud604\uc2dd\uc758 \ub2e4\ub978 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\uc640 \uacb0\ud569\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uae00\ub85c\ubc8c \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8 \ub610\ub294 \ub2e4\ub978 \ubaa8\ub4e0 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\ub97c \uc81c\uac70\ud558\uc2ed\uc2dc\uc624.
General.Error.TimeOut= \uba85\ub839\uc774 \ud544\uc694\ud55c \ubaa8\ub4e0 \uc815\ubcf4\ub97c \uc5bb\ub294 \ub370 \ub108\ubb34 \uc624\ub798 \uac78\ub838\uc2b5\ub2c8\ub2e4. \ub2e4\uc2dc \uc2dc\ub3c4\ud558\uac70\ub098 \uad00\ub9ac\uc790\uc5d0\uac8c \ub3c4\uc6c0\uc744 \uc694\uccad\ud558\uc2ed\uc2dc\uc624.

# Criteria
Criteria.Error.UnsupportedCriteriaType= \uae30\uc900 \uc720\ud615\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc9c0\uc6d0\ub418\ub294 \uae30\uc900 \uc720\ud615\uc744 \uc9c0\uc815\ud558\uc2ed\uc2dc\uc624.
Criteria.Error.TypeNotAModel= \ubaa8\ub4dc \uc720\ud615\uc774 \uc544\ub2d8
Criteria.Error.TypeNotAModelVersion= \ubaa8\ub378 \ubc84\uc804 \uc720\ud615\uc774 \uc544\ub2d8
Criteria.Error.NoAccessToModel= \uc740(\ub294) \uc0ac\uc6a9\uc790\uac00 \uc561\uc138\uc2a4\ud560 \uc218 \uc5c6\ub294 \ubaa8\ub378\uc785\ub2c8\ub2e4.
Criteria.Error.DeletedObject= \uc740(\ub294) \uc0ad\uc81c\ub41c \uac1c\uccb4\uc785\ub2c8\ub2e4.

# Effectivity
Effectivity.Error.MismatchEffectivityTypesAndExpression_bus= \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc774 \uc774 \uac1c\uccb4\uc5d0 \uc801\uc6a9\ub418\uc9c0 \uc54a\ub294 \uc77c\ubd80 \uc720\ud6a8\uc131 \uc720\ud615\uc744 \ud3ec\ud568\ud569\ub2c8\ub2e4.
Effectivity.Error.NoEffectivityTypeFound= \uc720\ud6a8\uc131 \uc720\ud615\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc2a4\ud0a4\ub9c8\uc5d0 \uc815\uc758\ub41c \ub300\ub85c \uc62c\ubc14\ub978 \uc720\ud6a8\uc131 \uc720\ud615\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
Effectivity.Error.EffectivityUsageCannotDelete= \uac1c\uccb4\uac00 \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc5d0\uc11c \uc0ac\uc6a9 \uc911\uc774\ubbc0\ub85c \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc0ad\uc81c\ud558\ub824\uba74 \ubaa8\ub4e0 \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc5d0\uc11c \uac1c\uccb4\ub97c \uc81c\uac70\ud558\uc2ed\uc2dc\uc624.
Effectivity.FalseExpression.Display= \uc62c\ubc14\ub974\uc9c0 \uc54a\uc74c
Effectivity.TrueExpression.Display= \uc720\ud6a8\ud568
Effectivity.Error.OnlyEvolutionEffectivity= \uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0\ub294 \uc804\uac1c \ub3c4\uba54\uc778 \uc720\ud6a8\uc131\ub9cc \uc788\uc2b5\ub2c8\ub2e4.
Effectivity.Error.EffectivityUsageCannotRemoveObject= <object_type> <object_name>\uc774(\uac00) \uad6c\uc131\ub41c \ud45c\ud604\uc2dd(\ud544\ud130, \uc720\ud6a8\uc131 \ub4f1)\uc5d0\uc11c \uc0ac\uc6a9 \uc911\uc774\ubbc0\ub85c \uc81c\uac70\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc81c\uac70\ud558\ub824\uba74 \uad6c\uc131\ub41c \ubaa8\ub4e0 \ud45c\ud604\uc2dd\uc5d0\uc11c \uae30\uc900\uc744 \uc81c\uac70\ud558\uc2ed\uc2dc\uc624.
Effectivity.Error.EffectivityUsageCannotModifyObject= <object_type> <object_name>\uc774(\uac00) \uad6c\uc131\ub41c \ud45c\ud604\uc2dd(\ud544\ud130, \uc720\ud6a8\uc131 \ub4f1)\uc5d0\uc11c \uc0ac\uc6a9 \uc911\uc774\ubbc0\ub85c \uc218\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc218\uc815\ud558\ub824\uba74 \uad6c\uc131\ub41c \ubaa8\ub4e0 \ud45c\ud604\uc2dd\uc5d0\uc11c \uae30\uc900\uc744 \uc81c\uac70\ud558\uc2ed\uc2dc\uc624.
Effectivity.Error.ChangeApplicabilityAndEffectivitieDoNotIntersect= \ud45c\ud604\uc2dd\uc774 \uc801\uc6a9\uc131\uacfc \uad50\ucc28\ud558\uc9c0 \uc54a\uc73c\ubbc0\ub85c \uc720\ud6a8\uc131\uc744 \ud3b8\uc9d1\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc804\uac1c\ub41c \uc778\uc2a4\ud134\uc2a4\ub97c \uc0ac\uc6a9\ud558\uc5ec \ud30c\uc0dd \uc720\ud6a8\uc131\uc744 \uc218\uc815\ud569\ub2c8\ub2e4.
Effectivity.Error.ChangeApplicabilityAndEffectivitieAreEqual= \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc774 \uc801\uc6a9\uc131\uacfc \uac19\uc74c: \uc774 \uc791\uc5c5\uc744 \uc801\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Effectivity.Error.Unset.NoEffectivity= \uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc720\ud6a8\uc131\uc774 \uc5c6\uc74c, \uc124\uc815 \ud574\uc81c\ud574\ub3c4 \uc18c\uc6a9 \uc5c6\uc74c

# Expression
Expression.Error.MissingAttachedModels= \ud544\uc694\ud55c \uc77c\ubd80 \ubaa8\ub378\uc774 \uc0c1\uc704 \ucc38\uc870\uc5d0 \ucca8\ubd80\ub418\uc5b4 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.  
Expression.Error.MissingAttachedXRev= \uc0c1\uc704 \ucc38\uc870\uc5d0 \ucca8\ubd80\ub41c \uadf8\ub798\ud504\uac00 \uc791\uc5c5 \uc870\uac74\uc5d0 \uc9c0\uc815\ub41c \uadf8\ub798\ud504\uc640 \ub2e4\ub985\ub2c8\ub2e4.  
Effectivity.Error.ParentNotAttachedAllModelsFromAC= \uc0c1\uc704 \ucc38\uc870\uc5d0\uc11c \uc77c\ubd80 \ubaa8\ub378\uc740 \uc791\uc131 \ucee8\ud14d\uc2a4\ud2b8\uc5d0\uc11c \uc5f0\uacb0\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
Effectivity.Error.ParentNotEnabledAllCriteriaFromAC= \uc0c1\uc704 \ucc38\uc870\uc5d0\uc11c \uc77c\ubd80 \uae30\uc900\uc740 \uc791\uc131 \ucee8\ud14d\uc2a4\ud2b8\uc5d0\uc11c \uc0ac\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Expression.Error.InvalidExpression= \uc2e4\uc81c \ud45c\ud604\uc2dd\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

# Reference
Expression.Error.AttachContextDeniedSinceReferenceIsRevised= \uc218\uc815\ub41c \uac1c\uccb4\uc5d0\uc11c\ub294 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8 \uc5f0\uacb0\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. <modelType> \ucca8\ubd80\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
Expression.Error.CriterionInXMLButNotEnabled= \uc785\ub825 XML\uc5d0 <critType>\uc774(\uac00)\ud3ec\ud568\ub418\uc9c0\ub9cc \uc774 \uae30\uc900\uc740 \ucc38\uc870 <name>\uc5d0\uc11c \ud65c\uc131\ud654\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
Expression.Error.CriteriaNotDisabled= \ud558\ub098 \uc774\uc0c1\uc758 \uc778\uc2a4\ud134\uc2a4\uc5d0 <critType> \uc720\ud6a8\uc131\uc774 \uc815\uc758\ub418\uc5b4 \uc788\uc73c\ubbc0\ub85c, \uac1c\uccb4\uc5d0 \ub300\ud55c \uae30\uc900\uc744 \ube44\ud65c\uc131\ud654\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
Expression.Error.LastCriteriaCannotBeDisabled= \uc544\uc9c1 \ud558\ub098 \uc774\uc0c1\uc758 \ubaa8\ub378\uc774 \ucca8\ubd80\ub418\uc5b4 \uc788\uc9c0\ub9cc \ub354 \uc774\uc0c1 \uae30\uc900\uc774 \ud65c\uc131\ud654\ub418\uc9c0 \uc54a\uc73c\ubbc0\ub85c \uac1c\uccb4\uc5d0 \ub300\ud55c \uae30\uc900\uc744 \ube44\ud65c\uc131\ud654\ud558\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
Expression.Error.EvolCriteriaCannotBeDisabled.FrozenInstance= \uc804\uac1c \uae30\uc900\uc5d0\ub294 \ud558\ub098 \uc774\uc0c1\uc758 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc720\ud6a8\ud55c \uc77c\ubd80 \ub3d9\uacb0\ub41c \uc694\uc18c\uac00 \uc788\uc73c\ubbc0\ub85c \ube44\ud65c\uc131\ud654\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.EvolCriteriaCannotBeEnabled.FrozenInstance= \uc804\uac1c \uae30\uc900\uc5d0\ub294 \ud558\ub098 \uc774\uc0c1\uc758 \uc778\uc2a4\ud134\uc2a4\uc5d0 \uc720\ud6a8\ud558\uac8c \ub418\ub294 \uc77c\ubd80 \ub3d9\uacb0\ub41c \uc694\uc18c\uac00 \uc788\uc73c\ubbc0\ub85c \ud65c\uc131\ud654\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.DetachNotPossible.ConfigurationUsage= \uc0ac\uc591\uc5d0\uc11c \uc0ac\uc6a9 \uc911\uc774\ubbc0\ub85c \ubaa8\ub378\uc744 \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.DetachNotPossible.EffectivityUsage= \ubaa8\ub378\uc774 \uc720\ud6a8\uc131 \ud45c\ud604\uc2dd\uc5d0\uc11c \uc0ac\uc6a9\ub418\ubbc0\ub85c \ubaa8\ub378\uc744 \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc74c
Expression.Error.DetachNotPossible.ConfigurationRevision= \ucc38\uc870\uc5d0 ConfigurationRevisions\uc774 \uc788\uc73c\ubbc0\ub85c \ubaa8\ub378\uc744 \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc74c
Expression.Error.DetachNotPossible.FrozenInstancesDefinedWithModel= \ubaa8\ub378 <marketingName>\uc740(\ub294) \ub3d9\uacb0 \uc804\uac1c \uae30\uc900\uc744 \ud3ec\ud568\ud558\uace0 \uc788\uace0 \uad6c\uc870\uc5d0\uc11c \ucd5c\uc18c \ud558\ub098\uc758 \uc778\uc2a4\ud134\uc2a4\uac00 \ub3d9\uacb0\ub418\uc5b4 \uc788\uc73c\ubbc0\ub85c \ubd84\ub9ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.AttachNotPossible.InstanceBecomesValidForFrozenCriteria= \ubaa8\ub378 <marketingName>\uc740(\ub294) \ub3d9\uacb0 \uc804\uac1c \uae30\uc900\uc744 \ud3ec\ud568\ud558\uace0 \uc788\uc73c\uba70, \uad6c\uc870\uc758 \uc778\uc2a4\ud134\uc2a4\uac00 \ud558\ub098 \uc774\uc0c1 \uc5f0\uacb0\ub418\uba74 \uc774\ub7ec\ud55c \ub3d9\uacb0 \uae30\uc900\uc5d0 \ub300\ud574 \uc720\ud6a8\ud558\uae30 \ub54c\ubb38\uc5d0 \uc5f0\uacb0\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.AttachNotPossible.ObsoleteModel= \ubaa8\ub378 <marketingName>\uc774(\uac00) \ud3d0\uae30\ub418\uc5c8\uc73c\ubbc0\ub85c \ucca8\ubd80\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.ParentPartIsNotConfigured= \uc9c0\uc815\ub41c \uad00\uacc4\uc758 \uc0c1\uc704 \ubd80\ubd84\uc5d0 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.RefNotConfigured= \ucc38\uc870 <name>\uc774(\uac00) \uc124\uc815\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
Expression.Error.CriterionNotEnabled= \uae30\uc900 <critType>\uc740(\ub294) \ucc38\uc870 <name>\uc5d0\uc11c \ud65c\uc131\ud654\ub418\uc9c0 \uc54a\uc74c
Expression.Error.RefModelVarOnlyNotUniqueCannotAttachMoreModels= \ud30c\uc0dd \uae30\uc900\uc744 \ud65c\uc131\ud654\ud558\ub294 \uac1c\uc815/\ud30c\uc0dd\ub41c \uac1c\uccb4\uc5d0\uc11c\ub294 \ud558\ub098 \uc774\uc0c1\uc758 \ubaa8\ub378 \ucca8\ubd80\uac00 \ud5c8\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Expression.Error.ExplicitVarCannotBeSynchronized= \ucc38\uc870 <name> <type>\uc740(\ub294) \uba85\uc2dc\uc801\uc774\uba70, \ubaa8\ub378 \ubc84\uc804\uc744 \ucca8\ubd80\ud569\ub2c8\ub2e4. \uc774\ub7ec\ud55c \ucc38\uc870\ub294 \ub3d9\uae30\ud654\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

# Immutability
Expression.Error.FrozenCriteriaInEffs= \uc778\uc2a4\ud134\uc2a4\uc758 \uc720\ud6a8\uc131\uc5d0 \ub3d9\uacb0\ub41c \uae30\uc900\uc774 \ud558\ub098 \uc774\uc0c1 \ub4e4\uc5b4 \uc788\uc73c\ubbc0\ub85c, \uc778\uc2a4\ud134\uc2a4\ub97c \ubb3c\ub9ac\uc801\uc73c\ub85c \ubcc0\uacbd\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. '\uc791\uc5c5 \uc870\uac74'\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
Expression.Error.FrozenCfgRevImpacted= \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc74c: \ud558\ub098 \uc774\uc0c1\uc758 \ub3d9\uacb0\ub41c \uc0ac\uc591 \ub9ac\ube44\uc804\uc5d0 \uc601\ud5a5\uc744 \uc90d\ub2c8\ub2e4.
Expression.Error.FrozenRangeOfEffImpactedBySetExpression= \uc720\ud6a8\uc131\uc5d0 \ud558\ub098 \uc774\uc0c1\uc758 \ub3d9\uacb0\ub41c \uc804\uac1c \uae30\uc900\uc744 \ucd94\uac00\ud558\uac70\ub098 \uc81c\uac70\ud560 \uc218 \uc788\uae30 \ub54c\ubb38\uc5d0 \ud45c\ud604\uc2dd\uc744 \uc124\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.ExpressionContainsFrozen= \ud45c\ud604\uc2dd\uc5d0 \ub3d9\uacb0\ub41c \uc804\uac1c \uae30\uc900\uc774 \ud558\ub098 \uc774\uc0c1 \ud3ec\ud568\ub418\uc5b4 \uc788\uc73c\ubbc0\ub85c \uc801\uc6a9 \uac00\ub2a5\uc131/\uc720\ud6a8\uc131 \uc815\uc758\uc5d0 \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ub3d9\uacb0\ub41c \uc694\uc18c\ub97c \uc81c\uac70\ud558\ub824\uba74 \ud45c\ud604\uc2dd\uc744 \uc5c5\ub370\uc774\ud2b8\ud558\uc2ed\uc2dc\uc624.
Expression.Error.FailedToRetrieveFrozenFilterOfModels= \uc774 \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc791\uc5c5\uc758 \uc720\ud6a8\uc131\uc744 \ud655\uc778\ud558\ub294 \ub370 \uc0ac\uc6a9\ub418\ub294 \uc77c\ubd80 \ubaa8\ub378\uc774 \uc874\uc7ac\ud558\uc9c0 \uc54a\ub294 \uac83\uc73c\ub85c \ub098\ud0c0\ub0a9\ub2c8\ub2e4.
Expression.Error.FailedToDetermineWhetherToDoImmutabilityChecks= \uc77c\ubd80 \uac1c\uccb4\uac00 \ub3d9\uc77c\ud55c \ud611\uc5c5 \uacf5\uac04\uc5d0 \uc788\uc9c0 \uc54a\uae30 \ub54c\ubb38\uc5d0 \ubd88\ubcc0\uc131 \uaddc\uce59\uc744 \uc900\uc218\ud560 \uac83\uc778\uc9c0 \uc5ec\ubd80\ub97c \uacb0\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. 
Expression.Error.DeniedModelFilters= \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc81c\ud55c\ub41c \ud611\uc5c5 \uacf5\uac04\uc5d0 \uc18d\ud574 \uc788\uae30 \ub54c\ubb38\uc5d0 \ud558\ub098 \uc774\uc0c1\uc758 \ucca8\ubd80\ub41c \ubaa8\ub378\uc5d0 \uc561\uc138\uc2a4\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.FrozenEffCannotBeUnset= \uc804\uac1c \ubd80\ud488\uc5d0\uc11c \ub3d9\uacb0\ub41c \uae30\uc900\uc774 \uc81c\uac70\ub418\ubbc0\ub85c, \uc720\ud6a8\uc131\uc758 \uc124\uc815\uc744 \ud574\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

# Static Mapping
StaticMapping.Error.Disabled= \uc774 \ud658\uacbd\uc5d0\uc11c \uc815\uc801 \ub9e4\ud551\uc774 \ube44\ud65c\uc131\ud654\ub429\ub2c8\ub2e4.
StaticMapping.Error.FrozenInstanceCantCreateStaticMapping= \uc774 \uc778\uc2a4\ud134\uc2a4\ub294 \ub3d9\uacb0\ub418\uc5b4 \uc788\uc73c\ubbc0\ub85c \uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c \uc815\uc801 \ub9e4\ud551\uc744 \uc0dd\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
StaticMapping.Error.FrozenInstanceCantDeleteStaticMapping= \uc774 \uc778\uc2a4\ud134\uc2a4\ub294 \ub3d9\uacb0\ub418\uc5b4 \uc788\uc73c\ubbc0\ub85c \uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c \uc815\uc801 \ub9e4\ud551\uc744 \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
StaticMapping.Error.FrozenInstanceCantChangeStaticMapping= \uc774 \uc778\uc2a4\ud134\uc2a4\ub294 \ub3d9\uacb0\ub418\uc5b4 \uc788\uc73c\ubbc0\ub85c \uc774 \uc778\uc2a4\ud134\uc2a4\uc5d0 \ub300\ud55c \uc815\uc801 \ub9e4\ud551\uc744 \ubcc0\uacbd\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
StaticMapping.Error.FrozenInstanceCantChangeFilterUsedByStaticMapping= \uc774 \uc778\uc2a4\ud134\uc2a4\ub294 \ub3d9\uacb0\ub418\uc5b4 \uc788\uc73c\ubbc0\ub85c \uc774 \uc778\uc2a4\ud134\uc2a4\uc758 \uc815\uc801 \ub9e4\ud551\uc5d0\uc11c \uc0ac\uc6a9\ud558\ub294 \ud544\ud130\ub97c \ubcc0\uacbd\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
StaticMapping.Error.FrozenInstanceCantUpdatePC= \ub3d9\uacb0 \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c \uc218\ud589\ud558\ub294 \uc815\uc801 \ub9e4\ud551\uc5d0 \uc0ac\uc6a9\ub418\uae30 \ub54c\ubb38\uc5d0 \uc81c\ud488 \uc0ac\uc591\uc744 \uc5c5\ub370\uc774\ud2b8\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

# Granular reject
Expression.Error.CANotRejectableForEffectivities= \uc774\ub7ec\ud55c \uc778\uc2a4\ud134\uc2a4 \uc911 \ud558\ub098 \uc774\uc0c1\uc5d0 \ub300\ud574 Change Action <name>\uc744(\ub97c) \uac70\ubd80\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
Expression.Error.OperationForbiddenWithAlreadyRejectedCA= \uc9c0\uc815\ub41c \uc778\uc2a4\ud134\uc2a4\uc5d0 \ub300\ud574 \uac70\ubd80\ub41c Change Action\uc73c\ub85c \uc791\uc5c5\uc744 \uc2e4\ud589\ud560 \uc218 \uc5c6\uc74c

# Configured Operations
Expression.Error.SplitUnderCACannotBeDoneOnVarOnlyStructure= Change Action \uc544\ub798\uc758 \ubd84\ud560 \uc791\uc5c5\uc740 \ud30c\uc0dd \uc804\uc6a9 \uad6c\uc870\uc5d0\uc11c \uc2e4\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
CfgOperation.Error.EffectivityCannotBeExtended= \ud655\uc7a5 \uc791\uc5c5\uc740 \uc804\uac1c \ud45c\ud604\uc2dd\uc744 \ud3ec\ud568\ud558\ub294 \uc720\ud6a8\uc131\uc5d0\ub9cc \uc801\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
CfgOperation.Error.Extend.InstanceWithoutEffectivity= \uc720\ud6a8\uc131\uc774 \uc5c6\ub294 \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c\ub294 \ud655\uc7a5 \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
CfgOperation.Error.Extend.ExpressionTrue= \ud56d\uc0c1 \uc720\ud6a8\ud55c \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c\ub294 \ud655\uc7a5 \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
CfgOperation.Error.Extend.VariantOnlyEffectivity= \ud56d\uc0c1 \uc720\ud6a8\ud558\uae30 \ub54c\ubb38\uc5d0 \uc720\ud6a8\uc131\uc5d0 \ud30c\uc0dd \ubd80\ubd84\ub9cc \uc788\ub294 \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c\ub294 \ud655\uc7a5 \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
CfgOperation.Error.Extend.UselessExtension= \uae30\uc874 \uc720\ud6a8 \ubc94\uc704\uc5d0 \uc644\uc804\ud788 \ud3ec\ud568\ub41c \uc720\ud6a8 \ubc94\uc704\ub85c \uc778\uc2a4\ud134\uc2a4\ub97c \ud655\uc7a5\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
CfgOperation.Error.Reparent.CriterionNotEnabledOnParentRefOfDuplicate= \uae30\uc900 <critType>\uc740(\ub294) \uc0c8 \uc0c1\uc704 \ucc38\uc870 <name>\uc5d0\uc11c \ud65c\uc131\ud654\ub418\uc9c0 \uc54a\uc558\uc9c0\ub9cc \uc774 \uae30\uc900\uc740 \uc720\ud6a8\uc131\uc5d0\uc11c \uc0ac\uc6a9\ub429\ub2c8\ub2e4.
CfgOperation.Error.Reparent.ConfigContextsNotCoherentSourceTarget= \uc6d0\ubcf8 \ud544\ud130\ub9c1 \uac00\ub2a5 \ud56d\ubaa9\uc758 \uc720\ud6a8\uc131\uc5d0 \uc0ac\uc6a9\ub418\ub294 \ubaa8\ub378\uc774 \ud544\ud130\ub9c1 \uac00\ub2a5 \ud56d\ubaa9\uc758 \uc0c1\uc704 \ucc38\uc870\uc5d0 \uc5f0\uacb0\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\uc131\uc744 \ubcf5\uc0ac\ud558\uc5ec \uc0c1\uc704 \ud56d\ubaa9 \uc7ac\uc9c0\uc815\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
CfgOperation.Error.Reparent.NoModelAttachedOnTarget= \ud544\ud130\ub9c1 \uac00\ub2a5 \ud56d\ubaa9\uc758 \uc0c1\uc704 \ucc38\uc870 <name>\uc5d0 \uc5f0\uacb0\ub41c \ubaa8\ub378\uc774 \uc5c6\uc2b5\ub2c8\ub2e4. \uc720\ud6a8\uc131\uc744 \ubcf5\uc0ac\ud558\uc5ec \uc0c1\uc704 \ud56d\ubaa9 \uc7ac\uc9c0\uc815\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

# Work Under
Change.Error.ParentPartIsNotCompliantWithChange= '\uc791\uc5c5 \uc911"\uc73c\ub85c \uc0ac\uc6a9\ub41c \ubcc0\uacbd\uc774 \uc0c1\uc704 \ubd80\ubd84\uc758 \uc0ac\uc591 \ucee8\ud14d\uc2a4\ud2b8\uc5d0\uc11c \uc0ac\uc6a9 \ubd88\uac00\ub2a5\ud55c \ubaa8\ub378\uc744 \uc0ac\uc6a9\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
Change.Error.ChangeApplicabilityIsEmptyAtFinalize= \uc801\uc6a9\uc131 \ud45c\ud604\uc2dd\uc774 \ube44\uc5b4 \uc788\uc9c0\ub9cc, \uc5c5\ub370\uc774\ud2b8\ud560 \uc601\ud5a5\uc744 \ubc1b\ub294 \ud56d\ubaa9\uc774 \uc788\uc2b5\ub2c8\ub2e4.
Change.Error.ApplicabilityRead= \uc801\uc6a9\uc131\uc744 \uc77d\ub294 \uc911 \uc624\ub958 \ubc1c\uc0dd
Change.Error.ApplicabilityWrite= \uc801\uc6a9\uc131\uc744 \uc791\uc131\ud558\ub294 \uc911 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4. \uc0ac\uc6a9\uc790\uc5d0\uac8c \uc801\uc6a9\uc131\uc744 \uc218\uc815\ud560 \uad8c\ud55c\uc774 \uc5c6\uc744 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.
Change.Error.Applicability.Finalization.Models= \ubaa8\ub4e0 \ubaa8\ub378\uc774 \ucc38\uc870\uc5d0 \ucca8\ubd80\ub418\uc9c0 \uc54a\uc558\uc73c\ubbc0\ub85c <type>\uc744(\ub97c) \uc644\ub8cc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. 
Change.Error.Applicability.Finalization.RefModels= \ucc38\uc870\uc758 \ubaa8\ub378\uc774 \ubaa8\ub450 Change Action\uc5d0 \ucca8\ubd80\ub41c \uac83\uc740 \uc544\ub2c8\ubbc0\ub85c <type>\uc744(\ub97c) \uc644\ub8cc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. 
Change.Error.FalseExpression= Change Action\uc758 \uc801\uc6a9 \uac00\ub2a5\uc131\uc5d0 \ubaa8\ub378\uc774 \uc815\uc758\ub418\uc5b4 \uc788\uc9c0\ub9cc \uc815\ud655\ud55c \uc801\uc6a9 \uac00\ub2a5\uc131\uc740 \uc815\uc758\ub418\uc5b4 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
Change.Error.FinalState= \uc801\uc6a9\uc131 \ud45c\ud604\uc2dd\uc774 \uc774\ubbf8 \ucd5c\uc885 \uc0c1\ud0dc\uc785\ub2c8\ub2e4.
Change.Error.EmptyExpression= \uc801\uc6a9\uc131 \ud45c\ud604\uc2dd\uc774 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
AuthContext.Error.ContainsFrozen= \uc791\uc131 \ucee8\ud14d\uc2a4\ud2b8 \ud45c\ud604\uc2dd\uc5d0 \uc77c\ubd80 \ub3d9\uacb0\ub41c \uae30\uc900\uc774 \ud3ec\ud568\ub428
AuthContext.Error.NoIntersectionInstanceVsAC= \uc791\uc131 \ucee8\ud14d\uc2a4\ud2b8\ub294 \ud558\uc704 \ucc38\uc870 <name>(<marketingName>)\uc5d0 \uc801\uc6a9\ud560 \uc218 \uc5c6\ub294 \ud45c\ud604\uc2dd\uc744 \uc815\uc758\ud569\ub2c8\ub2e4. \uc774 \ud45c\ud604\uc2dd\uc740 \ud558\uc704 \ucc38\uc870\uc640 \uc720\ud6a8 \ubc94\uc704\ub97c \uacf5\uc720\ud558\uc9c0 \uc54a\uae30 \ub54c\ubb38\uc785\ub2c8\ub2e4.
