Delete.WorkspaceGenericError=Nie mo\u017cesz usun\u0105\u0107 folderu zak\u0142adek, poniewa\u017c znajduje si\u0119 w nim zawarto\u015b\u0107 albo nie masz niezb\u0119dnych uprawnie\u0144.
Delete.WorkspaceContentError=Nie mo\u017cesz usun\u0105\u0107 folderu zak\u0142adek, poniewa\u017c znajduje si\u0119 w nim zawarto\u015b\u0107.
Delete.WorkspaceVaultGenericError=By\u0107 mo\u017ce nie masz wymaganych uprawnie\u0144 albo folder zak\u0142adek lub jeden z jego podrz\u0119dnych folder\u00f3w zak\u0142adek zawiera trasy b\u0105d\u017a dyskusje. Upewnij si\u0119, \u017ce masz wymagany zakres obowi\u0105zk\u00f3w i czy w folderze zak\u0142adek lub kt\u00f3rymkolwiek z jego podrz\u0119dnych folder\u00f3w zak\u0142adek nie znajduj\u0105 si\u0119 trasy b\u0105d\u017a dyskusje. 
Delete.WorkspaceVaultContentError=Nie mo\u017cesz usun\u0105\u0107 folderu zak\u0142adek, poniewa\u017c znajduje si\u0119 w nim zawarto\u015b\u0107.
Delete.DocumentGenericError=Nie mo\u017cna usun\u0105\u0107 dokumentu. Upewnij si\u0119, \u017ce dokument jest po\u0142\u0105czony ze zmian\u0105 oraz \u017ce masz niezb\u0119dne uprawnienia.
Delete.PersonalWorkspaceError=Nie mo\u017cna usun\u0105\u0107 obiektu tego typu.
Duplicate.DocumentGenericError=Ne uda\u0142o si\u0119 zduplikowa\u0107 dokument\u00f3w.
Duplicate.NameNotUnique=Ne uda\u0142o si\u0119 zduplikowa\u0107 dokument\u00f3w. Nazwa nie jest unikatowa
Duplicate.Prefix=Przedrostek:

NewMajorRevision.DocumentGenericError=Nie uda\u0142o si\u0119 poprawi\u0107 dokument\u00f3w.
NewMajorRevision.NoReviseAccessOnDocument=Brak uprawnie\u0144 do poprawiania dokument\u00f3w.

NewFolder.RootFolderName=Folder zak\u0142adek
NewFolder.SubFolderName=Folder zak\u0142adek
NewFolder.FolderCreated=Folder zak\u0142adek utworzony.
NewFolder.CreationFailed=Niepowodzenie tworzenia.
NewFolder.CreationFailedUnderFavorite=Nie mo\u017cna utworzy\u0107 folderu zak\u0142adek w sekcji Ulubione.
NewFolder.CreationFailedUnderDeleted=Nie mo\u017cna utworzy\u0107 folderu zak\u0142adek w sekcji Usuni\u0119te.
NewFolder.NoAccessPrivilegeOnParentFolder=Brak uprawnie\u0144 dost\u0119pu do nadrz\u0119dnego folderu zak\u0142adek niezb\u0119dnych do wykonania operacji.
NewFolder.notEnoughRights=Nie masz uprawnie\u0144 do tworzenia nowych folder\u00f3w zak\u0142adek.
NewFolder.NameComputation=Obliczone w momencie utworzenia
NewFolder.InheritLabel=Odziedzicz udost\u0119pnianie od elementu nadrz\u0119dnego
NewFolder.InvalidId=Nadrz\u0119dny folder zak\u0142adek mo\u017ce ju\u017c nie istnie\u0107. Od\u015bwie\u017c wid\u017cet lub sprawd\u017a lokalizacj\u0119 obiektu.

CopyFolder.CopyFolderName=Kopiuj

AddContent.NoAccessToconnectForBusinessObject.error=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cego na do\u0142\u0105czenie obiektu do tego folderu zak\u0142adek.
AddContent.NoAccessToconnectForBusinessObject.advice=Sprawd\u017a, czy u\u017cywasz poprawnych danych uwierzytelniania.
AddContent.ObjectAlreadyConnected=Zawarto\u015b\u0107 zosta\u0142a ju\u017c dodana do wybranych folder\u00f3w zak\u0142adek.
AddContent.ObjectDoNoExists=Obiekty mog\u0105 ju\u017c nie istnie\u0107, od\u015bwie\u017c widget lub sprawd\u017a lokalizacj\u0119 obiektu.
AddContent.NoAccessPrivilegeOnParentFolder.error=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cego na do\u0142\u0105czenie obiektu do tego folderu zak\u0142adek.
AddContent.NoAccessPrivilegeOnParentFolder.advice=Sprawd\u017a, czy u\u017cywasz poprawnych danych uwierzytelniania.
AddContent.NoAccessPrivilegeOnObjectToAdd=Brak uprawnie\u0144 w trybie dost\u0119pu w obiektach do dodania.
AddContent.NoShareAccessOnObjectToAdd=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w do udost\u0119pnienia obiektu.

AddContent.TypeCannotBeAdd=Ten typ obiektu nie jest obs\u0142ugiwany.
AddContent.XCADComponentWithoutParent=Jeden z obiekt\u00f3w jest osadzonym komponentem bez obiektu nadrz\u0119dnego.
AddContent.NotFoundId=Nie znaleziono identyfikatora fizycznego produktu dla obiektu.
AddContent.XCADComponentNav=Podczas do\u0142\u0105czania wykonano akcj\u0119 nawigacji.

RemoveContent.NoAccessRemoveForBusinessObject.error=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cego na usuni\u0119cie obiektu z tego folderu zak\u0142adek.
RemoveContent.NoAccessRemoveForBusinessObject.advice=Sprawd\u017a, czy u\u017cywasz poprawnych danych uwierzytelniania.
RemoveContent.NoAccessPrivilegeOnParentFolder=Brak uprawnie\u0144 dost\u0119pu do nadrz\u0119dnego folderu zak\u0142adek niezb\u0119dnych do wykonania operacji.
RemoveContent.RelationNotFound=Nie znaleziono relacji. Brak zawarto\u015bci do usuni\u0119cia.
RemoveContent.RelationsNotFound=Nie znaleziono relacji. Nie mo\u017cna usun\u0105\u0107 zawarto\u015bci.
RelationsNotModifiable=Zdegraduj folder zak\u0142adek do stanu, kt\u00f3ry umo\u017cliwia edycj\u0119 tre\u015bci.

MoveFolder.TNRNotUnique=Nie mo\u017cna wykona\u0107 operacji, poniewa\u017c istnieje ju\u017c folder zak\u0142adek o takiej samej nazwie. Zmie\u0144 nazw\u0119 folderu zak\u0142adek i pon\u00f3w pr\u00f3b\u0119.
CopyFolder.ErrorCopyInDescendant=Skopiowanie folderu zak\u0142adek do jednego z jej element\u00f3w podrz\u0119dnych nie jest dozwolone.
CopyFolder.ErrorNotBookmarkRootClone=Tylko wid\u017cet folder zak\u0142adek mo\u017cna sklonowa\u0107 jako g\u0142\u00f3wny.

General.MoveCopyAccessError.error=U\u017cytkownik nie ma uprawnie\u0144 do operacji.
General.MoveCopyAccessError.advice=Sprawd\u017a, czy u\u017cywasz poprawnych danych uwierzytelniania.
General.ObjectNotFolder=Obiekt nie jest folderem zak\u0142adek. Wybranego obiektu nie znaleziono w wid\u017cecie Folder zak\u0142adek.
General.AuthentificationFailed=Obiekt m\u00f3g\u0142 zosta\u0107 usuni\u0119ty lub nie masz ju\u017c wymaganego dost\u0119pu.
Error.LicenseMissing=Brakuje niekt\u00f3rych licencji albo straci\u0142y one wa\u017cno\u015b\u0107. Skontaktuj si\u0119 z administratorem.

Creation.errorBkR.title=Nie mo\u017cesz utworzy\u0107 tego obiektu: folder g\u0142\u00f3wny zak\u0142adek
Creation.errorBk.title=Nie mo\u017cesz utworzy\u0107 tego obiektu: folder g\u0142\u00f3wny zak\u0142adek
Creation.AccessError.message=By\u0107 mo\u017ce nie masz wymaganej odpowiedzialno\u015bci w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cej na utworzenie tego typu obiektu.
Creation.AccessError.advice=Sprawd\u017a, czy u\u017cywasz prawid\u0142owych po\u015bwiadcze\u0144.
Move.AccessError.message=By\u0107 mo\u017ce nie masz wymaganej odpowiedzialno\u015bci w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cej na przeniesienie tego typu obiektu.
Move.AccessError.advice=Sprawd\u017a, czy u\u017cywasz prawid\u0142owych po\u015bwiadcze\u0144.

expand.overflow=Nie mo\u017cna rozwin\u0105\u0107 folderu zak\u0142adek, poniewa\u017c pobrano zbyt wiele folder\u00f3w zak\u0142adek. Zwi\u0144 wszystkie, a nast\u0119pnie rozwi\u0144 tylko jeden poziom.
expand.tooManyToExpand=Zbyt wiele folder\u00f3w zak\u0142adek do rozwini\u0119cia. Wybierz jeden poziom rozwini\u0119cia lub zwi\u0144 wszystko, a nast\u0119pnie rozwi\u0144 \u017c\u0105dane.
replaceByContent.ErrorinReplacingContent=Liczba obiekt\u00f3w do dodania r\u00f3\u017cni si\u0119 od liczby obiekt\u00f3w do zast\u0105pienia.

externalContent.UriAlreadyExists=To odwo\u0142anie ju\u017c istnieje w tym folderze zak\u0142adek.

externalContent.NoModifyAccess.title=Nie mo\u017cesz modyfikowa\u0107 tego obiektu
externalContent.NoModifyAccess.advice=Sprawd\u017a, czy u\u017cywasz poprawnych danych uwierzytelniania.
externalContent.NoModifyAccess.message=Mo\u017cesz nie posiada\u0107 wymaganych uprawnie\u0144 w docelowym obszarze wsp\u00f3\u0142pracy do utworzenia obiektu tego typu.

alreadyRootBk=Folder zak\u0142adek '${folderName}' jest ju\u017c folderem g\u0142\u00f3wnym zak\u0142adek.

