# @quickreview gh4  22:10:04  IR-993266: Enhance the exception & error handling in createMBOM & updateMBOM - Started with updateMBOM
# @quickreview gh4  22:10:12  IR-978183: Added support for Bundle Fastener navigation (new Fastener schema)- finding the joining parts
# @quickreview gh4  22:10:13  IR-993266: Enhance the exception & error handling in createMBOM & updateMBOM - pushMode\pullMode updateMBOM handling 
# @quickreview gh4  22:10:17  IR-985201: Ambiguity case of multiple scopes handling changed from choosing the lastCreated to firstCreated item
# @quickreview gh4  22:10:29  IR-993266: Enhance the exception & error handling - Done with updateMBOM
# @quickreview gh4  22:11:08  IR-993266: Enhance the exception & error handling - Done with createMBOM
# @quickreview gh4  24:09:16  IR-1297478: Enhance the exception and error handling when parent item has attached model with frozen criteria

FromProcessReferenceCouldNotBeRetrieved=Impossibile recuperare il riferimento al processo di origine.
ToProcessReferenceCouldNotBeRetrieved=Impossibile recuperare il riferimento al processo di destinazione.
AlternateRelationCouldNotBeCreated=Impossibile creare una relazione alternativa.
ProcessReferenceCouldNotBeRetrieved=Impossibile recuperare il riferimento al processo.
ResourceReferenceCouldNotBeRetrieved=Impossibile recuperare il riferimento alla risorsa.
FirstReferenceCouldNotBeRetrieved=Impossibile recuperare il primo riferimento.
SecondReferenceCouldNotBeRetrieved=Impossibile recuperare il secondo riferimento.
LinkAlreadyExists=Collegamento gi\u00e0 esistente.
GenericServerError=Errore generico del server.
BlockingInstances=Il riferimento ha ancora istanze esterne all'ambito di eliminazione. Potrebbe essere necessario rimuovere le istanze esistenti prima di eliminare il riferimento.
ReorderInstancesFailed=Impossibile archiviare l'ordine delle istanze nel database.
XMLDocumentRetrievalError=Errore durante la ricerca contenente uno o pi\u00f9 file XML.
updateEntityForzenConfigModelVersionException=Modifica istanza impossibile perch\u00e9 \u00e8 presente Validit\u00e0 di evoluzione nello stato Congelato.
InsertExistingRefsFailed=Impossibile creare le istanze.
InsertExistingRefsFailedContextualImplementLink=Impossibile caricare l'elemento perch\u00e9 nella struttura \u00e8 presente un collegamento di implementazione contestuale non supportato.
UpdateEntity_Failed_NoWritePermission=La modifica dell'oggetto non \u00e8 possibile.

# CIM (reroute) failure errMsgs
ImplLinkUnderMultipleScopes=L'elemento di produzione \u00e8 presente in pi\u00f9 ambiti. Rivedere e sostituire tutti i padri senza ambito a partire dal primo ambito superiore.
RootMfgItemIsNotValid=Il riferimento di produzione fornito non \u00e8 valido
RootProductIsNotValid=Il riferimento di prodotto fornito non \u00e8 valido
MfgIsReadOnly=Impossibile eseguire l'aggiornamento della MBOM. L'elemento di produzione '{0}' \u00e8 in stato di sola lettura
MBOMUpdateWarn_CandPrdMultiScopesButOneSel=Il prodotto candidato '{0}' dell'elemento di produzione '{1} include pi\u00f9 ambiti dell'elemento di produzione [{2}], considerando il primo '{3}' di essi per il reindirizzamento.
MBOMUpdateWarn_CandPrdMultiScopesButBLSel=Il prodotto candidato '{1}' dell'elemento di produzione '{0} include pi\u00f9 ambiti dell'elemento di produzione [{2}], considerando l'ultimo '{3}' come proposto dall'apertura della logica di business.
MBOMUpdateFail_MultipleCandProducts=Pi\u00f9 prodotti candidati '{0}' sono presenti per l'elemento di produzione '{1}'. Per questo elemento di produzione si consiglia di utilizzare il comando Gestione impatto modifiche.
MBOMUpdateWarn_MultipleCandPrdsButOneSel=Pi\u00f9 prodotti candidati '{0}' trovati per l'elemento di produzione '{1}', considerando l'ultimo '{2}' di essi per il reindirizzamento.
MBOMUpdateFail_InvalidMbomUpdateAction1=Azione di aggiornamento MBOM non valida inviata per '{0}'
MBOMUpdateFail_InvalidMbomUpdateAction2=Azione di aggiornamento MBOM '{0}' non valida inviata per '{1}'
CandPrdMultipleScopes=Il prodotto candidato '{0}' include pi\u00f9 di un ambito dell'elemento di produzione
BranchCreationFailed=Creazione nuova diramazione non riuscita
MBOMUpdateFail_RerouteILWithEff=L'opzione di solo reindirizzamento non \u00e8 disponibile con Lavora sotto evoluzione o azione di modifica con applicabilit\u00e0. Evolvi istanza \u00e8 l'azione consigliata.
MBOMUpdateFail_EvolveInstWithoutEff=Evolvi istanza pu\u00f2 essere eseguita solo con Lavora sotto evoluzione o azione di modifica con applicabilit\u00e0. Impostare Lavora sotto evoluzione o azione di modifica con applicabilit\u00e0 e riprovare.
MBOMUpdateErr_BLResultFetchFailed=Impossibile recuperare il risultato dell'apertura della logica di business per [Mfg, Prd]: ['{0}', '{1}']
# Replace Command properties
ReplaceMfgItemScopedWithDifferentProduct=Operazione di sostituzione ignorata. L'ambito di '{0}' riguarda un altro prodotto
ReplaceMfgItemParentIsReadOnly=Operazione di sostituzione ignorata. '{0}' non \u00e8 nello stato di maturit\u00e0 lettura-scrittura
ReplaceByLatestNoLatestRevision=Operazione di sostituzione ignorata. '{0}' \u00e8 gi\u00e0 la revisione pi\u00f9 recente
ReplaceSelectedItemIsNotMfgItem=Operazione di sostituzione ignorata. '{0}' non \u00e8 un elemento di produzione
ReplaceOperationSuccess=Sostituzione di '{0}' con '{1}' riuscita.
ReplaceOperationFailed=Sostituzione di '{0}' con '{1}' non riuscita.
ReplaceOperationFailedWithNoTarget=Sostituzione di '{0}' non riuscita.
ReplaceInstanceDoesNotExist=Sostituzione non riuscita. L'istanza selezionata non esiste.
ReplaceBySelectedRefDoesNotExist=Sostituzione di '{0}' non riuscita. Il riferimento non esiste.
ReplaceMfgProcessParentIsReadOnly=Operazione di sostituzione ignorata. Il padre di '{0}' \u00e8 nello stato di maturit\u00e0 di sola lettura
ReplaceSrcMfgChildILsImpacted=La sostituzione degli elementi selezionati '{0}' eliminer\u00e0 i collegamenti di implementazione degli elementi figli. Continuare?
ReplaceTargetMfgScpdToOOScpPrd=L'ambito di alcuni o di tutti gli elementi selezionati '{0}' riguarda prodotti non istanziati nella struttura. Continuare?
ReplaceTargetMfgScpdToDiffPrd=I prodotti con ambito degli elementi selezionati '{0}' sono diversi da quelli dell'elemento con cui verranno sostituiti ('{1}'). Continuare?
ReplaceAggregationNotAllowed=Operazione di sostituzione ignorata, Aggregazione/Sostituzione non autorizzata tra '{0}' e '{1}'.
ReplaceParentCnfgdWithEvolAndWithoutEff=La sostituzione non \u00e8 riuscita perch\u00e9 il padre '{1}' dell'elemento di produzione '{0}' \u00e8 configurato con criteri di evoluzione ma la sostituzione non \u00e8 stato eseguita nel periodo di validit\u00e0
ParentHavingFrozenCriteriaAndReplaceDoneWithoutEff=Sostituzione non riuscita poich\u00e9 il '{1}' padre dell'elemento di produzione'{0}' ha un modello associato che contiene almeno un criterio congelato. Utilizzare "Lavora in: Evoluzione OPPURE Azione di modifica con applicabilit\u00e0".
# MBOM update initial validation check errorMsgs
MBOMUpdateFailure_NoUpdateMode=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 non \u00e8 stata specificata la modalit\u00e0 di aggiornamento
MBOMUpdateFailure_InvalidUpdateMode=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 la modalit\u00e0 di aggiornamento specificata non \u00e8 corretta. Le modalit\u00e0 valide sono 'mbomPull', 'ebomPush' e 'flowdown'
MBOMUpdateFailure_NoRootMfgItem=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 non \u00e8 stato specificato un elemento di produzione
MBOMUpdateFailure_InvalidRootMfgItem=Impossibile recuperare l'elemento di produzione radice. Specificare un valore valido per 'rootMfgItemID'.
MBOMUpdateFailure_RootMfgItemIsNotMFG=Il valore specificato per 'rootMfgItemID' dovrebbe essere di tipo MFG mentre \u00e8 di tipo '{0}'.
MBOMUpdateFail_RootCnfgdWithEvolNUpdateWithoutEff=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 l'elemento di produzione radice \u00e8 configurato con un'evoluzione, ma l'aggiornamento non \u00e8 stato eseguito nella decorrenza valida.
MBOMUpdateFail_RootChgCntrldNUpdateWithoutMCA=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 l'elemento di produzione radice \u00e8 controllato dall'azione di modifica '{0}', ma l'aggiornamento non \u00e8 stato eseguito con l'azione di modifica Lavora in.
MBOMUpdateFail_RootCntrldByCA_ButDiffInputCA=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 l'elemento di produzione radice \u00e8 controllato dall'azione di modifica '{0}' e non nell'azione di modifica Lavora in specificata.
MBOMUpdateFailure_NewRevOfRootFailed=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 non \u00e8 possibile creare una nuova revisione dell'elemento di produzione '{0}'
MBOMUpdateFailure_NoRootProduct=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 non \u00e8 stato specificato un prodotto radice e l'elemento di produzione non rientra nell'ambito di nessun prodotto
MBOMUpdateFailure_InvalidRootProduct=Impossibile recuperare il prodotto radice. Specificare un valore valido per 'rootProductID'.
MBOMUpdateFailure_RootProductIsNotPRD=Il valore specificato per 'rootProductID' dovrebbe essere di tipo Prodotto, invece \u00e8 di tipo '{0}'.
MBOMUpdateFailure_PushModeNoEngCA=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 non \u00e8 stata specificata un'azione di modifica tecnica. Specificare un valore valido per 'engChangeActionID'.
MBOMUpdateFail_ReviseBehvrChkInvalidOption=Valore non valido specificato per 'reviseBehaviorChecks'. Specificare un valore valido tra '{0}'.
MBOMUpdateFail_CABasedUpdtExpModeInvalidOption=Valore non valido specificato per 'CABasedMbomUpdateExpandMode'. Specificare un valore valido tra '{0}'.

# MBOM update further validation check errorMsgs
PullModeMBOMUpdateFail_RootsNotScoped=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 non esiste un ambito tra il prodotto e l'elemento di produzione specificati
PushModeMBOMUpdateFail_CAFactoryNull=Impossibile recuperare 'ChangeActionFactory'. Contattare l'amministratore.
PushModeMBOMUpdateFail_InvalidEngCA=Impossibile recuperare l'azione di modifica tecnica dal PID dell'azione di modifica tecnica specificato '{0}'. Specificare un valore valido per 'engChangeActionID'
PushModeMBOMUpdateFail_InvalidEngCAState=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 l'azione di modifica tecnica specificata non \u00e8 nello stato 'Completato'
PushModeMBOMUpdateFail_RootMfgNotScoped=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 nessun prodotto rientra nell'ambito dell'elemento di produzione
PushModeMBOMUpdateFail_RootMfgManyScope=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 pi\u00f9 prodotti rientrano nell'ambito dell'elemento di produzione

FlowdownMBOMUpdateFail_NoMfgCA=Impossibile eseguire l'aggiornamento della MBOM perch\u00e9 non \u00e8 stata specificata un'azione di modifica di produzione. Specificare un valore valido nel 'DS-Change-Authoring-Context' dell'intestazione della richiesta HTTP.
FlowdownMBOMUpdateFail_InvalidMfgCA=Impossibile recuperare l'azione di modifica di produzione dal PID dell'azione di modifica di produzione specificato '{0}'. Specificare un valore valido nel 'DS-Change-Authoring-Context' dell'intestazione della richiesta HTTP.
FlowdownMBOMUpdateWarn_NoProposedChanges=L'azione di modifica di produzione specificata non ha modifiche di flow-down. Provare con un'azione di modifica di produzione con modifiche di flow-down da una o pi\u00f9 azioni di modifica tecnica.

# MfgCA validation check errorMsgs
MfgCAError_FailedToFetchCAPID=Eccezione durante il recupero dell'azione di modifica di produzione.
MfgCAError_InvalidMfgCAFormat=Il formato dell'azione di modifica di produzione specificata '{0}' non \u00e8 valido. Utilizzare il formato 'pid:<MfgCA-PID>'
MfgCAError_InvalidMfgCA=Impossibile recuperare l'azione di modifica di produzione dal PID dell'azione di modifica di produzione specificato '{0}'. Specificare un valore valido per il PID dell'azione di modifica di produzione.
MfgCAError_WorkUnderNotAllowed=Lavora in non consentito per l'azione di modifica di produzione specificata: '{0}'
MfgCAError_ApplicabilityFetchFailed=Impossibile recuperare l'espressione di applicabilit\u00e0 dell'azione di modifica di produzione specificata: '{0}'
MfgCAError_NoApplicability=All'azione di modifica di produzione specificata non \u00e8 associata un'applicabilit\u00e0. Specificare un'azione di modifica di produzione con applicabilit\u00e0.
MfgCAError_InvalidApplicabilityExpn=L'espressione di applicabilit\u00e0 dell'azione di modifica di produzione specificata non \u00e8 valida: '{0}'

# MBOM update failure errMsgs
MBOMUpdateFail_RootMfgIsReadOnly=Impossibile eseguire l'aggiornamento della MBOM. Lo stato corrente dell'elemento di produzione '{0}' radice non consente modifiche alla struttura della MBOM
MBOMUpdateFail_ParentMfgIsReadOnly=Impossibile eseguire l'aggiornamento della MBOM. L'elemento '{0}' padre \u00e8 in stato di sola lettura
MBOMUpdateFail_ParentCnfgdWithEvolNUpdateWithoutEff=Impossibile elaborare il prodotto '{0}' perch\u00e9 il '{2}' padre dell'elemento di produzione '{1}' \u00e8 configurato con un'evoluzione ma l'aggiornamento non \u00e8 stato eseguito nella decorrenza valida.
MBOMUpdateFail_ManyResultingPrdFound=All'elemento di produzione '{0}' sono associati pi\u00f9 prodotti risultanti
MBOMUpdateFail_MfgPartSLCreationNotSupported=La creazione di un collegamento ambito per le parti di produzione non \u00e8 supportata
MBOMUpdateFail_CC_CAPID_UnknownValue=Valore sconosciuto '{0}' incontrato per il PID dell'azione di modifica che controlla l'elemento di produzione '{1}'
MBOMUpdateFail_GetChangeControlInfoFailed=Impossibile recuperare le informazioni di controllo delle modifiche degli elementi da aggiornare
# Note: Below ReviseErr* msgKeys can't be changed since they are enum names in ReviseAllowedStatus. So they have to be always in sync, if changed at one place then have to be changed at both places!!
ReviseErr_ItemCntrldByCA_ButNoInputCA=Revisione non riuscita perch\u00e9 l'elemento di produzione '{0}' \u00e8 controllato dall'azione di modifica '{1}', ma l'aggiornamento non \u00e8 stato eseguito con l'azione di modifica Lavora in
ReviseErr_ItemCntrldByCA_ButDiffInputCA=Revisione non riuscita perch\u00e9 l'elemento di produzione '{0}' \u00e8 controllato da un'azione di modifica '{1}', diversa dall'azione di modifica Lavora in specificata
ReviseErr_ItemCntrldByInputCA_ButIsInROState=Revisione non riuscita poich\u00e9 l'utente non ha accesso alla revisione dell'elemento di produzione '{0}'
MBOMUpdtWarn_ItemCfgdWithEvolReviseIgnored=L'elemento di produzione '{0}' \u00e8 configurato con l'evoluzione, pertanto la revisione dell'elemento viene ignorata
ReviseErr_ParentCnfgdWithEvolNUpdateWithoutEff=La revisione non \u00e8 riuscita perch\u00e9 il padre '{1}' dell'elemento di produzione ''{0}' \u00e8 configurato con un'evoluzione ma l'aggiornamento non \u00e8 stato eseguito in un contesto valido
# Note: Below UpdateErr* msgKeys can't be changed since they are enum names in UpdateAllowedStatus. So they have to be always in sync, if changed at one place then have to be changed at both places!!
UpdateErr_ItemCntrldByCA_ButNoInputCA=L'aggiornamento non \u00e8 riuscito perch\u00e9 {0} '{1}' \u00e8 controllato dall'azione di modifica '{2}', ma l'aggiornamento viene eseguito senza azione di modifica Lavora in
UpdateErr_ItemCntrldByCA_ButDiffInputCA=L'aggiornamento non \u00e8 riuscito perch\u00e9 {0} '{1}' \u00e8 controllato dall'azione di modifica '{2}', diversa dall'azione di modifica Lavora in specificata
UpdateErr_ItemCntrldByInputCA_ButIsInROState=L'aggiornamento non \u00e8 riuscito poich\u00e9 l'utente non ha accesso alla modifica di {0} '{1}'
UpdateErr_ItemNotCntrldByCA_AndIsInROState=L'aggiornamento non \u00e8 riuscito poich\u00e9 l'utente non ha accesso alla modifica di {0} '{1}'


MBOMUpdateFail_ExceptionCaught=Eccezione rilevata nell'aggiornamento della MBOM
MBOMUpdateFail_WebAppExceptionCaught=Eccezione app Web rilevata nell'aggiornamento della MBOM
BICompErr_RootMfgValidation=Eccezione rilevata in validateGivenRoots durante l'elaborazione dell'elemento di produzione radice {0} 
BICompErr_ScopeGoodStatusComputeFail=Eccezione rilevata in computeStatusForScopedParents durante l'elaborazione di {0} '{1}'
BICompErr_UnScopedMfgStatusComputeFail=Eccezione rilevata in computeStatusForUnScopedParents durante l'elaborazione dell'elemento di produzione radice '{1}'
BICompErr_UnScopedPrdStatusComputeFail=Eccezione rilevata in computeStatusForUnScopedParents durante l'elaborazione del prodotto radice '{1}'
MBOMUpdateFail_DuringExpand=Eccezione durante l'espansione di {0} '{1}'
MBOMUpdateFail_ExpandCacheCreation=Eccezione durante la creazione della cache di espansione per {0} '{1}'
MBOMUpdateFail_FillingCacheWithLinkInfo=Eccezione durante l'inserimento nella cache di espansione delle informazioni sui collegamenti
ExpandFail_CycliStructureDetected_MFG=Rilevata una struttura ciclica per prod.: '{0}' con percorso di occorrenza '{1}'
ExpandFail_CycliStructureDetected_PRD=Rilevata una struttura ciclica per prod.: '{0}' con percorso di occorrenza '{1}'
PushModeMBOMUpdate_GetRealizedObjsFailed=Eccezione durante il recupero di oggetti realizzati dall'azione di modifica specificata
MBOMMUpdateFail_GettingUpdateMap4ModDel=Recupero mappa degli aggiornamenti MBOM non riuscito per l'occorrenza di produzione {0} con azione Sostituisci/Reindirizza/Elimina, elemento ignorato per l'aggiornamento
MBOMMUpdateFail_GettingUpdateMapForMod=Recupero mappa degli aggiornamenti MBOM non riuscito per l'occorrenza di produzione {0} con azione Sostituisci/Reindirizza, elemento ignorato per l'aggiornamento
MBOMMUpdateFail_GettingUpdateMapForDel=Recupero mappa degli aggiornamenti MBOM non riuscito per l'occorrenza di produzione {0} con azione Elimina, elemento ignorato per l'aggiornamento
MBOMMUpdateFail_GettingUpdateMapForEvl=Recupero mappa degli aggiornamenti MBOM non riuscito per l'occorrenza di produzione {0} con azione Evolvi, elemento ignorato per l'aggiornamento
MBOMMUpdateFail_GettingUpdateMapForNew=Recupero mappa degli aggiornamenti MBOM non riuscito per l'occorrenza di produzione {0} con azione Crea, elemento ignorato per l'aggiornamento
MBOMMUpdateFail_GettingUpdateMapForNewFasten=Recupero mappa degli aggiornamenti MBOM non riuscito per l'occorrenza di fissaggio {0} con azione Crea, elemento ignorato per l'aggiornamento
PullModeMBOMUpdateFail_UpdateMapPrepartn=Eccezione durante la ricerca delle modifiche delta e la preparazione della mappa degli aggiornamenti MBOM
PushModeMBOMUpdate_GetCAEventsMQLFail=Eccezione durante il recupero degli eventi dal registro delle azioni di modifica tramite MQL
PushModeMBOMUpdate_FindingRerouteCandFail=Eccezione durante la ricerca del candidato reindirizzamento per produzione '{0}'
PushModeMBOMUpdate_MultipleCandPathsFound=Pi\u00f9 percorsi di occorrenze di prodotti candidati trovati per il prodotto candidato specificato '{0}'
PushModeUpdateWarn_ImplementingMfgNotFound=Ignorata l'istanza prodotto '{0}' di '{1}' UF per l'aggiornamento. Il prodotto non \u00e8 stato mai implementato OPPURE l'elemento di produzione in implementazione \u00e8 presente in un sottoassieme con ambito OPPURE l'elemento di produzione in implementazione \u00e8 stato eliminato.
PushModeUpdateErr_UpdateMapPrepFail=Eccezione rilevata durante la preparazione della mappa degli aggiornamenti MBOM per il contesto MBOM con ambito '[Fabbr.: {0}, Prod: {1}]'. Aggiornamento in prosecuzione con il prossimo contesto MBOM con ambito.
PushModeUpdateErr_ExcpnInMbomUpdate=Eccezione rilevata durante l'aggiornamento MBOM per il contesto MBOM con ambito '[Fabbr.: {0}, Prod: {1}]'. Aggiornamento in prosecuzione con il prossimo contesto MBOM con ambito.
PushModeUpdateErr_ExcpnInMbomUpdateForNew=Eccezione rilevata durante l'aggiornamento MBOM per i nuovi prodotti del contesto MBOM con ambito '[Fabbr.: {0}, Prod: {1}]'. Aggiornamento in prosecuzione con il prossimo contesto MBOM con ambito.
PushModeUpdateErr_ExcpInScpMbomCtxUpdateOfScpBrokenMfgSA=Eccezione rilevata durante l'aggiornamento del contesto MBOM con ambito dell'MfgSA reindirizzato sull'ambito '{0}' nel Ctx padre [Fabbr: {1}, Prod: {2}]
InvalidValueForEnumInputType=Valore non valido specificato per '{0}'. Specificare un valore valido tra '{1}'.
ItemTypeNotAvailable=Impossibile recuperare il tipo di elemento. Fornire il tipo di elemento.

UpdateFailure_CommitFailed=Impossibile confermare l'aggiornamento.
UpdateFailure_CreateNewMfgItems=L'aggiornamento non ha creato i nuovi elementi di produzione
UpdateWarning_FetchedScpdPrdIDIsNotRef=Impossibile leggere il prodotto con ambito dell'elemento di produzione '{0}' (lo sviluppo elemento principale del prodotto con ambito '{1}' trovato non \u00e8 uno sviluppo elemento principale di riferimento valido).
UpdateWarning_BLEntityWrapperCreationFailed=Impossibile creare l'oggetto wrapper entit\u00e0 per ID apertura logica di business '{0}'. Questa logica di business verr\u00e0 ignorata.
UpdateWarning_BLFindingFailed=Impossibile trovare la logica di business con ID apertura '{0}'. Questa logica di business verr\u00e0 ignorata.

# Fasten update failure errMsgs
FastenUpdateFail_NotPushModeUpdate=Impossibile eseguire l'aggiornamento del fissaggio perch\u00e9 l'aggiornamento non \u00e8 stato eseguito n\u00e9 in modalit\u00e0 flow-down n\u00e9 in modalit\u00e0 ebomPush
FastenUpdateFail_NewCaseInvalidOption=Valore non valido specificato per 'fastenUpdateForNewFastener'. Specificare un valore valido tra '{0}'.
FastenCreateFail_NoImpactedMfgPartFound=Impossibile elaborare il nuovo dispositivo di fissaggio '{0}' perch\u00e9 le parti di produzione interessate non sono disponibili per il fissaggio di {1}
FastenNewOptn1Fail_ParentCnfgdWithEvolNUpdateWithoutEff=Impossibile creare l'istanza di fissaggio di '{0}' per il dispositivo di fissaggio '{1}' perch\u00e9 il '{2}' padre \u00e8 configurato con un'evoluzione ma l'aggiornamento non \u00e8 stato eseguito in un contesto valido
NewFastenerWarn_Ignored_NoStackingPartsFoundForMCXConn=NewFastenerWarning: la nuova istanza del fissaggio viene ignorata perch\u00e9 non ci sono parti di impilamento per la connessione MCX {0}
NewFastenerWarn_Ignored_MCXIntersectedListEmpty=NewFastenerWarning: la nuova istanza del fissaggio viene ignorata perch\u00e9 l'elenco intersectedMCXList \u00e8 vuoto
NewFastenerErr_FastenerInstanceNotFound=NewFastenerError: istanza non disponibile nel database per questo nuovo instancePID del fissaggio {0}
NewFastenerErr_FailToGetSiblingFasteners=NewFastenerError: impossibile recuperare i fermi dal fissaggio a fascia {0} della nuova istanza del fissaggio {1}
NewFastenerWarn_Ignored_InvalidPartIDForBundleConn=NewFastenerWarning: la connessione {0} viene ignorata perch\u00e9 un instancePID del giunto {1} non \u00e8 valido per la nuova istanza del fissaggio {2}
NewFastenerErr_FailToGetJoiningPartsFrmBundle=NewFastenerError: impossibile recuperare i giunti dal fissaggio a fascia {0} della nuova istanza del fissaggio {1}
NewFastenerWarn_Ignored_NoDetailsFetched=NewFastenerWarning: la nuova istanza dispositivo di fissaggio viene ignorata, perch\u00e9 non sono stati recuperati dettagli della stessa durante l'espansione PRD. Se si \u00e8 in uno schema di fissaggio a fascia, la ragione potrebbe essere la mancata implementazione del fissaggio nella fascia con un'operazione di fissaggio.
NewFastenerWarn_Ignored_NoFastenersFound=NewFastenerWarning: la nuova istanza dispositivo di fissaggio viene ignorata perch\u00e9 non sono stati trovati dispositivi di fissaggio per unire le parti del nuovo dispositivo di fissaggio.
NewFastenerWarn_Ignored_NoImpMfgItemFound=NewFastenerWarning: la nuova istanza dispositivo di fissaggio viene ignorata perch\u00e9 non sono stati trovati elementi di produzione per implementare l'elemento {0} '{1}' interessato con il percorso di occorrenza {2}
NewFastenerWarnMsg_ChoosenOneAmongMany=Trovati {0} dispositivi di fissaggio implementati che uniscono le stesse parti '{1}' del dispositivo di fissaggio specificato '{2}'. Tra questi viene scelto '{3}' implementato dal fissaggio '{4}', mentre i rimanenti '{5}' dispositivi di fissaggio vengono ignorati
FastenUpdateErr_ReviseMfgPartsFailed=Impossibile rivedere una o pi\u00f9 parti di produzione

# MBOM update report errMsgs
UpdateMfgItemErr_BIStatusFail=Impossibile recuperare lo stato BI
UpdateMfgItemErr_UpdateFailed=Impossibile effettuare l'aggiornamento
UpdateMfgItemErr_DeleteInstFailed=Impossibile eliminare l'istanza
UpdateMfgItemErr_RerouteSLFailed=Impossibile reindirizzare il collegamento di ambito
UpdateMfgItemErr_NoCandOccRefPaths=Nessun percorso occRef candidato trovato.
UpdateMfgItemErr_RerouteILFailed=Impossibile reindirizzare il collegamento di implementazione
UpdateMfgItemErr_ReplaceFail_ParentROState=Impossibile sostituire '{0}' poich\u00e9 il padre '{1}' \u00e8 nello stato di sola lettura
UpdateMfgItemErr_DeleteFail_ParentROState=Impossibile eliminare '{0}' poich\u00e9 il padre '{1}' \u00e8 nello stato di sola lettura
UpdateMfgItemErr_EvolveFail_ParentROState=Impossibile evolvere '{0}' poich\u00e9 il padre '{1}' \u00e8 nello stato di sola lettura
UpdateMfgItemErr_EvolveInstAPIFailure=Impossibile evolvere '{0}' a causa dell'errore dell'API con lo stato '{1}'
MBOMUpdateMsg_BLReplyIsIgnore=Ignorato come richiesto dalla logica di business
MBOMUpdateErr_BLReplyInvalidChoice=Ignorato in quanto scelta non valida '{0}' restituita dalla logica di business
MBOMUpdateErr_BLExecutionReturnNonZero=Ignorato in quanto l'esecuzione della logica di business \u00e8 stata restituita con valore diverso da zero '{0}'
MBOMUpdateErr_BLExecutionFailed_Item=Ignorato poich\u00e9 l'esecuzione della logica di business non \u00e8 riuscita a causa di un'eccezione; vedere Errori globali per i dettagli delle eccezioni.
MBOMUpdateErr_BLExecutionFailed_Global=Esecuzione della logica di business non riuscita a causa di un'eccezione
UpdateMfgItemWarn_ScpBrknSA_RerouteHadFailedInItsParentCtx=Ignorato poich\u00e9 il reindirizzamento del suo elemento padre con ambito interrotto '{0}' non \u00e8 riuscito nel contesto del proprio antenato '{1}'
UpdateMfgItemWarn_ScpBrknSA_FailToFindChildrenForUpdate=Ignorato poich\u00e9 l'aggiornamento non ha trovato il figlio dell'elemento padre con ambito interrotto '{0}' da aggiornare.
UpdateMfgItemWarn_ScpBrknSA_FailedToUpdatMfgInstsWithNewRevInfo=Ignorato poich\u00e9 l'aggiornamento non ha trovato le istanze di produzione nella nuova revisione dell'elemento padre con ambito interrotto '{0}'
UpdateMfgItemWarn_ScpBrknSA_FailedToFindRerouteILForImpactedChildren=Ignorato poich\u00e9 l'aggiornamento non ha trovato i candidati rerouteIL per i figli interessati nella nuova revisione dell'elemento padre con ambito interrotto '{0}'
UpdateMfgItemWarn_ScpdParentNotMarkedToExpand=Ignorato perch\u00e9 il padre con ambito '{0}' non \u00e8 espanso come da configurazione XML

ObjectProcessedInPreviousRunMsg=Questo oggetto viene ignorato perch\u00e9 \u00e8 gi\u00e0 stato aggiornato in un passaggio precedente
ObjectProcessedByUserMsg=Questo oggetto viene ignorato perch\u00e9 \u00e8 gi\u00e0 stato elaborato dall'utente
ObjectIgnoredAsAskedByBL=Oggetto ignorato come richiesto da logica di business
ObjectUnderScopedSubAsslyORImplingMfgNotFound=Ignorato poich\u00e9 un elemento di produzione in implementazione \u00e8 presente in un sottoassieme con ambito O non \u00e8 stato trovato un elemento di produzione che implementi questo prodotto
noAttrValueFound=Nessun valore attributo trovato

# CreateMfgItems resultReport errMsgs
createMfgItemErrorMsgRootMfgItemIsNotValid=Il riferimento di produzione fornito non \u00e8 valido
createMfgItemErrorMsgRootProductIsNotValid=Il riferimento di prodotto fornito non \u00e8 valido
createMfgItemError_ExcepCreatingSLForSelItems=Eccezione durante la creazione del collegamento d'ambito tra gli elementi selezionati/definiti
createMfgItemError_ExcepCreatingILForSelItems=Eccezione durante la creazione del collegamento d'implementazione per gli elementi selezionati/definiti
createMfgItemError_SubStructureCreationFailed=La creazione della sottostruttura di produzione per il prodotto '{0}' con occorrenza '{1}' non \u00e8 riuscita a causa di un'eccezione durante il recupero dei figli del prodotto
createMfgItemErrorMsgExceptionSeenIn=Eccezione rilevata in {0}
createMfgItemError_MBOMCreationFailedForOcc=Creazione della MBOM ignorata per il prodotto '{0}' con occorrenza '{1}' per un'eccezione rilevata in {2}
createMfgItemError_ExceptionInThread=Eccezione nel Thread-{0}
createMfgItemError_ThreadExecutionFail_Global=Esecuzione del Thread-{0} non riuscita per un'eccezione
#createMfgItemError_ThreadExecutionFail_Item=Failed since execution of Thread {0} failed with an exception. See GlobalErrors for details of exception.
createMfgItemErrorMsgRootsNotScoped=L'elemento di produzione radice e il prodotto radice non hanno un ambito
createMfgItemError_ExcepWhileRootsScopeCheck=Eccezione durante la convalida dell'ambito tra elemento di produzione radice e prodotto radice
createMfgItemWarnMsgNoPrdOccsToProcess=Nessuna occorrenza di prodotto da elaborare
createMfgItemErrorMsgExcepInGettingRefAtts=Eccezione durante il recupero degli attributi di riferimento in {0}
createMfgItemErrorMsgExcepInGettingInstAtts=Eccezione durante il recupero degli attributi di istanza in {0}
#createMfgItemErrorMsgBLExecutionFail      =Ignored as BL execution failed with an exception, see GlobalErrors for exception details!
createMfgItemErrorMsgBLReplyIsIgnore=Ignorato come richiesto dalla logica di business
createMfgItemErrorMsgBLDidntProvideAnyInfo=Ignorato in quanto la logica di business non ha fornito le informazioni richieste
createMfgItemErrorMsgProductHasMultipleScopes=Ignorato in quanto il prodotto include pi\u00f9 ambiti
createMfgItemErrMsg_GettingBaseLineMaturityValues=Rilevata eccezione durante il recupero dei valori di riferimento per gli stati di maturit\u00e0
createMfgItemErrorMsgProductNoHighestState=Ignorato perch\u00e9 il prodotto ha pi\u00f9 ambiti e nessuno di questi ha uno stato di maturit\u00e0 valido (dovrebbero essere nello stato {0} o {1} o {2})
createMfgItemWarn_PrdHasManyScopesButOneSel=Il prodotto ha pi\u00f9 ambiti dell'elemento di produzione [{0}], considerando il primo '{1}' di essi che \u00e8 stato creato.
createMfgItemErrorMsgIgnoredDueToException=Ignorato in quanto si \u00e8 verificata un'eccezione in {0}
createMfgItemErrorMsgScopeNotFound=Ignorato perch\u00e9 non \u00e8 stato possibile trovare l'elemento di produzione con ambito
createMfgItemError_ExceptionInDataPreparation=Eccezione {0} durante la preparazione dei dati in {0}
createMfgItemErrorWhileFetchingReferences={0} non \u00e8 riuscito a recuperare i riferimenti figlio/padre
createMfgItemError_ExceptionWhileCreatingSL=Eccezione {0} durante la creazione del collegamento di ambito
createMfgItemError_InstanceCreationFailNoExcp=Creazione dell'istanza {0} non riuscita senza eccezione 
createMfgItemError_ExceptionWhileCreatingInst=Eccezione {0} durante la creazione dell'istanza
createMfgItemError_ExceptionWhileCreatingIL=Eccezione {0} durante la creazione del collegamento di implementazione
createMfgItemError_ExceptionWhileCommitContext=Eccezione durante il commit del contesto in {0}
createMfgItemErrorMsgExternalJavaIgnoreAsBLNotAvilable=Ignorato perch\u00e9 EKL \u00e8 stato richiesto dall'apertura Java esterna ma non \u00e8 disponibile
createMfgItemMsg_ActionChangedToIgnore=Modifica dell'azione in Ignora per {0} con PID elemento di produzione aggregazione {1}
createMfgItemErrorMsg_ParentWorkUnderStatus_isNotValid_As_NoInputCA_ButAggMfgIsControlledByCA=Ignorato perch\u00e9 l'elemento di produzione aggregazione \u00e8 controllato da Azione di modifica, ma nell'input non \u00e8 stata fornita alcuna Azione di modifica
createMfgItemErrorMsg_ParentWorkUnderStatus_isNotValid_As_InputCA_AggMfgCA_AreDifferernt=Ignorato perch\u00e9 l'elemento di produzione aggregazione \u00e8 controllato da un'Azione di modifica diversa da quella fornita nell'input
createMfgItemErrorMsgExceptionWhileFetchingModel=L'uso del prodotto non \u00e8 riuscito a causa dell'errore durante il recupero del modello associato all'elemento di produzione di destinazione
createMfgItemErrorMsg_ModelHavingFrozenCriteria=L'uso del prodotto non \u00e8 riuscito poich\u00e9 l'elemento di produzione di destinazione ha un modello associato che contiene almeno un criterio congelato. Utilizzare "Lavora in: Evoluzione OPPURE Azione di modifica con applicabilit\u00e0".
createMfgItemErrorMsg_ExceptionFailure_Title=Creazione non riuscita
createMfgItemErrorMsg_ExceptionFailure_SubTitle=Creazione degli oggetti non riuscita con errore:

reuseServiceWarn_PrdDoesnthaveScopedSparePart=Il prodotto {0} rientra nell'ambito {1}, ma viene ignorato e viene creata la nuova parte di ricambio {2} per consumare il prodotto {3}

# License error
licenceError=Nessuna delle licenze in {0} \u00e8 assegnata all'utente: {1}. Contattare l'amministratore di sistema.
noRoleFound=Nessun ruolo trovato nel set PPW per: {0}.

noAttrValueFound=Nessun valore attributo trovato

# BL error
BLError=Creazione non riuscita a causa di una verifica della logica di business: {0}.
NoBLMessage=Nessun messaggio logica di business trovato

# Commit error
CommitError=Commit nel database non riuscito a causa della transazione {0}.

RPLinkCreationFailed=Impossibile creare il nuovo collegamento prodotto risultante
ScopeLinkDeletionFailed=Impossibile eliminare il nuovo collegamento ambito
RPLinkDeletionFailed=Impossibile eliminare il nuovo collegamento prodotto risultante

# Create Ref error
InvalidDimensionType=Tipo di quota inviato non valido - {0}

# Scope Link creation
createScopeLinkError=Impossibile creare il nuovo collegamento ambito
createScopeLinkErrorIncompatibleExistingIL=Impossibile creare il collegamento ambito a causa di un'incompatibilit\u00e0 con il collegamento di implementazione esistente. Eliminare prima il collegamento di implementazione dall'istanza del riferimento {0}.
createScopeLinkErrorNotAuthorizedByBL=Impossibile creare il collegamento ambito per errore di autorizzazione BL
createScopeLinkErrorBLFailure=Impossibile creare il collegamento ambito per errore interno BL
createScopeLinkErrorPatternNOTAuthorized=Impossibile creare il collegamento ambito per modello dati non autorizzato

# Partial Scope Link creation
SLAlreadyExistingSolved=Il collegamento di ambito parziale esiste gi\u00e0 e non pu\u00f2 essere creato
SLAlreadyExistingBroken=Il collegamento di ambito parziale esiste gi\u00e0, \u00e8 interrotto e non pu\u00f2 essere creato
invalidArg=Gli input non sono valutati correttamente.
createPartialScopeLinkErrorBLFailure=Impossibile creare il collegamento ambito parziale per errore interno BL
createPartialScopeLinkErrorNotAuthorizedByBL=Impossibile creare il collegamento ambito parziale per errore di autorizzazione BL
createPartialScopeLinkErrorIncompatibleExistingIL=Impossibile creare il collegamento ambito parziale a causa di un'incompatibilit\u00e0 con il collegamento di implementazione esistente. Eliminare prima il collegamento di implementazione dall'istanza del riferimento {0}.
createPartialScopeLinkError=Impossibile creare il nuovo collegamento ambito parziale

managePartialScopeFail_InvalidOption=Valore non valido specificato per azione di ambito parziale. Specificare un valore valido tra '{0}'.

# MFN AltSubBL Related Messages
AltSubBLErr_NoBLExistis=Lo script AltSubBL EKL non esiste
AltSubBLErr_ExecutionFailed=Esecuzione di AltSubBL non riuscita
AltSubBLErr_FailedToReadOutput=Impossibile leggere l'output da AltSub-BLResult
AltSubBLErr_InvalidOPListSize=Mancata corrispondenza della dimensione degli elenchi di output BL. Le dimensioni sono OutputListOfEngItemReference-{0}, OutputListOfContextsInstance-{1}, OutputListOfContextsReference-{2}, OutputListOfStatus-{3}, OutputListOfRelationType-{4}.
AltSubBLErr_EngItemRefPIDEmpty=Nessun valore specificato per 'AltSub-EngItemRef'
AltSubBLErr_StatusInvalidOption=Valore non valido '{0}' specificato per 'AltSub-Status'
AltSubBLErr_RelTypeInvalidOption=Valore non valido '{0}' specificato per 'AltSub-RelationType'
AltSubBLErr_InvalidRefInstContext=ReferenceContext e/o InstanceContext non come previsti
AltSubBLSuggn_ForContextOfRefSubstitue=(ReferenceContext deve avere un valore valido e InstanceContext deve essere vuoto)
AltSubBLSuggn_ForContextOfInstSubstitue=(ReferenceContext deve essere vuoto e InstanceContext deve avere un valore valido)
AltSubBLSuggn_ForContextOfAlternate=(ReferenceContext e InstanceContext devono essere vuoti)

RequirementLinkTargetNotFound="Requisito per la connessione non trovato nel database"
RequirementLinkNotFound="RequirementLinkRefRef  '{0}' non trovato nel database"
RequirementLinkDeletionFailed="Impossibile eliminare il collegamento del requisito a causa di '{0}'"
RequirementLinkSourceNotFound="Oggetto origine per il collegamento del requisito non trovato nel database"

del.webappjobs.setting=Lavori app Web DELMIA

createMBOM.job.completed=Il lavoro Crea MBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> \u00e8 stato completato.
createMBOM.job.failed=Il lavoro Crea MBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> non \u00e8 riuscito.

createSBOM.job.completed=Il lavoro Crea SBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> \u00e8 stato completato.
createSBOM.job.failed=Il lavoro Crea SBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> non \u00e8 riuscito.

updateMBOM.job.completed=Il lavoro Aggiorna MBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> \u00e8 stato completato.
updateMBOM.job.failed=Il lavoro Aggiorna MBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> non \u00e8 riuscito.

updateSBOM.job.completed=Il lavoro Aggiorna SBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> \u00e8 stato completato.
updateSBOM.job.failed=Il lavoro Aggiorna SBOM per l'elemento di produzione <strong>###MFG_TITLE###</strong> non \u00e8 riuscito.

#Quantity Related Message
createContinuousQuantity_Failure=Impossibile creare un elemento continuo a causa di un errore in Quantit\u00e0 prodotto/parte '{0}'.


