# @quickreview gh4  22:10:04  IR-993266: Enhance the exception & error handling in createMBOM & updateMBOM - Started with updateMBOM
# @quickreview gh4  22:10:12  IR-978183: Added support for Bundle Fastener navigation (new Fastener schema)- finding the joining parts
# @quickreview gh4  22:10:13  IR-993266: Enhance the exception & error handling in createMBOM & updateMBOM - pushMode\pullMode updateMBOM handling 
# @quickreview gh4  22:10:17  IR-985201: Ambiguity case of multiple scopes handling changed from choosing the lastCreated to firstCreated item
# @quickreview gh4  22:10:29  IR-993266: Enhance the exception & error handling - Done with updateMBOM
# @quickreview gh4  22:11:08  IR-993266: Enhance the exception & error handling - Done with createMBOM
# @quickreview gh4  24:09:16  IR-1297478: Enhance the exception and error handling when parent item has attached model with frozen criteria

FromProcessReferenceCouldNotBeRetrieved=La r\u00e9f\u00e9rence du processus source n'a pas pu \u00eatre r\u00e9cup\u00e9r\u00e9e
ToProcessReferenceCouldNotBeRetrieved=La r\u00e9f\u00e9rence du processus cible n'a pas pu \u00eatre r\u00e9cup\u00e9r\u00e9e
AlternateRelationCouldNotBeCreated=La relation alternative n'a pas pu \u00eatre cr\u00e9\u00e9e
ProcessReferenceCouldNotBeRetrieved=La r\u00e9f\u00e9rence du processus n'a pas pu \u00eatre r\u00e9cup\u00e9r\u00e9e
ResourceReferenceCouldNotBeRetrieved=La r\u00e9f\u00e9rence de ressource n'a pas pu \u00eatre r\u00e9cup\u00e9r\u00e9e
FirstReferenceCouldNotBeRetrieved=La premi\u00e8re r\u00e9f\u00e9rence n'a pas pu \u00eatre r\u00e9cup\u00e9r\u00e9e
SecondReferenceCouldNotBeRetrieved=La deuxi\u00e8me r\u00e9f\u00e9rence n'a pas pu \u00eatre r\u00e9cup\u00e9r\u00e9e
LinkAlreadyExists=Le lien existe d\u00e9j\u00e0.
GenericServerError=Erreur de serveur g\u00e9n\u00e9rique
BlockingInstances=La r\u00e9f\u00e9rence est toujours instanci\u00e9e en dehors de la port\u00e9e de la suppression. Vous devrez peut-\u00eatre enlever les instances existantes avant de supprimer la r\u00e9f\u00e9rence.
ReorderInstancesFailed=L'ordre des instances n'a pas pu \u00eatre stock\u00e9 dans la base de donn\u00e9es
XMLDocumentRetrievalError=Erreur lors de la recherche d'un document contenant un ou plusieurs fichiers XML.
updateEntityForzenConfigModelVersionException=Impossible de modifier l'instance car une effectivit\u00e9 d'\u00e9volution fig\u00e9e est pr\u00e9sente.
InsertExistingRefsFailed=Impossible de cr\u00e9er les instances.
InsertExistingRefsFailedContextualImplementLink=Impossible de charger l'\u00e9l\u00e9ment en raison d'un lien d'impl\u00e9mentation contextuelle non pris en charge pr\u00e9sent dans la structure.
UpdateEntity_Failed_NoWritePermission=Impossible de modifier l'objet.

# CIM (reroute) failure errMsgs
ImplLinkUnderMultipleScopes=L'\u00e9l\u00e9ment Mfg.Item existe dans plusieurs port\u00e9es. V\u00e9rifiez et remplacez tous les parents qui sont hors de la port\u00e9e \u00e0 partir de leur premi\u00e8re port\u00e9e.
RootMfgItemIsNotValid=La r\u00e9f\u00e9rence de fabrication fournie n'est pas valide
RootProductIsNotValid=La r\u00e9f\u00e9rence de produit fournie n'est pas valide
MfgIsReadOnly=Impossible de mettre \u00e0 jour la MBOM, car l'\u00e9l\u00e9ment Mfg.Item '{0}' est en lecture seule
MBOMUpdateWarn_CandPrdMultiScopesButOneSel=Le produit candidat de l'\u00e9l\u00e9ment Mfg.Item '{0}' '{1}' a plusieurs port\u00e9es Mfg.Item [{2}], en tenant compte du premier '{3}' cr\u00e9\u00e9 parmi eux pour la redirection !
MBOMUpdateWarn_CandPrdMultiScopesButBLSel=Le produit candidat de l'\u00e9l\u00e9ment Mfg.Item '{0}' '{1}' a plusieurs port\u00e9es Mfg.Item [{2}], en tenant compte du dernier '{3}' comme propos\u00e9 par l'ouverture BL !
MBOMUpdateFail_MultipleCandProducts=Des produits \u00e0 multiples candidats '{0}' sont pr\u00e9sents pour l'\u00e9l\u00e9ment Mfg.Item '{1}'. La gestion de l'impact des modifications est une commande recommand\u00e9e pour cet \u00e9l\u00e9ment Mfg.Item.
MBOMUpdateWarn_MultipleCandPrdsButOneSel=Plusieurs produits candidats '{0}' trouv\u00e9s pour Mfg.Item '{1}', en tenant compte du dernier '{2}' parmi eux pour la redirection !
MBOMUpdateFail_InvalidMbomUpdateAction1=Action de mise \u00e0 jour de la MBOM '{0}' non valide envoy\u00e9e
MBOMUpdateFail_InvalidMbomUpdateAction2=Action de mise \u00e0 jour '{0}' de la MBOM non valide envoy\u00e9e pour '{1}'
CandPrdMultipleScopes=Le produit candidat '{0}' a plusieurs port\u00e9es MfgItem
BranchCreationFailed=Echec de cr\u00e9ation de la nouvelle branche
MBOMUpdateFail_RerouteILWithEff=L'option Redirection uniquement n'est pas disponible avec Travail en \u00e9volution ou AM avec applicabilit\u00e9. L'\u00e9volution d'instance est l'action recommand\u00e9e.
MBOMUpdateFail_EvolveInstWithoutEff=L'\u00e9volution d'instance peut uniquement \u00eatre effectu\u00e9e avec Travail en \u00e9volution ou AM avec applicabilit\u00e9. D\u00e9finissez Travail en \u00e9volution ou AM avec applicabilit\u00e9, puis r\u00e9essayez.
MBOMUpdateErr_BLResultFetchFailed=Echec de la recherche du r\u00e9sultat de l'ouverture BL pour [Mfg, Prd] : ['{0}', '{1}']
# Replace Command properties
ReplaceMfgItemScopedWithDifferentProduct=L'op\u00e9ration de remplacement est ignor\u00e9e, car la port\u00e9e de '{0}' est limit\u00e9e \u00e0 d'autres produits
ReplaceMfgItemParentIsReadOnly=L'op\u00e9ration de remplacement est ignor\u00e9e, car l'\u00e9tat de maturit\u00e9 de '{0}' n'est pas lecture/\u00e9criture
ReplaceByLatestNoLatestRevision=L'op\u00e9ration de remplacement est ignor\u00e9e, car '{0}' correspond d\u00e9j\u00e0 \u00e0 la derni\u00e8re r\u00e9vision
ReplaceSelectedItemIsNotMfgItem=L'op\u00e9ration de remplacement est ignor\u00e9e, car '{0}' n'est pas l'\u00e9l\u00e9ment Mfg.Item
ReplaceOperationSuccess=Remplacement de '{0}' par '{1}' r\u00e9ussi.
ReplaceOperationFailed=Echec du remplacement de '{0}' par '{1}'.
ReplaceOperationFailedWithNoTarget=Echec du remplacement de '{0}'.
ReplaceInstanceDoesNotExist=Echec du remplacement. L'instance s\u00e9lectionn\u00e9e n'existe pas.
ReplaceBySelectedRefDoesNotExist=Echec du remplacement de '{0}'. La r\u00e9f\u00e9rence n'existe pas.
ReplaceMfgProcessParentIsReadOnly=L'op\u00e9ration de remplacement est ignor\u00e9e, car le parent de '{0}' est d\u00e9fini \u00e0 l'\u00e9tat de maturit\u00e9 lecture/\u00e9criture
ReplaceSrcMfgChildILsImpacted=Le remplacement des \u00e9l\u00e9ments s\u00e9lectionn\u00e9s '{0}' supprime les liens d'impl\u00e9mentation de leurs enfants. Voulez-vous continuer ?
ReplaceTargetMfgScpdToOOScpPrd=Quelques-uns ou la totalit\u00e9 des \u00e9l\u00e9ments s\u00e9lectionn\u00e9s '{0}' sont li\u00e9s \u00e0 des produits qui ne sont pas instanci\u00e9s dans la structure. Voulez-vous continuer ?
ReplaceTargetMfgScpdToDiffPrd=Les produits de la port\u00e9e des \u00e9l\u00e9ments s\u00e9lectionn\u00e9s '{0}' et celui de l'\u00e9l\u00e9ment remplac\u00e9 par ('{1}') sont diff\u00e9rents. Voulez-vous continuer ?
ReplaceAggregationNotAllowed=L'op\u00e9ration de remplacement est ignor\u00e9e. L'agr\u00e9gation/le remplacement n'est pas autoris\u00e9 entre '{0}' et '{1}'.
ReplaceParentCnfgdWithEvolAndWithoutEff=Le remplacement a \u00e9chou\u00e9, car le parent de l'\u00e9l\u00e9ment Mfg.Item '{0}, '{1}', est configur\u00e9 avec l'\u00e9volution, mais le remplacement n'est pas effectu\u00e9 dans le cadre de l'effectivit\u00e9
ParentHavingFrozenCriteriaAndReplaceDoneWithoutEff=Echec du remplacement car le parent de l'\u00e9l\u00e9ment de fabrication {0} {1} est rattach\u00e9 \u00e0 un mod\u00e8le qui contient au moins un crit\u00e8re fig\u00e9. Utilisez un "Travail sous : Evolution OU Action de modification avec applicabilit\u00e9".
# MBOM update initial validation check errorMsgs
MBOMUpdateFailure_NoUpdateMode=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car le mode de mise \u00e0 jour de la MBOM n'est pas sp\u00e9cifi\u00e9
MBOMUpdateFailure_InvalidUpdateMode=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car le mode de mise \u00e0 jour sp\u00e9cifi\u00e9 est incorrect. Il peut s'agir de 'mbomPull', 'ebomPush' ou 'flowdown'
MBOMUpdateFailure_NoRootMfgItem=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car aucun \u00e9l\u00e9ment Mfg.Item n'est sp\u00e9cifi\u00e9
MBOMUpdateFailure_InvalidRootMfgItem=Impossible de r\u00e9cup\u00e9rer l'\u00e9l\u00e9ment racine Mfg.Item. Indiquez une valeur valide pour 'rootMfgItemID' !
MBOMUpdateFailure_RootMfgItemIsNotMFG=La valeur sp\u00e9cifi\u00e9e pour 'rootMfgItemID' devrait \u00eatre de type MFG, mais elle est de type '{0}'.
MBOMUpdateFail_RootCnfgdWithEvolNUpdateWithoutEff=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car l'\u00e9l\u00e9ment racine Mfg.Item est configur\u00e9 avec l'\u00e9volution mais la mise \u00e0 jour n'est pas effectu\u00e9e dans le cadre de l'effectivit\u00e9 !
MBOMUpdateFail_RootChgCntrldNUpdateWithoutMCA=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car l'\u00e9l\u00e9ment racine Mfg.Item est contr\u00f4l\u00e9 par l'action de modification '{0}', mais la mise \u00e0 jour est effectu\u00e9e sans Travailler sous une AM.
MBOMUpdateFail_RootCntrldByCA_ButDiffInputCA=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car l'\u00e9l\u00e9ment racine Mfg.Item est contr\u00f4l\u00e9 par l'action de modification '{0}', diff\u00e9rente de la valeur Travailler sous une AM donn\u00e9e !
MBOMUpdateFailure_NewRevOfRootFailed=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car il est impossible de cr\u00e9er une nouvelle r\u00e9vision de l'\u00e9l\u00e9ment Mfg.Item '{0}'
MBOMUpdateFailure_NoRootProduct=La mise \u00e0 jour de la MBOM ne peut \u00eatre effectu\u00e9e, car aucun produit racine n'est sp\u00e9cifi\u00e9 et l'\u00e9l\u00e9ment Mfg.Item n'est associ\u00e9 \u00e0 aucun produit
MBOMUpdateFailure_InvalidRootProduct=Impossible de r\u00e9cup\u00e9rer le produit racine. Indiquez une valeur valide pour 'rootProductID'.
MBOMUpdateFailure_RootProductIsNotPRD=La valeur sp\u00e9cifi\u00e9e pour 'rootProductID' devrait \u00eatre de type Produit, mais elle est de type '{0}'.
MBOMUpdateFailure_PushModeNoEngCA=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car aucune AM d'ing. n'est sp\u00e9cifi\u00e9e. Sp\u00e9cifiez une valeur valide pour 'engChangeActionID'.
MBOMUpdateFail_ReviseBehvrChkInvalidOption=Valeur non valide sp\u00e9cifi\u00e9e pour 'reviseBehaviorChecks'. Sp\u00e9cifiez une des valeurs valides parmi '{0}'.
MBOMUpdateFail_CABasedUpdtExpModeInvalidOption=Valeur non valide sp\u00e9cifi\u00e9e pour 'CABasedMbomUpdateExpandMode'. Sp\u00e9cifiez une des valeurs valides parmi '{0}'.

# MBOM update further validation check errorMsgs
PullModeMBOMUpdateFail_RootsNotScoped=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car il n'existe pas de domaine d'application entre le produit et l'\u00e9l\u00e9ment Mfg.Item
PushModeMBOMUpdateFail_CAFactoryNull=Impossible d'obtenir 'ChangeActionFactory'. Contactez l'administrateur.
PushModeMBOMUpdateFail_InvalidEngCA=Impossible de r\u00e9cup\u00e9rer l'AM d'ing. \u00e0 partir de l'EngCA-PID '{0}' donn\u00e9. Sp\u00e9cifiez une valeur valide pour 'engChangeActionID'.
PushModeMBOMUpdateFail_InvalidEngCAState=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car l'AM d'ing. indiqu\u00e9 n'est pas \u00e0 l'\u00e9tat 'Termin\u00e9'
PushModeMBOMUpdateFail_RootMfgNotScoped=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car l'\u00e9l\u00e9ment Mfg.Item n'est associ\u00e9 \u00e0 aucun produit
PushModeMBOMUpdateFail_RootMfgManyScope=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car l'\u00e9l\u00e9ment Mfg.Item a plusieurs produits associ\u00e9s

FlowdownMBOMUpdateFail_NoMfgCA=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car aucune AM de fab. n'est sp\u00e9cifi\u00e9e. Veuillez sp\u00e9cifier une valeur valide pour la valeur 'DS-Change-Authoring-Context' de l'en-t\u00eate de requ\u00eate HTTP.
FlowdownMBOMUpdateFail_InvalidMfgCA=Impossible de r\u00e9cup\u00e9rer l'AM de fab. \u00e0 partir du MfgCA-PID '{0}' donn\u00e9. Sp\u00e9cifiez une valeur valide pour la valeur 'DS-Change-Authoring-Context' de l'en-t\u00eate de requ\u00eate HTTP.
FlowdownMBOMUpdateWarn_NoProposedChanges=L'AM de fab. sp\u00e9cifi\u00e9e n'a pas de modifications de transfert. Essayez avec une AM de fab. ayant des modifications de transfert d'une ou plusieurs AM d'ing.

# MfgCA validation check errorMsgs
MfgCAError_FailedToFetchCAPID=Exception lors de la r\u00e9cup\u00e9ration de l'AM de fab.
MfgCAError_InvalidMfgCAFormat=L'AM de fab. '{0}' sp\u00e9cifi\u00e9e n'est pas au bon format. Sp\u00e9cifiez une valeur au format 'pid:<MfgCA-PID>'
MfgCAError_InvalidMfgCA=Impossible de r\u00e9cup\u00e9rer l'AM de fab. \u00e0 partir du MfgCA-PID '{0}' donn\u00e9. Sp\u00e9cifiez une valeur valide pour MfgCA-PID.
MfgCAError_WorkUnderNotAllowed=Travailler sous n'est pas autoris\u00e9 pour l'AM de fab. donn\u00e9e : '{0}'
MfgCAError_ApplicabilityFetchFailed=Impossible de r\u00e9cup\u00e9rer l'expression d'applicabilit\u00e9 de l'AM de fab. donn\u00e9e : '{0}'
MfgCAError_NoApplicability=L'AM de fab. donn\u00e9e n'a pas d'applicabilit\u00e9 associ\u00e9e. Sp\u00e9cifiez une AM de fab. disposant d'une applicabilit\u00e9.
MfgCAError_InvalidApplicabilityExpn=L'AM de fab. donn\u00e9e a une expression d'applicabilit\u00e9 non valide : '{0}'

# MBOM update failure errMsgs
MBOMUpdateFail_RootMfgIsReadOnly=Impossible de mettre \u00e0 jour la MBOM, car l'\u00e9tat actuel de l'\u00e9l\u00e9ment Mfg.Item racine '{0}' ne permet pas la modification de la structure de la MBOM
MBOMUpdateFail_ParentMfgIsReadOnly=La mise \u00e0 jour de la MBOM ne peut pas \u00eatre effectu\u00e9e, car l'\u00e9l\u00e9ment '{0}' parent est en lecture seule
MBOMUpdateFail_ParentCnfgdWithEvolNUpdateWithoutEff=Impossible de traiter le produit '{0}', car le parent de l'\u00e9l\u00e9ment Mfg.Item '{1}' '{2}' est configur\u00e9 avec l'\u00e9volution mais la mise \u00e0 jour n'est pas effectu\u00e9e sous l'effectivit\u00e9
MBOMUpdateFail_ManyResultingPrdFound=L'\u00e9l\u00e9ment Mfg.Item '{0}' a plusieurs produits r\u00e9sultant associ\u00e9s
MBOMUpdateFail_MfgPartSLCreationNotSupported=La cr\u00e9ation de liens de domaine pour les \u00e9l\u00e9ments Mfg.Parts n'est pas prise en charge
MBOMUpdateFail_CC_CAPID_UnknownValue=Valeur inconnue '{0}' rencontr\u00e9e pour contr\u00f4ler le PID de l'AM de l'\u00e9l\u00e9ment Mfg.Item '{1}'
MBOMUpdateFail_GetChangeControlInfoFailed=Impossible de r\u00e9cup\u00e9rer les informations de contr\u00f4le des modifications des \u00e9l\u00e9ments \u00e0 mettre \u00e0 jour
# Note: Below ReviseErr* msgKeys can't be changed since they are enum names in ReviseAllowedStatus. So they have to be always in sync, if changed at one place then have to be changed at both places!!
ReviseErr_ItemCntrldByCA_ButNoInputCA=La r\u00e9vision a \u00e9chou\u00e9, car l'\u00e9l\u00e9ment Mfg.Item '{0}' est contr\u00f4l\u00e9 par l'AM '{1}', mais la mise \u00e0 jour est effectu\u00e9e sans travailler sous une AM
ReviseErr_ItemCntrldByCA_ButDiffInputCA=La r\u00e9vision a \u00e9chou\u00e9, car l'\u00e9l\u00e9ment Mfg.Item '{0}' est contr\u00f4l\u00e9 par une AM '{1}' diff\u00e9rente de la valeur Travailler sous une AM donn\u00e9e
ReviseErr_ItemCntrldByInputCA_ButIsInROState=La r\u00e9vision a \u00e9chou\u00e9 car l'utilisateur n'a pas d'acc\u00e8s en r\u00e9vision \u00e0 l'\u00e9l\u00e9ment Mfg.Item '{0}'
MBOMUpdtWarn_ItemCfgdWithEvolReviseIgnored=L'\u00e9l\u00e9ment Mfg.Item '{0}' est configur\u00e9 avec l'\u00e9volution, par cons\u00e9quent la r\u00e9vision de l'\u00e9l\u00e9ment est ignor\u00e9e.
ReviseErr_ParentCnfgdWithEvolNUpdateWithoutEff=La r\u00e9vision a \u00e9chou\u00e9, car le parent de l'\u00e9l\u00e9ment Mfg.Item '{0}, '{1}', est configur\u00e9 avec l'\u00e9volution, mais la mise \u00e0 jour n'est pas effectu\u00e9e dans le cadre de l'effectivit\u00e9
# Note: Below UpdateErr* msgKeys can't be changed since they are enum names in UpdateAllowedStatus. So they have to be always in sync, if changed at one place then have to be changed at both places!!
UpdateErr_ItemCntrldByCA_ButNoInputCA=La mise \u00e0 jour a \u00e9chou\u00e9 car {0} '{1}' est contr\u00f4l\u00e9 par l'AM '{2}', mais la mise \u00e0 jour est effectu\u00e9e sans Travailler sous une AM
UpdateErr_ItemCntrldByCA_ButDiffInputCA=La mise \u00e0 jour a \u00e9chou\u00e9 car {0} '{1}' est contr\u00f4l\u00e9 par une AM '{2}' diff\u00e9rente de la valeur Travailler sous une AM donn\u00e9e
UpdateErr_ItemCntrldByInputCA_ButIsInROState=La mise \u00e0 jour a \u00e9chou\u00e9 car l'utilisateur n'a pas d'acc\u00e8s en modification \u00e0 {0} '{1}'
UpdateErr_ItemNotCntrldByCA_AndIsInROState=La mise \u00e0 jour a \u00e9chou\u00e9 car l'utilisateur n'a pas d'acc\u00e8s en modification \u00e0 {0} '{1}'


MBOMUpdateFail_ExceptionCaught=Exception intercept\u00e9e dans la mise \u00e0 jour de la MBOM
MBOMUpdateFail_WebAppExceptionCaught=Exception WebAppException intercept\u00e9e dans la mise \u00e0 jour de la MBOM
BICompErr_RootMfgValidation=Exception constat\u00e9e dans validateGivenRoots lors du traitement de l'\u00e9l\u00e9ment racine rootMfgItem {0} 
BICompErr_ScopeGoodStatusComputeFail=Exception constat\u00e9e dans computeStatusForScopedParents lors du traitement de {0} '{1}'
BICompErr_UnScopedMfgStatusComputeFail=Exception constat\u00e9e dans computeStatusForUnScopedParents lors du traitement de l'\u00e9l\u00e9ment racine Mfg.Item '{1}'
BICompErr_UnScopedPrdStatusComputeFail=Exception constat\u00e9e dans computeStatusForUnScopedParents lors du traitement du produit racine '{1}'
MBOMUpdateFail_DuringExpand=Exception lors du d\u00e9veloppement de {0} '{1}'
MBOMUpdateFail_ExpandCacheCreation=Exception lors de la cr\u00e9ation du cache de d\u00e9veloppement pour {0} '{1}'
MBOMUpdateFail_FillingCacheWithLinkInfo=Exception lors du remplissage du cache de d\u00e9veloppement avec des informations de liens
ExpandFail_CycliStructureDetected_MFG=Structure cyclique d\u00e9tect\u00e9e pour la fabrication : '{0}' avec le chemin d'occurrence '{1}'
ExpandFail_CycliStructureDetected_PRD=Structure cyclique d\u00e9tect\u00e9e pour la fabrication : '{0}' avec le chemin d'occurrence '{1}'
PushModeMBOMUpdate_GetRealizedObjsFailed=Exception lors de l'obtention d'objets r\u00e9alis\u00e9s \u00e0 partir d'une AM donn\u00e9e
MBOMMUpdateFail_GettingUpdateMap4ModDel=L'obtention de mbomUpdateMap a \u00e9chou\u00e9 pour l'occurrence de fabrication {0} avec l'action de remplacement/redirection/suppression. El\u00e9ment \u00e0 mettre \u00e0 jour ignor\u00e9
MBOMMUpdateFail_GettingUpdateMapForMod=L'obtention de mbomUpdateMap a \u00e9chou\u00e9 pour l'occurrence de fabrication {0} avec l'action de remplacement/redirection. El\u00e9ment \u00e0 mettre \u00e0 jour ignor\u00e9
MBOMMUpdateFail_GettingUpdateMapForDel=L'obtention de mbomUpdateMap a \u00e9chou\u00e9 pour l'occurrence de fabrication {0} avec l'action de suppression. El\u00e9ment \u00e0 mettre \u00e0 jour ignor\u00e9
MBOMMUpdateFail_GettingUpdateMapForEvl=L'obtention de mbomUpdateMap a \u00e9chou\u00e9 pour l'occurrence de fabrication {0} avec l'action d'\u00e9volution. El\u00e9ment \u00e0 mettre \u00e0 jour ignor\u00e9
MBOMMUpdateFail_GettingUpdateMapForNew=L'obtention de mbomUpdateMap a \u00e9chou\u00e9 pour l'occurrence de produit {0} avec l'action de cr\u00e9ation. Produit \u00e0 mettre \u00e0 jour ignor\u00e9
MBOMMUpdateFail_GettingUpdateMapForNewFasten=L'obtention de mbomUpdateMap a \u00e9chou\u00e9 pour l'occurrence de fixation {0} avec l'action de cr\u00e9ation. El\u00e9ment \u00e0 mettre \u00e0 jour ignor\u00e9
PullModeMBOMUpdateFail_UpdateMapPrepartn=Exception lors de la recherche de changements delta et de la pr\u00e9paration de mbomUpdateMap
PushModeMBOMUpdate_GetCAEventsMQLFail=Exception lors de la r\u00e9cup\u00e9ration des \u00e9v\u00e9nements du journal d'actions de modification via MQL
PushModeMBOMUpdate_FindingRerouteCandFail=Exception lors de la recherche d'un candidat de redirection pour la fabrication '{0}'
PushModeMBOMUpdate_MultipleCandPathsFound=Plusieurs chemins d'occurrence de produits candidats trouv\u00e9s pour un produit candidat '{0}' donn\u00e9
PushModeUpdateWarn_ImplementingMfgNotFound=Instance de produit '{0}' de l'UF '{1}' ignor\u00e9e pour la mise \u00e0 jour. Le produit n'a jamais \u00e9t\u00e9 impl\u00e9ment\u00e9 OU l'impl\u00e9mentation de l'\u00e9l\u00e9ment Mfg.Item est pr\u00e9sente sous un sous-assemblage associ\u00e9 OU l'impl\u00e9mentation de l'\u00e9l\u00e9ment Mfg.Item est supprim\u00e9e.
PushModeUpdateErr_UpdateMapPrepFail=Exception constat\u00e9e lors de la pr\u00e9paration de mbomUpdateMap pour le contexte MBOM associ\u00e9 '[fabrication : {0}, production : {1}]'. Poursuite de la mise \u00e0 jour avec le prochain contexte MBOM associ\u00e9.
PushModeUpdateErr_ExcpnInMbomUpdate=Exception constat\u00e9e lors de la mise \u00e0 jour de la MBOM pour le contexte MBOM associ\u00e9 '[fabrication : {0}, production : {1}]'. Poursuite de la mise \u00e0 jour avec le prochain contexte MBOM associ\u00e9.
PushModeUpdateErr_ExcpnInMbomUpdateForNew=Exception constat\u00e9e lors de la mise \u00e0 jour de la MBOM pour les nouveaux produits du contexte MBOM associ\u00e9 '[fabrication : {0}, production : {1}]'. Poursuite de la mise \u00e0 jour avec le prochain contexte MBOM associ\u00e9.
PushModeUpdateErr_ExcpInScpMbomCtxUpdateOfScpBrokenMfgSA=Exception constat\u00e9e lors de la mise \u00e0 jour du contexte MBOM associ\u00e9 de l'AM de fab. redirig\u00e9e selon la port\u00e9e '{0}' sous le contexte parent [fabrication : {1}, production : {2}]
InvalidValueForEnumInputType=Valeur non valide sp\u00e9cifi\u00e9e pour '{0}'. Sp\u00e9cifiez l'une des valeurs valides parmi '{1}' !
ItemTypeNotAvailable=Echec de la r\u00e9cup\u00e9ration du type d'\u00e9l\u00e9ment. Veuillez fournir le type d'\u00e9l\u00e9ment.

UpdateFailure_CommitFailed=La mise \u00e0 jour n'a pas \u00e9t\u00e9 valid\u00e9e !
UpdateFailure_CreateNewMfgItems=La mise \u00e0 jour n'a pas r\u00e9ussi \u00e0 cr\u00e9er de nouveaux \u00e9l\u00e9ments de fabrication
UpdateWarning_FetchedScpdPrdIDIsNotRef=Echec de la r\u00e9cup\u00e9ration du produit associ\u00e9 de l'\u00e9l\u00e9ment de fabrication '{0}' (le PID de produit associ\u00e9 '{1}' trouv\u00e9 n'est pas un PID de r\u00e9f\u00e9rence valide).
UpdateWarning_BLEntityWrapperCreationFailed=Echec de la cr\u00e9ation de l'objet EntityWrapper pour l'ID d'ouverture BL '{0}'. Ce BL va \u00eatre ignor\u00e9.
UpdateWarning_BLFindingFailed=Echec de la recherche du BL avec l'ID d'ouverture '{0}'. Ce BL va \u00eatre ignor\u00e9.

# Fasten update failure errMsgs
FastenUpdateFail_NotPushModeUpdate=La mise \u00e0 jour de fixation ne peut pas \u00eatre effectu\u00e9e puisque la mise \u00e0 jour n'est pas effectu\u00e9e en mode flowdown ou ebomPush
FastenUpdateFail_NewCaseInvalidOption=Valeur non valide sp\u00e9cifi\u00e9e pour 'fastenUpdateForNewFastener'. Sp\u00e9cifiez une des valeurs valides parmi '{0}'.
FastenCreateFail_NoImpactedMfgPartFound=Impossible de traiter la nouvelle fixation '{0}', car l'\u00e9l\u00e9ment Mfg.Parts affect\u00e9 n'est pas disponible pour la fixation {1}
FastenNewOptn1Fail_ParentCnfgdWithEvolNUpdateWithoutEff=Impossible d'instancier la fixation '{0}' pour la fixation '{1}', car le parent '{2}' est configur\u00e9 avec l'\u00e9volution mais la mise \u00e0 jour n'est pas effectu\u00e9e sous l'effectivit\u00e9
NewFastenerWarn_Ignored_NoStackingPartsFoundForMCXConn=Avertissement de nouvelle fixation : ignorer la nouvelle instance de fixation, car aucune pi\u00e8ce d'empilement n'est trouv\u00e9e pour la connexion MCX {0}
NewFastenerWarn_Ignored_MCXIntersectedListEmpty=Avertissement de nouvelle fixation : ignorer la nouvelle instance de fixation, car intersectedMCXList est vide
NewFastenerErr_FastenerInstanceNotFound=Erreur de nouvelle fixation : l'instance n'est pas disponible dans la base de donn\u00e9es pour cette nouvelle instancePID de fixation {0}
NewFastenerErr_FailToGetSiblingFasteners=Erreur de nouvelle fixation : \u00e9chec de l'extraction de fixations s\u0153urs depuis faisceau-fixation {0} de la nouvelle instance de fixation {1}
NewFastenerWarn_Ignored_InvalidPartIDForBundleConn=Avertissement de nouvelle instance : ignorer la connexion {0}, car une instancePID de pi\u00e8ce de jonction non valide {1} a \u00e9t\u00e9 trouv\u00e9e pour la nouvelle instance de fixation {2}
NewFastenerErr_FailToGetJoiningPartsFrmBundle=Erreur de nouvelle fixation : \u00e9chec d'extraction assemblage-pi\u00e8ces depuis faisceau-fixation {0} de la nouvelle instance de fixation {1}
NewFastenerWarn_Ignored_NoDetailsFetched=Avertissement de nouvelle fixation : la nouvelle instance de fixation va \u00eatre ignor\u00e9e, car nous n'avons pas obtenu de d\u00e9tails \u00e0 son sujet lors du d\u00e9veloppement du produit. S'il s'agit d'un sch\u00e9ma faisceau-fixation, peut-\u00eatre qu'aucune fixation du faisceau n'est impl\u00e9ment\u00e9e par une quelconque fixation.
NewFastenerWarn_Ignored_NoFastenersFound=Avertissement de nouvelle fixation : la nouvelle instance de fixation va \u00eatre ignor\u00e9e, car aucune fixation n'a \u00e9t\u00e9 trouv\u00e9e pour relier les m\u00eames pi\u00e8ces que la nouvelle fixation.
NewFastenerWarn_Ignored_NoImpMfgItemFound=Avertissement de nouvelle fixation : la nouvelle instance de fixation va \u00eatre ignor\u00e9e, car aucun \u00e9l\u00e9ment Mfg.Item n'a \u00e9t\u00e9 trouv\u00e9 impl\u00e9mentant l'\u00e9l\u00e9ment {0} '{1}' affect\u00e9 avec le chemin d'occurrence {2}
NewFastenerWarnMsg_ChoosenOneAmongMany={0} fixations impl\u00e9ment\u00e9es trouv\u00e9es associant les m\u00eames pi\u00e8ces '{1}' que la fixation donn\u00e9e '{2}'. Parmi lesquelles, '{3}' impl\u00e9ment\u00e9e par la fixation '{4}' est choisie et les fixations restantes '{5}' sont ignor\u00e9es
FastenUpdateErr_ReviseMfgPartsFailed=Echec de la r\u00e9vision d'une ou plusieurs pi\u00e8ces de fabrication

# MBOM update report errMsgs
UpdateMfgItemErr_BIStatusFail=Echec de la r\u00e9cup\u00e9ration du statut BI
UpdateMfgItemErr_UpdateFailed=Echec de la mise \u00e0 jour
UpdateMfgItemErr_DeleteInstFailed=Echec de la suppression de l'instance
UpdateMfgItemErr_RerouteSLFailed=Echec de la redirection du lien de port\u00e9e
UpdateMfgItemErr_NoCandOccRefPaths=Aucun chemin occRef candidat trouv\u00e9 !
UpdateMfgItemErr_RerouteILFailed=Echec de la redirection du lien d'impl\u00e9mentation
UpdateMfgItemErr_ReplaceFail_ParentROState=Echec du remplacement de '{0}' car le '{1}' parent est en lecture seule
UpdateMfgItemErr_DeleteFail_ParentROState=Echec de la suppression de '{0}' car le '{1}' parent est en lecture seule
UpdateMfgItemErr_EvolveFail_ParentROState=Echec de l'\u00e9volution de '{0}' car le '{1}' parent est en lecture seule
UpdateMfgItemErr_EvolveInstAPIFailure=Echec de l'\u00e9volution de '{0}', car l'API a \u00e9chou\u00e9 avec le statut '{1}'
MBOMUpdateMsg_BLReplyIsIgnore=Ignor\u00e9 car demand\u00e9 par BL
MBOMUpdateErr_BLReplyInvalidChoice=Ignor\u00e9 car un choix non valide '{0}' a \u00e9t\u00e9 renvoy\u00e9 par BL
MBOMUpdateErr_BLExecutionReturnNonZero=Ignor\u00e9 car l'ex\u00e9cution de BL a \u00e9t\u00e9 renvoy\u00e9e avec une valeur non nulle '{0}'
MBOMUpdateErr_BLExecutionFailed_Item=Ignor\u00e9 car l'ex\u00e9cution de BL a \u00e9chou\u00e9 avec une exception, voir Erreurs globales pour conna\u00eetre les d\u00e9tails de l'exception.
MBOMUpdateErr_BLExecutionFailed_Global=L'ex\u00e9cution de BL a \u00e9chou\u00e9 avec une exception
UpdateMfgItemWarn_ScpBrknSA_RerouteHadFailedInItsParentCtx=Ignor\u00e9 car la redirection de son parent dont la port\u00e9e est endommag\u00e9e '{0}' a \u00e9chou\u00e9 dans le contexte de son grand-parent '{1}'
UpdateMfgItemWarn_ScpBrknSA_FailToFindChildrenForUpdate=Ignor\u00e9 car la mise \u00e0 jour n'a pas r\u00e9ussi \u00e0 trouver les enfants du parent dont la port\u00e9e est endommag\u00e9e '{0}' pour les mettre \u00e0 jour.
UpdateMfgItemWarn_ScpBrknSA_FailedToUpdatMfgInstsWithNewRevInfo=Ignor\u00e9 car la mise \u00e0 jour n'a pas r\u00e9ussi \u00e0 trouver les instances de fabrication sous la nouvelle r\u00e9vision du parent dont la port\u00e9e est endommag\u00e9e '{0}'
UpdateMfgItemWarn_ScpBrknSA_FailedToFindRerouteILForImpactedChildren=Ignor\u00e9 car la mise \u00e0 jour n'a pas r\u00e9ussi \u00e0 trouver les candidats IL de redirection pour les enfants affect\u00e9s sous la nouvelle r\u00e9vision du parent dont la port\u00e9e est endommag\u00e9e '{0}'
UpdateMfgItemWarn_ScpdParentNotMarkedToExpand=Ignor\u00e9 car son parent associ\u00e9 '{0}' n'est pas d\u00e9velopp\u00e9 conform\u00e9ment \u00e0 la configuration XML

ObjectProcessedInPreviousRunMsg=Ignorer cet objet car il a d\u00e9j\u00e0 \u00e9t\u00e9 mis \u00e0 jour lors d'une ex\u00e9cution pr\u00e9c\u00e9dente
ObjectProcessedByUserMsg=Ignorer cet objet car il a d\u00e9j\u00e0 \u00e9t\u00e9 trait\u00e9 par l'utilisateur
ObjectIgnoredAsAskedByBL=Ignorer cet objet comme demand\u00e9 par BL
ObjectUnderScopedSubAsslyORImplingMfgNotFound=Ignor\u00e9 car l'impl\u00e9mentation de l'\u00e9l\u00e9ment Mfg.Item est pr\u00e9sente sous un sous-assemblage de port\u00e9e OU aucune impl\u00e9mentation de l'\u00e9l\u00e9ment Mfg.Item de ce produit n'a \u00e9t\u00e9 trouv\u00e9e
noAttrValueFound=Valeur d'attribut introuvable

# CreateMfgItems resultReport errMsgs
createMfgItemErrorMsgRootMfgItemIsNotValid=La r\u00e9f\u00e9rence de fabrication fournie n'est pas valide
createMfgItemErrorMsgRootProductIsNotValid=La r\u00e9f\u00e9rence de produit fournie n'est pas valide
createMfgItemError_ExcepCreatingSLForSelItems=Exception lors de la cr\u00e9ation du lien de port\u00e9e entre les \u00e9l\u00e9ments s\u00e9lectionn\u00e9s/donn\u00e9s
createMfgItemError_ExcepCreatingILForSelItems=Exception lors de la cr\u00e9ation du lien d'impl\u00e9mentation pour les \u00e9l\u00e9ments s\u00e9lectionn\u00e9s/donn\u00e9s
createMfgItemError_SubStructureCreationFailed=La cr\u00e9ation de la sous-structure de fabrication pour le produit '{0}' avec l'occurrence '{1}' a \u00e9chou\u00e9 en raison d'une exception lors de la r\u00e9cup\u00e9ration des enfants du produit
createMfgItemErrorMsgExceptionSeenIn=Exception constat\u00e9e dans {0}
createMfgItemError_MBOMCreationFailedForOcc=Cr\u00e9ation de MBOM ignor\u00e9e pour le produit '{0}' avec l'occurrence '{1}' en raison d'une exception constat\u00e9e dans {2}
createMfgItemError_ExceptionInThread=Exception dans le filetage - {0}
createMfgItemError_ThreadExecutionFail_Global=L'ex\u00e9cution du filetage - {0} a \u00e9chou\u00e9 avec une exception
#createMfgItemError_ThreadExecutionFail_Item=Failed since execution of Thread {0} failed with an exception. See GlobalErrors for details of exception.
createMfgItemErrorMsgRootsNotScoped=L'\u00e9l\u00e9ment Mfg.Item racine et le produit racine sont hors de la port\u00e9e
createMfgItemError_ExcepWhileRootsScopeCheck=Exception lors de la validation de la port\u00e9e entre l'\u00e9l\u00e9ment Mfg.Item racine et le produit racine
createMfgItemWarnMsgNoPrdOccsToProcess=Il n'y a pas d'occurrences de produit \u00e0 traiter
createMfgItemErrorMsgExcepInGettingRefAtts=Exception lors de la r\u00e9cup\u00e9ration des attributs de r\u00e9f\u00e9rence dans {0}
createMfgItemErrorMsgExcepInGettingInstAtts=Exception lors de la r\u00e9cup\u00e9ration des attributs d'instance dans {0}
#createMfgItemErrorMsgBLExecutionFail      =Ignored as BL execution failed with an exception, see GlobalErrors for exception details!
createMfgItemErrorMsgBLReplyIsIgnore=Ignor\u00e9 car demand\u00e9 par BL
createMfgItemErrorMsgBLDidntProvideAnyInfo=Ignor\u00e9, car BL n'a pas fourni les informations requises
createMfgItemErrorMsgProductHasMultipleScopes=Ignor\u00e9, car le produit a plusieurs port\u00e9es
createMfgItemErrMsg_GettingBaseLineMaturityValues=Exception \u00e0 l'obtention des valeurs de base pour les \u00e9tats de maturit\u00e9
createMfgItemErrorMsgProductNoHighestState=Ignor\u00e9, car le produit a plusieurs port\u00e9es et aucune d'entre elles n'est \u00e0 un \u00e9tat de maturit\u00e9 valide (il doit \u00eatre \u00e0 l'\u00e9tat {0} ou {1} ou {2})
createMfgItemWarn_PrdHasManyScopesButOneSel=Le produit a plusieurs port\u00e9es Mfg.Item [{0}] ; parmi elles,  '{1}' est consid\u00e9r\u00e9e comme la premi\u00e8re cr\u00e9\u00e9e.
createMfgItemErrorMsgIgnoredDueToException=Ignor\u00e9 en raison d'une exception dans {0}
createMfgItemErrorMsgScopeNotFound=Ignor\u00e9 car l'\u00e9l\u00e9ment Mfg.Item associ\u00e9 est introuvable
createMfgItemError_ExceptionInDataPreparation=Exception {0} lors de la pr\u00e9paration des donn\u00e9es dans {0}
createMfgItemErrorWhileFetchingReferences={0} a \u00e9chou\u00e9 \u00e0 r\u00e9cup\u00e9rer des r\u00e9f\u00e9rences enfant/parent
createMfgItemError_ExceptionWhileCreatingSL=Exception {0} lors de la cr\u00e9ation du lien de port\u00e9e
createMfgItemError_InstanceCreationFailNoExcp={0} Echec de la cr\u00e9ation de l'instance sans exception 
createMfgItemError_ExceptionWhileCreatingInst=Exception {0} lors de la cr\u00e9ation de l'instance
createMfgItemError_ExceptionWhileCreatingIL=Exception {0} lors de la cr\u00e9ation du lien d'impl\u00e9mentation
createMfgItemError_ExceptionWhileCommitContext=Exception lors de la validation du contexte dans {0}
createMfgItemErrorMsgExternalJavaIgnoreAsBLNotAvilable=Ignor\u00e9 car le langage EKL a \u00e9t\u00e9 requis par l'ouverture Java externe mais il n'est pas disponible
createMfgItemMsg_ActionChangedToIgnore=Action de modification \u00e0 ignorer pour {0} avec AggMfgItemPID {1}
createMfgItemErrorMsg_ParentWorkUnderStatus_isNotValid_As_NoInputCA_ButAggMfgIsControlledByCA=Ignor\u00e9 car l'\u00e9l\u00e9ment Mfg.Item d'agr\u00e9gation est contr\u00f4l\u00e9 par l'action de modification, mais aucune action de modification n'a \u00e9t\u00e9 fournie en entr\u00e9e
createMfgItemErrorMsg_ParentWorkUnderStatus_isNotValid_As_InputCA_AggMfgCA_AreDifferernt=Ignor\u00e9 car l'\u00e9l\u00e9ment Mfg.Item d'agr\u00e9gation est contr\u00f4l\u00e9 par une action de modification diff\u00e9rente de celle fournie en entr\u00e9e
createMfgItemErrorMsgExceptionWhileFetchingModel=Echec de la consommation du produit en raison d'une erreur survenue lors de la r\u00e9cup\u00e9ration du mod\u00e8le rattach\u00e9 \u00e0 l'\u00e9l\u00e9ment de fabrication cible
createMfgItemErrorMsg_ModelHavingFrozenCriteria=Echec de la consommation du produit, car l'\u00e9l\u00e9ment de fabrication cible est rattach\u00e9 \u00e0 un mod\u00e8le qui contient au moins un crit\u00e8re fig\u00e9. tilisez un "Travail sous : Evolution OU Action de modification avec applicabilit\u00e9".
createMfgItemErrorMsg_ExceptionFailure_Title=Echec de la cr\u00e9ation
createMfgItemErrorMsg_ExceptionFailure_SubTitle=La cr\u00e9ation du ou des objets a \u00e9chou\u00e9 avec l'erreur :

reuseServiceWarn_PrdDoesnthaveScopedSparePart=Le produit {0} est associ\u00e9 \u00e0 {1}, mais il est ignor\u00e9 et une pi\u00e8ce de rechange {2} est cr\u00e9\u00e9e pour consommer le produit {3}

# License error
licenceError=Aucune des licences dans {0} n'est attribu\u00e9e \u00e0 l'utilisateur : {1}. Veuillez contacter votre administrateur syst\u00e8me.
noRoleFound=Aucun r\u00f4le n'a \u00e9t\u00e9 trouv\u00e9 dans PPW pour : {0}.

noAttrValueFound=Valeur d'attribut introuvable

# BL error
BLError=Echec de l'action suite \u00e0 une v\u00e9rification BL : {0}.
NoBLMessage=Aucun message BL trouv\u00e9

# Commit error
CommitError=Impossible de valider l'\u00e9l\u00e9ment dans la base de donn\u00e9es \u00e0 cause de la transaction {0}.

RPLinkCreationFailed=Le nouveau lien Produit r\u00e9sultant ne peut pas \u00eatre cr\u00e9\u00e9
ScopeLinkDeletionFailed=Impossible de supprimer le lien Port\u00e9e
RPLinkDeletionFailed=Impossible de supprimer le lien Produit r\u00e9sultant

# Create Ref error
InvalidDimensionType=Type de dimension non valide envoy\u00e9 - {0}

# Scope Link creation
createScopeLinkError=Le nouveau lien de domaine ne peut pas \u00eatre cr\u00e9\u00e9
createScopeLinkErrorIncompatibleExistingIL=Le lien Port\u00e9e ne peut pas \u00eatre cr\u00e9\u00e9 en raison d'un lien d'impl\u00e9mentation existant incompatible. Veuillez d'abord supprimer le lien d'impl\u00e9mentation de l'instance de r\u00e9f\u00e9rence {0}.
createScopeLinkErrorNotAuthorizedByBL=Le lien de domaine ne peut pas \u00eatre cr\u00e9\u00e9 en raison de l'\u00e9chec de l'autorisation de BL
createScopeLinkErrorBLFailure=Le lien de domaine ne peut pas \u00eatre cr\u00e9\u00e9 en raison d'un \u00e9chec interne de BL
createScopeLinkErrorPatternNOTAuthorized=Le lien de domaine ne peut pas \u00eatre cr\u00e9\u00e9 en raison d'un mod\u00e8le de donn\u00e9es non autoris\u00e9

# Partial Scope Link creation
SLAlreadyExistingSolved=Le lien Port\u00e9e partielle existe d\u00e9j\u00e0 et ne peut pas \u00eatre cr\u00e9\u00e9
SLAlreadyExistingBroken=Le lien Port\u00e9e partielle existe d\u00e9j\u00e0, mais il est endommag\u00e9 et ne peut donc pas \u00eatre cr\u00e9\u00e9
invalidArg=Les entr\u00e9es ne sont pas \u00e9valu\u00e9es correctement.
createPartialScopeLinkErrorBLFailure=Le lien Port\u00e9e partielle ne peut pas \u00eatre cr\u00e9\u00e9 en raison d'un \u00e9chec interne de BL
createPartialScopeLinkErrorNotAuthorizedByBL=Le lien Port\u00e9e partielle ne peut pas \u00eatre cr\u00e9\u00e9 en raison de l'\u00e9chec de l'autorisation de BL
createPartialScopeLinkErrorIncompatibleExistingIL=Le lien Port\u00e9e partielle ne peut pas \u00eatre cr\u00e9\u00e9 en raison d'un lien d'impl\u00e9mentation existant incompatible. Veuillez d'abord supprimer le lien d'impl\u00e9mentation de l'instance de r\u00e9f\u00e9rence {0}.
createPartialScopeLinkError=Le nouveau lien Port\u00e9e partielle ne peut pas \u00eatre cr\u00e9\u00e9

managePartialScopeFail_InvalidOption=Valeur non valide sp\u00e9cifi\u00e9e pour l'action de port\u00e9e partielle. Sp\u00e9cifiez une des valeurs valides parmi '{0}'.

# MFN AltSubBL Related Messages
AltSubBLErr_NoBLExistis=Le script EKL AltSubBL n'existe pas
AltSubBLErr_ExecutionFailed=Impossible d'ex\u00e9cuter AltSubBL
AltSubBLErr_FailedToReadOutput=Impossible de lire la sortie de AltSub-BLResult
AltSubBLErr_InvalidOPListSize=Disparit\u00e9 de taille des listes de sortie BL ! Les tailles sont OutputListOfEngItemReference-{0}, OutputListOfContextsInstance-{1}, OutputListOfContextsReference-{2}, OutputListOfStatus-{3}, OutputListOfRelationType-{4}.
AltSubBLErr_EngItemRefPIDEmpty=Aucune valeur sp\u00e9cifi\u00e9e pour 'AltSub-EngItemRef'
AltSubBLErr_StatusInvalidOption=Valeur non valide '{0}' sp\u00e9cifi\u00e9e pour 'AltSub-Status'
AltSubBLErr_RelTypeInvalidOption=Valeur non valide '{0}' sp\u00e9cifi\u00e9e pour 'AltSub-RelationType'
AltSubBLErr_InvalidRefInstContext=La valeur ReferenceContext et/ou InstanceContext n'est pas celle attendue
AltSubBLSuggn_ForContextOfRefSubstitue=(ReferenceContext doit avoir une valeur valide et InstanceContext doit \u00eatre vide)
AltSubBLSuggn_ForContextOfInstSubstitue=(ReferenceContext doit \u00eatre vide et InstanceContext doit avoir une valeur valide)
AltSubBLSuggn_ForContextOfAlternate=(ReferenceContext et InstanceContext doivent \u00eatre vides)

RequirementLinkTargetNotFound="L'exigence pour la connexion est introuvable dans la base de donn\u00e9es"
RequirementLinkNotFound="RequirementLinkRefRef  '{0}' est introuvable dans la base de donn\u00e9es"
RequirementLinkDeletionFailed="Le lien vers l'exigence n'a pas pu \u00eatre supprim\u00e9 \u00e0 cause de '{0}'"
RequirementLinkSourceNotFound="L'objet source pour le lien de l'exigence est introuvable dans la base de donn\u00e9es"

del.webappjobs.setting=Travaux DELMIA Webapp

createMBOM.job.completed=La cr\u00e9ation du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9t\u00e9 r\u00e9alis\u00e9e avec succ\u00e8s.
createMBOM.job.failed=La cr\u00e9ation du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9chou\u00e9.

createSBOM.job.completed=La cr\u00e9ation du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9t\u00e9 r\u00e9alis\u00e9e avec succ\u00e8s.
createSBOM.job.failed=La cr\u00e9ation du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9chou\u00e9.

updateMBOM.job.completed=La mise \u00e0 jour du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9t\u00e9 r\u00e9alis\u00e9e avec succ\u00e8s.
updateMBOM.job.failed=La mise \u00e0 jour du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9chou\u00e9.

updateSBOM.job.completed=La mise \u00e0 jour du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9t\u00e9 r\u00e9alis\u00e9e avec succ\u00e8s.
updateSBOM.job.failed=La mise \u00e0 jour du travail MBOM pour l'\u00e9l\u00e9ment de fabrication <strong>###MFG_TITLE###</strong> a \u00e9chou\u00e9.

#Quantity Related Message
createContinuousQuantity_Failure=Echec de la cr\u00e9ation de l'\u00e9l\u00e9ment continu en raison d'une erreur au niveau de la quantit\u00e9 de produits/pi\u00e8ces '{0}'.


