# Copyright 2019-2025 Dassault Systemes. All rights reserved.
#
#   Subject: Propose NLS support for Version Graph error messages.
NonLinearVersioning.Notice.SemanticEdgeNotFound=No se ha encontrado la relaci\u00f3n sem\u00e1ntica con la eliminaci\u00f3n, por lo que no se ha realizado ninguna operaci\u00f3n.
NonLinearVersioning.Error.NLVStatus=No se puede obtener el modo de gr\u00e1fico de revisi\u00f3n (lineal o no).
NonLinearVersioning.Error.SystemCompletion=No se puede obtener el objeto asociado para la operaci\u00f3n actual.
NonLinearVersioning.Error.SemanticEdgeNotDeleted=No se puede eliminar la relaci\u00f3n sem\u00e1ntica.
NonLinearVersioning.Error.SemanticNONE=No hay NING\u00daN operador no v\u00e1lido en esta solicitud.
NonLinearVersioning.Error.ItemNotDeleted=No se puede eliminar el elemento.
NonLinearVersioning.Error.ItemNotLoaded=No se puede cargar el elemento.
NonLinearVersioning.Error.ItemNotSet=No se ha establecido ning\u00fan elemento.
NonLinearVersioning.Error.ItemFromVersion=No se puede obtener el elemento de la revisi\u00f3n.
NonLinearVersioning.Error.ItemFromVersionModel=No se puede continuar porque este producto es propiedad de otro usuario.
NonLinearVersioning.Error.ItemAlreadyExist=Ya se ha establecido un elemento para esta revisi\u00f3n.
NonLinearVersioning.Error.ItemCreation=No se puede crear el elemento.
NonLinearVersioning.Error.VersionNotSet=No se ha establecido ninguna revisi\u00f3n.
NonLinearVersioning.Error.VersionNull=El valor del ID f\u00edsico de la revisi\u00f3n de entrada es nulo o est\u00e1 vac\u00edo.
NonLinearVersioning.Error.TypeNull=El tipo de negocio de entrada no est\u00e1 definido (valor nulo o vac\u00edo).
NonLinearVersioning.Error.VersionCopyFrom=No se puede obtener la copia de.
NonLinearVersioning.Error.VersionDelete=No se puede eliminar la revisi\u00f3n.
NonLinearVersioning.Error.computeVersionNumber=No se puede calcular el n\u00famero de revisi\u00f3n (informaci\u00f3n adicional: $1.).
NonLinearVersioning.Error.VersionDeletePropagate=No se puede propagar la eliminaci\u00f3n de la revisi\u00f3n.
NonLinearVersioning.Error.VersionDeleteSpinOff=No se puede volver a enrutar la DERIVACI\u00d3N despu\u00e9s de la eliminaci\u00f3n de la revisi\u00f3n.
NonLinearVersioning.Error.VersionDeleteLeaf=Solo se puede eliminar la revisi\u00f3n de hoja.
NonLinearVersioning.Error.VersionCheckMajor=No se puede comprobar el acceso a la revisi\u00f3n principal.
NonLinearVersioning.Error.VersionToItem=No se puede conectar la revisi\u00f3n al elemento.
NonLinearVersioning.Error.VersionNoItem=La revisi\u00f3n no est\u00e1 asociada a un elemento y, por lo tanto, no admite el modo de gr\u00e1fico de versi\u00f3n.
NonLinearVersioning.Error.VersionAddSemantic=No se puede agregar ni actualizar el enlace sem\u00e1ntico.
NonLinearVersioning.Error.VersionReviseMajor=La creaci\u00f3n de una nueva revisi\u00f3n no est\u00e1 autorizada.
NonLinearVersioning.Error.VersionDuplicate=La creaci\u00f3n de un nuevo objeto a partir de uno existente no est\u00e1 autorizada.
NonLinearVersioning.Error.VersionFamily=Error al buscar la revisi\u00f3n de la familia.
NonLinearVersioning.Error.VersionFamilyNull=El valor del ID de la familia de revisiones no puede ser nulo.
NonLinearVersioning.Error.VersionFamilyNotSet=No se ha establecido el ID de la familia de revisiones de entrada.
NonLinearVersioning.Error.VersionsNotLoaded=No se puede acceder a la familia de revisi\u00f3n.
NonLinearVersioning.Error.AddVersionsNull=El valor de la asignaci\u00f3n de solicitudes de adici\u00f3n de revisi\u00f3n no puede ser nulo.
NonLinearVersioning.Error.GraphVersionsNull=El valor de la asignaci\u00f3n de solicitudes de revisi\u00f3n de gr\u00e1fico sem\u00e1ntico no puede ser nulo.
NonLinearVersioning.Error.AddVersionRequestNull=El valor de la solicitud no puede ser nulo.
NonLinearVersioning.Error.getLastVersionsFromJson=El valor de la solicitud de \u00faltima versi\u00f3n no puede ser nulo.
NonLinearVersioning.Error.AddVersionRequestSpinOff=La DERIVACI\u00d3N no puede estar solo en la solicitud de adici\u00f3n de revisi\u00f3n.
NonLinearVersioning.Error.AddVersionRequestSpinOffNew=La DERIVACI\u00d3N no se puede combinar con NUEVO en el modo de revisi\u00f3n lineal.
NonLinearVersioning.Error.AddVersionRequestFore=La operaci\u00f3n FORE intenta crear un ciclo en el gr\u00e1fico de versi\u00f3n sem\u00e1ntica para $1.!" ) ; }
NonLinearVersioning.Error.AddVersionRequestForeSameSource=No se admite la operaci\u00f3n FORE si el ancestro y el origen son el mismo.
NonLinearVersioning.Error.AddVersionRequestSpinOffDup=La DERIVACI\u00d3N no se puede combinar con DUPLICADO en el modo de revisi\u00f3n lineal.
NonLinearVersioning.Error.AddVersionRequestSameItemSemantic=Todas las intenciones sem\u00e1nticas deben proceder del mismo elemento.
NonLinearVersioning.Error.AddVersionRequestSemanticOneMax=Solo se permite una de estas intenciones sem\u00e1nticas de esta revisi\u00f3n.
NonLinearVersioning.Error.AddVersionRequestDistinctItemSpinOff=La DERIVACI\u00d3N debe realizarse en distintos elementos.
NonLinearVersioning.Error.AddVersionRequestBadIntegrateOrSpinOff=Condiciones previas no v\u00e1lidas para la operaci\u00f3n de INTEGRACI\u00d3N/DERIVACI\u00d3N.
NonLinearVersioning.Error.AddVersionRequestEvolutionOnly=La operaci\u00f3n proporcionada $1. no est\u00e1 autorizada para este tipo de objeto.
NonLinearVersioning.Error.AddVersionRequestEvolutionOneMax=Solo se permite una EVOLUCI\u00d3N para este tipo de objeto.
NonLinearVersioning.Error.AddVersionRequestIntentIgnore=La intenci\u00f3n $1. no es compatible con este tipo de objeto y se ignorar\u00e1.
NonLinearVersioning.Error.AddVersionRequestMinorForbidden=La revisi\u00f3n secundaria no es v\u00e1lida para este tipo.
NonLinearVersioning.Error.AddVersionRequestNewAuthorizeOnlySpinOff=Con la NUEVA solicitud de adici\u00f3n de revisi\u00f3n, solo se autoriza la DERIVACI\u00d3N.
NonLinearVersioning.Error.AddVersionRequestOnMinorExclusive=La adici\u00f3n de revisi\u00f3n secundaria es exclusiva, no se autoriza ninguna otra intenci\u00f3n sem\u00e1ntica de revisi\u00f3n.
NonLinearVersioning.Error.AddVersionRequestMIBNew=La NUEVA operaci\u00f3n no es compatible con los datos de MIB.
NonLinearVersioning.Error.RequestWithMutuallyExclusiveIntents=La solicitud define la intenci\u00f3n sem\u00e1ntica de revisi\u00f3n mutuamente excluyente:\n $1..
NonLinearVersioning.Error.AddVersionRequestSingleIntegrate=La INTEGRACI\u00d3N no puede ser la intenci\u00f3n sem\u00e1ntica de revisi\u00f3n principal.
NonLinearVersioning.Error.AddVersionRequestSingleSpinoff=La DERIVACI\u00d3N no puede ser la intenci\u00f3n sem\u00e1ntica de revisi\u00f3n principal.
NonLinearVersioning.Error.AddVersionInvalidNameProposal=La solicitud de adici\u00f3n de versi\u00f3n ha establecido la cadena propuesta <$1.> como nombre que contiene caracteres prohibidos.
NonLinearVersioning.Error.AddVersionInvalidCodeProposal=La solicitud de adici\u00f3n de versi\u00f3n ha establecido la cadena propuesta <$1.> como n\u00famero de versi\u00f3n que contiene caracteres prohibidos.
NonLinearVersioning.Error.AddVersionPreprocess=Error durante el procesamiento de adici\u00f3n de revisi\u00f3n.
NonLinearVersioning.Error.AddVersionPostProcessInsertOnFamily=Ya existe un objeto con esta revisi\u00f3n en esta familia.
NonLinearVersioning.Error.AddVersionPostprocessNoPreprocess=Llame primero al proceso previo.
NonLinearVersioning.Error.AddVersionPostprocessNoNewVersion=No se ha definido el ID de nueva revisi\u00f3n.
NonLinearVersioning.Error.AddVersionError=Se ha producido al menos un error al procesar las creaciones de revisi\u00f3n.
NonLinearVersioning.Error.NoRequiredAccess=Es posible que el objeto se haya eliminado o que ya no tenga el permiso de acceso necesario.
NonLinearVersioning.Error.IncompleteObjectCreationDefinition=La creaci\u00f3n de objetos requiere la definici\u00f3n de "$1.".
NonLinearVersioning.Error.OperationNotPossibleType=Esta operaci\u00f3n no est\u00e1 disponible para este tipo de objeto.
NonLinearVersioning.Error.OperationMultipleOrigin=Hay varios or\u00edgenes de revisi\u00f3n definidos para la misma familia de revisiones.
NonLinearVersioning.Error.OperationNotSameItem=No se permiten intenciones sem\u00e1nticas entre revisiones de elementos distintos.
NonLinearVersioning.Error.SeveralVersionsCandidate=Varias revisiones son candidatas para ser la \u00faltima de la rama.
NonLinearVersioning.Error.OperationCycle=No se permiten ciclos en el gr\u00e1fico de revisi\u00f3n de intenci\u00f3n sem\u00e1ntica.
NonLinearVersioning.Error.OperationMultipleCopy=Una revisi\u00f3n solo puede ser la copia de otra revisi\u00f3n.
NonLinearVersioning.Error.GraphNotLoaded=No se ha podido cargar el gr\u00e1fico.
NonLinearVersioning.Error.PushContext=Error al insertar el contexto.
NonLinearVersioning.Error.PopContext=Error al abrir el contexto.
NonLinearVersioning.Error.ConstructorPID=Se debe utilizar un ID f\u00edsico.
NonLinearVersioning.Error.JSONFormatUnexpected=La entrada JSON no tiene un formato v\u00e1lido.
NonLinearVersioning.Error.JSONMissingKey=Falta la clave JSON de entrada: $1..
NonLinearVersioning.Error.JSONNoRequestDefined=No se ha definido ninguna solicitud en JSON de entrada (clave: $1.).
NonLinearVersioning.Error.JSONInvalidValue=Valor de entrada no v\u00e1lido "$2." para la propiedad JSON "$1.".
NonLinearVersioning.Error.JSONMaxHigherOrEqualToMin=El tama\u00f1o m\u00e1ximo "$1." debe ser mayor o igual que el tama\u00f1o m\u00ednimo "$1.".
NonLinearVersioning.Error.JSONInvalidType=Tipo de valor de entrada no v\u00e1lido "$2." para la propiedad JSON "$1.".
NonLinearVersioning.Error.JSONOnlyOneKey=La entrada contiene m\u00e1s de un objeto JSON $1..
NonLinearVersioning.Error.JSONInvalidVersion=Versi\u00f3n de JSON no compatible: $1..
NonLinearVersioning.Error.JSONUnknownIntent=No se reconoce la intenci\u00f3n sem\u00e1ntica de revisi\u00f3n en JSON: $1..
NonLinearVersioning.Error.JSONUnknownBlock=Bloque de n.\u00ba de revisi\u00f3n desconocida (debe seleccionarse en grupo, principal, secuencia o secundaria)
NonLinearVersioning.Error.notValidVersionNumberRule=Generador de script de n.\u00ba de revisi\u00f3n no v\u00e1lido
NonLinearVersioning.Error.InvalidInputRevisionNumber=el n\u00famero de revisi\u00f3n de entrada $1. no es coherente con la regulaci\u00f3n del objeto (consulte la directiva $2.).
NonLinearVersioning.Error.UnknownPredicateName=El predicado $1. no est\u00e1 en la lista de los que est\u00e1n disponibles.
NonLinearVersioning.Error.UnknownGeneratorName=El generador de c\u00f3digo $1. no est\u00e1 en la lista de los que est\u00e1n disponibles.
NonLinearVersioning.Error.NotVersionNumberRules=El generador de n\u00famero de revisi\u00f3n no se ha definido para la intenci\u00f3n sem\u00e1ntica $1..
NonLinearVersioning.Error.OneSourceAtOnce=Solo se permite una copia de un origen cada vez.
NonLinearVersioning.Error.Query=Error al consultar la base de datos.
NonLinearVersioning.Error.SOVCarryOver=Error al actualizar la propiedad del vector secundario: $1..
NonLinearVersioning.Error.POVCarryOver=Error al actualizar la propiedad del vector principal: $1..
NonLinearVersioning.Error.QueryExchangeStatus=Error al consultar la base de datos para el estado de Exchange.
NonLinearVersioning.Error.TransactionReport=Error al acceder al estado del informe de la transacci\u00f3n.
NonLinearVersioning.Error.QueryRevision=Error al consultar la base de datos para las revisiones.
NonLinearVersioning.Error.QueryFamily=Error al consultar la base de datos para el ID de la familia.
NonLinearVersioning.Error.QuerySiteName=Error al consultar la base de datos para el nombre del sitio.
NonLinearVersioning.Error.QueryVersionAttrs=Error al consultar la base de datos para los atributos de la revisi\u00f3n.
NonLinearVersioning.Error.QuerySemantics=Error al consultar la base de datos para las aristas de intenci\u00f3n sem\u00e1ntica.
NonLinearVersioning.Error.QueryAccessSequence=No se puede acceder a la secuencia de revisi\u00f3n utilizada para la inicializaci\u00f3n.
NonLinearVersioning.Error.VersionAccessPreviousRevision=No se puede acceder a la revisi\u00f3n anterior.
NonLinearVersioning.Error.QueryAttributes=No se pueden leer los atributos del objeto.
NonLinearVersioning.Error.isConfiguredAsEvolution=No se puede comprobar si un objeto est\u00e1 configurado en Evoluci\u00f3n: $1..
NonLinearVersioning.Error.QueryExists=No se puede acceder al objeto. \u00bfExiste?
NonLinearVersioning.Error.NotAccessible=\u00bfObjeto no accesible ($1.)?
NonLinearVersioning.Error.QueryAttributeInformation=No se puede acceder a la informaci\u00f3n de atributo de $1..
NonLinearVersioning.Error.NoAccessToChangeInfo=No se puede acceder a la informaci\u00f3n de Acci\u00f3n de cambio para $1..
NonLinearVersioning.Error.GetInterface=No se puede acceder a $1. en el objeto.
NonLinearVersioning.Error.SetInterface=No se puede establecer $1. en el objeto.
NonLinearVersioning.Error.ResetInterface=No se puede restablecer $1. en el objeto.
NonLinearVersioning.Error.QueryIndexPolicy=No se puede obtener acceso a $1. $2.
NonLinearVersioning.Error.NonMIBPolicy=Error al crear los datos porque la directiva $1. no es una directiva de MIB.
NonLinearVersioning.Error.QueryExpression=No se puede acceder a la expresi\u00f3n en el objeto.
NonLinearVersioning.Error.InvokeClass=No se ha encontrado la clase al invocar.
NonLinearVersioning.Error.InvokeInstantiate=No se ha podido crear una instancia durante la invocaci\u00f3n.
NonLinearVersioning.Error.InvokeAccess=Acceso no v\u00e1lido al invocar.
NonLinearVersioning.Error.InvokeSecurity=Problema de seguridad al invocar.
NonLinearVersioning.Error.InvokeMethod=No existe ese m\u00e9todo al invocar.
NonLinearVersioning.Error.InvokeTarget=Error de destino al invocar.
NonLinearVersioning.Error.ReviseFromNotAuthorized=Error al crear la revisi\u00f3n desde algo que no est\u00e1 en la familia de revisiones actual.
NonLinearVersioning.Error.IsLastCheck=No se puede comprobar si el objeto es la \u00faltima revisi\u00f3n.
NonLinearVersioning.Error.ReviseIntoForbidden=La revisi\u00f3n de la versi\u00f3n que no es la \u00faltima no est\u00e1 autorizada para el objeto $1..
NonLinearVersioning.Error.ReviseFromNotLast=El objeto $1. ya se ha revisado.
NonLinearVersioning.Error.ReviseMajor=La creaci\u00f3n de una nueva revisi\u00f3n no est\u00e1 autorizada para este estado de madurez.
NonLinearVersioning.Error.ReviseMinor=La creaci\u00f3n de una nueva revisi\u00f3n secundaria no est\u00e1 autorizada para este estado de madurez.
NonLinearVersioning.Error.NoReviseAccess=No es posible revisar actualmente. Causa y soluci\u00f3n posibles: Puede que no disponga de la funci\u00f3n de acceso necesaria para revisar este objeto en el espacio de colaboraci\u00f3n objetivo. Compruebe la funci\u00f3n de acceso especificada en sus credenciales actuales o seleccione otras credenciales. Para obtener m\u00e1s informaci\u00f3n sobre las funciones de acceso necesarias para esta operaci\u00f3n, consulte la p\u00e1gina Acceso al contenido de la gu\u00eda del usuario de su aplicaci\u00f3n.
NonLinearVersioning.Error.NoReviseOnDistantData=No es posible revisar los datos que son propiedad de otro sitio (datos distantes).
NonLinearVersioning.Error.NoReviseAccessDueToMaturityState=Actualmente no es posible hacer la revisi\u00f3n, la \u00faltima revisi\u00f3n de este $1. est\u00e1 en el estado de madurez $2. y se espera que est\u00e9 al menos en el estado EMITIDO.
NonLinearVersioning.Error.LastERMinor=La \u00faltima operaci\u00f3n no es compatible en el objeto indexado Solo secundaria.
NonLinearVersioning.Error.MakeClone=Error al revisar o duplicar.
NonLinearVersioning.Error.MakeCloneParam=No se puede revisar o duplicar el objeto $1..
NonLinearVersioning.Error.MakeCloneRevisionFormat=El formato de revisi\u00f3n esperado es $1..
NonLinearVersioning.Error.MakeCloneMultipleDelimiters=Se espera un delimitador \u00fanico en el formato de revisi\u00f3n.
NonLinearVersioning.Error.MakeReadAccess=Ya no se puede acceder a este contenido. Es posible que el objeto se haya eliminado o que ya no disponga del permiso de acceso necesario.
NonLinearVersioning.Error.DontExist=Ya no se puede acceder a este contenido. Es posible que el objeto se haya eliminado.
NonLinearVersioning.Error.MakeCloneAccess=Causa y soluci\u00f3n posibles: Puede que no disponga de la responsabilidad necesaria para crear este objeto en el espacio de colaboraci\u00f3n objetivo. Compruebe la funci\u00f3n de acceso especificada en sus credenciales actuales o seleccione otras credenciales. Para obtener m\u00e1s informaci\u00f3n sobre las funciones de acceso necesarias para esta operaci\u00f3n, consulte la p\u00e1gina 'Acceso al contenido' de la gu\u00eda del usuario de la aplicaci\u00f3n.
NonLinearVersioning.Error.AccessRights=Algunos objetos no son accesibles para el usuario actual. Causa y soluci\u00f3n posibles: Puede que no disponga de la funci\u00f3n de acceso necesaria para crear este objeto en el espacio de colaboraci\u00f3n objetivo. Compruebe la funci\u00f3n de acceso especificada en sus credenciales actuales o seleccione otras credenciales. Para obtener m\u00e1s informaci\u00f3n sobre las funciones de acceso necesarias para esta operaci\u00f3n, consulte la p\u00e1gina 'Acceso al contenido' de la gu\u00eda del usuario de la aplicaci\u00f3n.
NonLinearVersioning.Error.InsufficientAccessRights=Esta acci\u00f3n requiere privilegios de Administrador para usuario <$1>.
NonLinearVersioning.Error.MakeDuplicateAccess=Algunos objetos no son accesibles para el usuario actual. Causa y soluci\u00f3n posibles: Puede que no disponga de la funci\u00f3n de acceso necesaria para crear este objeto en el espacio de colaboraci\u00f3n objetivo. Compruebe la funci\u00f3n de acceso especificada en sus credenciales actuales o seleccione otras credenciales. Para obtener m\u00e1s informaci\u00f3n sobre las funciones de acceso necesarias para esta operaci\u00f3n, consulte la p\u00e1gina 'Acceso al contenido' de la gu\u00eda del usuario de la aplicaci\u00f3n.
NonLinearVersioning.Error.MakeDeleteParam=No se puede eliminar el objeto $1..
NonLinearVersioning.Error.BatchReviseParam=Error al revisar debido a uno de estos objetos: $1..
NonLinearVersioning.Error.BatchDeleteParam=Error al eliminar debido a uno de estos objetos: $1..
NonLinearVersioning.Error.UpdateMaturity=Error al establecer la madurez en $1. para revisar/clonar el objeto.
NonLinearVersioning.Error.UpdateStamp=Error al establecer la marca de actualizaci\u00f3n en $1. para revisar/clonar el objeto.
NonLinearVersioning.Error.ResetConfiguration=No se ha podido restablecer la informaci\u00f3n de configuraci\u00f3n despu\u00e9s de la operaci\u00f3n de revisi\u00f3n/clonaci\u00f3n: $1..
NonLinearVersioning.Error.CleanConfiguration=No es posible realizar duplicados porque al menos una instancia se encuentra en Acci\u00f3n de cambio.
NonLinearVersioning.Error.BusinessLogicValidationFailed=Las comprobaciones de la l\u00f3gica de negocio han rechazado la operaci\u00f3n.
NonLinearVersioning.Error.DerivationNodeParametesr=Error al leer la propiedad de par\u00e1metros del nodo de derivaci\u00f3n en el producto.
NonLinearVersioning.Error.HandlerEmptyPolicy=Directiva no definida.
NonLinearVersioning.Error.HandlerUndefined=No se puede encontrar el controlador adecuado para los objetos: $1..
NonLinearVersioning.Error.MigrationDistant=La migraci\u00f3n del gr\u00e1fico de versi\u00f3n no est\u00e1 autorizada en este sitio: La primera revisi\u00f3n se considera distante.
NonLinearVersioning.Error.MigrationPresent=La migraci\u00f3n del gr\u00e1fico de versi\u00f3n no est\u00e1 autorizada en este sitio: la primera revisi\u00f3n no est\u00e1 presente y algunas revisiones se consideran distantes.
NonLinearVersioning.Error.PidFormat=Formato de ID f\u00edsico $1. no v\u00e1lido en la solicitud $2. (clave: $3.).
NonLinearVersioning.Error.VidFormat=El formato VID no es correcto.
NonLinearVersioning.Error.expectedObjectId=Se esperaba un ID de objeto que no es compatible con la gesti\u00f3n de iteraci\u00f3n: $1. en la solicitud $2. (clave: $3.).
NonLinearVersioning.Error.expectedBranchId=Se esperaba un objeto en el contexto de iteraci\u00f3n: $1. en la solicitud $2. (clave: $3.).
NonLinearVersioning.Error.expectedInvaliId=No hay ning\u00fan ID de formato v\u00e1lido en este contexto $1. en la solicitud $2. (clave: $3.).
NonLinearVersioning.Error.CorruptedMultipleCopies=Datos da\u00f1ados: una revisi\u00f3n no puede ser la copia de otras varias.
NonLinearVersioning.Error.CommitFailed=Error de la operaci\u00f3n de guardado.
NonLinearVersioning.Error.RevisionSequence.NotDefined=Secuencia de revisi\u00f3n no definida.
NonLinearVersioning.Error.RevisionSequence.InvalidSequenceDefinition=La secuencia de revisi\u00f3n <$1.> no es v\u00e1lida.
NonLinearVersioning.Error.RevisionSequence.LettersInRangeWithSameCase=El rango de caracteres definido en la secuencia de revisi\u00f3n debe utilizar el mismo n\u00famero de may\u00fasculas y min\u00fasculas.
NonLinearVersioning.Error.RevisionSequence.LettersInRangeAreNotOdered=El rango de caracteres definido en la secuencia de revisi\u00f3n debe estar ordenado correctamente.
NonLinearVersioning.Error.RevisionSequence.PaddingIsOneSinglCharacter=Definici\u00f3n de relleno no v\u00e1lida <$2.>, debe ser un car\u00e1cter \u00fanico (modificar propiedad $1.).
NonLinearVersioning.Error.RevisionSequence.InitContainsBlank=Definici\u00f3n de secuencia inic. no v\u00e1lida; no debe contener valores en blanco.
NonLinearVersioning.Error.RevisionSequence.onlyLetterInSequence=La secuencia de revisi\u00f3n contiene caracteres no v\u00e1lidos.
NonLinearVersioning.Error.RevisionSequence.AlreadyDefined=Ya existe una secuencia de revisi\u00f3n denominada "$1.".
NonLinearVersioning.Error.RevisionSequence.NotDeclared=La secuencia de revisi\u00f3n denominada "$1." no existe.
NonLinearVersioning.Error.RevisionSequence.EditForbidden=Se ha podido modificar la secuencia de revisi\u00f3n de DS denominada "$1.".
NonLinearVersioning.Error.RevisionSequence.NotCompatible=La definici\u00f3n de la secuencia de revisi\u00f3n de entrada no es compatible con la secuencia de revisi\u00f3n denominada "$1.", por lo que la actualizaci\u00f3n est\u00e1 prohibida.
NonLinearVersioning.Error.RevisionSequence.MaximumSequenceSize=La longitud m\u00e1xima de la secuencia de revisi\u00f3n ampliada "$1." es "$2.".
NonLinearVersioning.Error.RevisionSequence.LastSequenceReached=Se ha alcanzado la \u00faltima secuencia de revisi\u00f3n ampliada "$1.".
NonLinearVersioning.Error.RevisionSequence.ForbiddenSequence=La secuencia de revisi\u00f3n ampliada contiene el siguiente car\u00e1cter <$1.>, que est\u00e1 prohibido.
NonLinearVersioning.Error.RevisionSequenceStillAssociated=La secuencia de revisi\u00f3n extendida no se puede quitar ni actualizar. Causa y resoluci\u00f3n posibles: algunas secuencias de revisi\u00f3n extendida todav\u00eda est\u00e1n asociadas a un tipo de objeto o a tipos de objetos
NonLinearVersioning.Error.RevisionSequence.RevisionSequenceStillUsedAsAlternate=No es posible eliminar la secuencia de revisi\u00f3n ampliada. Causa y soluci\u00f3n posibles: Algunas secuencias de revisi\u00f3n ampliadas se siguen utilizando como secuencias alternativas en l\u00f3gicas de revisi\u00f3n ampliadas
NonLinearVersioning.Error.rerouteAfterCloning=Al menos una operaci\u00f3n de redireccionamiento despu\u00e9s de las operaciones de revisi\u00f3n o duplicaci\u00f3n ha fallado.
NonLinearVersioning.Error.NoAccessToRelationship=Error al consultar la base de datos de relaciones durante las operaciones de redireccionamiento posteriores a las operaciones de revisi\u00f3n/duplicaci\u00f3n.
NonLinearVersioning.Error.NoAccessToPath=Error al consultar la base de datos de ruta durante las operaciones de redireccionamiento posteriores a las operaciones de revisi\u00f3n/duplicaci\u00f3n.
NonLinearVersioning.Error.UpdatePathFailed=Error al actualizar las rutas durante la operaci\u00f3n de fusi\u00f3n/clonaci\u00f3n.
NonLinearVersioning.Error.AddVersionError=Error al invocar la l\u00f3gica de negocio de inicializaci\u00f3n. 
NonLinearVersioning.Error.Completion=Error al invocar la l\u00f3gica de negocio de finalizaci\u00f3n de Revisar, Duplicar o Eliminar debido a $1.. 
NonLinearVersioning.Error.Dedicated=Error al ejecutar una operaci\u00f3n de aplicaci\u00f3n (informaci\u00f3n detallada: $1.).
NonLinearVersioning.Error.DocumentType=Error al comprobar el tipo de documento.
NonLinearVersioning.Error.CESTAMPCheck=Otro usuario ha modificado el objeto desde la \u00faltima vez que lo abri\u00f3.
NonLinearVersioning.Error.ResetDerivedFrom=No se puede separar la nueva revisi\u00f3n de la familia anterior durante la operaci\u00f3n de duplicaci\u00f3n.
NonLinearVersioning.Error.ReadDerivedFrom=No se puede leer el valor "Derivado de".
NonLinearVersioning.Error.TwoEvolutionOnSameAncestor=La creaci\u00f3n de una nueva revisi\u00f3n no est\u00e1 autorizada porque al menos 2 revisiones pertenecen a la misma rama: $1..
NonLinearVersioning.Error.AccessVersionNumberGenerator=No se puede acceder a la configuraci\u00f3n relativa al modo de generador de revisiones: $1..
NonLinearVersioning.Error.BomSynchronizeForbidEditIntent=La edici\u00f3n del gr\u00e1fico de versi\u00f3n est\u00e1 prohibida en los objetos involucrados en la sincronizaci\u00f3n de EBOM.
NonLinearVersioning.Error.ReadAttribute=No se puede leer el atributo $1..
NonLinearVersioning.Error.ReadTitle=No se puede leer el t\u00edtulo.
NonLinearVersioning.Error.UnavailableProductIntent=Intenci\u00f3n no disponible para este producto.
NonLinearVersioning.Error.OnlyOneProductIntent=El producto solo es compatible con una \u00fanica intenci\u00f3n.
NonLinearVersioning.Error.DerivativeAfterFix=La derivaci\u00f3n despu\u00e9s de una correcci\u00f3n no es posible para productos o planes de fabricaci\u00f3n.
NonLinearVersioning.Error.EvolutionFromNotLast=La evoluci\u00f3n solo es compatible con la \u00faltima revisi\u00f3n del producto.
NonLinearVersioning.Error.UnableReadData=No se pueden leer datos de la base de datos.
NonLinearVersioning.Error.UnableWriteData=No se pueden escribir datos en la base de datos.
NonLinearVersioning.Error.UnableToSetInformation=No se puede actualizar la informaci\u00f3n en la base de datos\n(Informaci\u00f3n adicional: $1.).
NonLinearVersioning.Error.UnableSetData=No se pueden configurar datos en la base de datos.
NonLinearVersioning.Error.TNR=No se puede crear un nuevo objeto $1. porque ya existe otro objeto con el mismo identificador.
NonLinearVersioning.Error.RequestSameTNR=Solicitando varias revisiones con el mismo identificador $1..
NonLinearVersioning.Error.NoVirtualItem=Elemento f\u00edsico esperado.
NonLinearVersioning.Error.UnexpectedMigration=Creaci\u00f3n inesperada de un elemento f\u00edsico.
NonLinearVersioning.Error.AddVersionRequestNotAuthorizedIntent=La solicitud de adici\u00f3n de revisi\u00f3n utiliza un operador no autorizado: $1..
NonLinearVersioning.Error.AddVersionRequestOnlyOneIntentAuthorized=Para este tipo de objeto, solo se admite un operador de adici\u00f3n de revisi\u00f3n por solicitud.
NonLinearVersioning.Error.FirstOnlyOnceForConfiguredTime=Ya se ha creado al menos una revisi\u00f3n configurada en $1. $2..
NonLinearVersioning.Error.ConfiguredRevisionNotAuthorized=La creaci\u00f3n de revisi\u00f3n configurada a\u00fan no est\u00e1 disponible en $1. $2..
NonLinearVersioning.Error.MissingJsonHttpInput=La solicitud HTTP no proporciona una entrada JSON.
NonLinearVersioning.Error.MissingObjectHttpInput=La solicitud HTTP no proporciona el objeto de entrada.
NonLinearVersioning.Error.InvalidHttpContext=No se puede abrir la sesi\u00f3n.
NonLinearVersioning.Error.InvalidOutputFormat=Se espera que devuelva un mensaje de salida $1. que no se espera en el lado del cliente.
NonLinearVersioning.Error.ForbiddenAttributeUpdate=El atributo b\u00e1sico $1. (con un valor de $2.) no puede formar parte de una cl\u00e1usula de actualizaci\u00f3n.
NonLinearVersioning.Error.NoAccessToJpo=No hay acceso al programa <$1.>
NonLinearVersioning.Error.InvalidDatabaseAccess=No hay acceso a la informaci\u00f3n de la base de datos <$1.>
NonLinearVersioning.Error.GlobalAuthoringOptionOnly=La opci\u00f3n de creaci\u00f3n global $1. est\u00e1 establecida como opci\u00f3n en el nivel de solicitud.
NonLinearVersioning.Error.InvalidIntent=La operaci\u00f3n $1. no est\u00e1 autorizada en este tipo de objetos.
NonLinearVersioning.Error.NotAuthorizedAddVersion=La creaci\u00f3n de revisi\u00f3n de tipo $1. necesita licencias espec\u00edficas para $2. autorizado.
NonLinearVersioning.Error.UnableToCreateModuleBranch=No se puede crear el m\u00f3dulo $1, rama $2
NonLinearVersioning.Error.AuthoringOptionOnRevise=La opci\u00f3n de creaci\u00f3n $1. solo es v\u00e1lida para la nueva revisi\u00f3n (ni para Duplicar ni para Nueva rama).
NonLinearVersioning.Error.MQLCommandException=Excepci\u00f3n al ejecutar el lenguaje de consulta
NonLinearVersioning.Error.MQLCommandFailed=Error  al ejecutar el lenguaje de consulta (detalle: $1.).
NonLinearVersioning.Error.TypeNameRevisionConflict=El tipo de unicidad, el nombre y la revisi\u00f3n entran en conflicto con $1. $2. $3.
NonLinearVersioning.Error.UnknownEditIntentOperation=Solo AGREGAR & ELIMINAR son operaciones v\u00e1lidas para la edici\u00f3n de gr\u00e1fico de versi\u00f3n sem\u00e1ntica
NonLinearVersioning.Error.MIBAddModule=No se puede crear el m\u00f3dulo. (Informaci\u00f3n adicional: $1.)
NonLinearVersioning.Error.MIBOnly=Servicio disponible solo para MIB.
NonLinearVersioning.Error.ObjectDontExist=El objeto no existe. (Informaci\u00f3n adicional: $1.)
NonLinearVersioning.Error.Kernel.Undefined=Error al ejecutar un comando del n\u00facleo. (Informaci\u00f3n adicional: $1.)
NonLinearVersioning.Error.PolicyDontExist=La directiva $1. utilizada para crear datos no existe.
NonLinearVersioning.Error.TypeDontExist=El tipo $1. utilizado para crear datos no existe.
NonLinearVersioning.Error.NoReflexiveSemanticEdge=Las versiones antiguas y posteriores de la edici\u00f3n de gr\u00e1fico de versi\u00f3n sem\u00e1ntica deben ser diferentes.
NonLinearVersioning.Error.NoReflexiveComposition=Las versiones padre e hija en la estructura de composici\u00f3n sem\u00e1ntica deben ser diferentes.
NonLinearVersioning.Error.NotComposedInFather=La versi\u00f3n $1. no se ha compuesto en $2.
NonLinearVersioning.Error.CompositionRemovalFailed=No se puede eliminar $1. como elemento compuesto desde $2. (probablemente no se encuentra entre los elementos compuestos o no tiene acceso a \u00e9l).
NonLinearVersioning.Error.CompositionAdditionFailed=No se puede insertar $1. como nuevo elemento compuesto en $2.
NonLinearVersioning.Error.FormatOptionIgnored=La opci\u00f3n de formato se ignora porque se encuentra en la definici\u00f3n de la solicitud
NonLinearVersioning.Error.RestoreSameResultingIteration=La iteraci\u00f3n seleccionada desde la que se desea hacer la restauraci\u00f3n es la misma que la actual.
NonLinearVersioning.Error.RestoreIterationOutOfRange=La iteraci\u00f3n seleccionada para hacer la restauraci\u00f3n est\u00e1 fuera del rango de iteraciones disponibles.
NonLinearVersioning.Error.RevisionSequenceNotFound=No se ha encontrado la secuencia de revisi\u00f3n $1..
NonLinearVersioning.Error.RevisionLogicNotFound=No se ha encontrado la l\u00f3gica de revisi\u00f3n "$1.".
NonLinearVersioning.Error.RevisionLogic.NotDeclared=La l\u00f3gica de revisi\u00f3n denominada '$1.' no existe.
NonLinearVersioning.Error.RevisionLogic.NotDefined=L\u00f3gica de revisi\u00f3n no definida.
NonLinearVersioning.Error.RevisionLogic.InvalidJSON=Error al crear una l\u00f3gica de revisi\u00f3n desde un JSON: atributo perdido "$1.".
NonLinearVersioning.Error.UpdateRevisionSequence=No se puede establecer o restablecer la secuencia de revisi\u00f3n ampliada en $1. $2..
NonLinearVersioning.Error.UpdateRevisionLogic=No se puede establecer o restablecer la l\u00f3gica de revisi\u00f3n extendida en $1. $2..
NonLinearVersioning.Error.PromoteNotAuthorized=La promoci\u00f3n a $1. no est\u00e1 autorizada por el modo de n\u00famero de revisi\u00f3n $2. en el objeto $3..
NonLinearVersioning.Error.AddVersionNewBranchOneMax=Solo se acepta una operaci\u00f3n de nueva rama, elimine la operaci\u00f3n no \u00fatil $1..
NonLinearVersioning.Error.AddVersionNewRevisionOneMax=Solo se acepta una operaci\u00f3n de nueva revisi\u00f3n, elimine la operaci\u00f3n no \u00fatil $1..
NonLinearVersioning.Error.AddVersionDuplicateOneMax=Solo se acepta una operaci\u00f3n de duplicaci\u00f3n, elimine la operaci\u00f3n no \u00fatil $1..
NonLinearVersioning.Error.AddVersionNewMinorRevisionOneMax=Solo se acepta una operaci\u00f3n de nueva revisi\u00f3n secundaria, elimine la operaci\u00f3n no \u00fatil $1..
NonLinearVersioning.Error.AddVersionFirstRevisionOneMax=Solo se acepta una operaci\u00f3n de nueva primera revisi\u00f3n configurada, elimine la operaci\u00f3n no \u00fatil $1..
NonLinearVersioning.Error.AddVersionNewRevisionAndNewBranchCompatibility=La operaci\u00f3n de nueva revisi\u00f3n no es compatible con la nueva rama, elimine las operaciones no compatibles.
NonLinearVersioning.Error.AddVersionNewRevisionAndDuplicateCompatibility=La operaci\u00f3n de nueva revisi\u00f3n no es compatible con la duplicaci\u00f3n, elimine las operaciones no compatibles.
NonLinearVersioning.Error.AddVersionNewRevisionAndNewMinorRevisionOneMax=La operaci\u00f3n de nueva revisi\u00f3n no es compatible con la nueva revisi\u00f3n secundaria, elimine las operaciones no compatibles.
NonLinearVersioning.Error.AddVersionNewRevisionAndFirstOneMax=La operaci\u00f3n de nueva revisi\u00f3n no es compatible con la creaci\u00f3n de la primera revisi\u00f3n configurada. Elimine las operaciones incompatibles.
NonLinearVersioning.Error.AddVersionNewBranchAndDuplicateCompatibility=La operaci\u00f3n de nueva rama no es compatible con la duplicaci\u00f3n, elimine las operaciones no compatibles.
NonLinearVersioning.Error.AddVersionNewBranchAndNewMinorRevisionOneMax=La operaci\u00f3n de nueva rama no es compatible con la nueva revisi\u00f3n secundaria, elimine las operaciones no compatibles.
NonLinearVersioning.Error.AddVersionNewRevisionAndFirstOneMax=La operaci\u00f3n de nueva rama no es compatible con la creaci\u00f3n de la primera revisi\u00f3n configurada. Elimine las operaciones incompatibles.
NonLinearVersioning.Error.AddVersionDuplicateAndNewMinorRevisionOneMax=La operaci\u00f3n de duplicaci\u00f3n no es compatible con la nueva revisi\u00f3n secundaria, elimine las operaciones incompatibles.
NonLinearVersioning.Error.AddVersionDuplicateAndFirstOneMax=La operaci\u00f3n de duplicaci\u00f3n no es compatible con la creaci\u00f3n de la primera revisi\u00f3n configurada, elimine las operaciones incompatibles.
NonLinearVersioning.Error.AddVersionSecondaryAndFirstOneMax=La operaci\u00f3n de nueva revisi\u00f3n secundaria no es compatible con la creaci\u00f3n de la primera revisi\u00f3n configurada. Elimine las operaciones incompatibles.
NonLinearVersioning.Error.AddVersionNewReviseFromPolicyMissmatch=Los objetos de referencia y de origen no tienen la misma directiva.
NonLinearVersioning.nls.ConfiguredRevision.type=Revisi\u00f3n configurada
NonLinearVersioning.nls.ConfiguredRevision.license=Configuraci\u00f3n
NonLinearVersioning.Error.AssociatedRevisionSequence=En un $1., asociar la secuencia de Revisi\u00f3n $2. requiere privilegios de Administrador para el usuario conectado <$3.>.
NonLinearVersioning.Error.ResetAssociatedRevisionSequence=En un $1., disociar una secuencia de Revisi\u00f3n requiere privilegios de Administrador para el usuario conectado <$3.>.
NonLinearVersioning.Error.EditRevisionSequence=Editar la secuencia de revisi\u00f3n $1. requiere que el usuario conectado $2. tenga privilegios de administrador.
NonLinearVersioning.Error.AssociatedRevisionLogic=En un $1., asociar la l\u00f3gica de Revisi\u00f3n $2. requiere privilegios de Administrador para el usuario conectado <$3.>.
NonLinearVersioning.Error.ResetAssociatedRevisionLogic=En un $1., disociar una l\u00f3gica de Revisi\u00f3n requiere privilegios de Administrador para el usuario conectado <$3.>.
NonLinearVersioning.Error.EditRevisionLogic=Editar la l\u00f3gica de revisi\u00f3n $1. requiere que el usuario conectado $2. tenga privilegios de administrador.
NonLinearVersioning.Error.RevisionLogicStillAssociated=No se puede eliminar la l\u00f3gica de revisi\u00f3n ampliada. Causa y soluci\u00f3n posibles: Algunas l\u00f3gicas de revisi\u00f3n ampliadas siguen asociadas a tipos de objetos
NonLinearVersioning.Error.VGStackActivationFailed=No se puede activar la pila de gr\u00e1fico de versi\u00f3n.
NonLinearVersioning.Error.VGStackDeactivationFailed=No se puede desactivar la pila de gr\u00e1fico de versi\u00f3n.
NonLinearVersioning.Error.UnableToCopyFiles=No se pueden copiar los archivos en el nuevo documento.
NonLinearVersioning.Error.UnableToFigureVault=No se puede determinar el almac\u00e9n de destino.
NonLinearVersioning.Error.DuplicateForbiddenSystemModel=La duplicaci\u00f3n no es posible en este modelo de sistema.
NonLinearVersioning.Error.UncompliantCode=La entrada de la cadena de revisi\u00f3n no coincide con la configuraci\u00f3n del sistema.
NonLinearVersioning.Error.TooLargeResultingOrder=La cadena de revisi\u00f3n de entrada da como resultado un orden demasiado largo.
NonLinearVersioning.Error.BomControlled=No se puede realizar el control de versiones de esta entidad $1 $2 en la sesi\u00f3n de cliente VPM. Cree la nueva versi\u00f3n de esta entidad con la misma sesi\u00f3n de cliente que se utiliz\u00f3 para su creaci\u00f3n.
NonLinearVersioning.Error.DuplicateForbiddenOnConfidentialData=No se permite duplicar datos confidenciales.
NonLinearVersioning.Error.BranchForbiddenOnConfidentialData=No se permite ramificar datos confidenciales.
NonLinearVersioning.Error.AttributeMaximumLength=El atributo V_Name excede la longitud m\u00e1xima de 100.

#Merge errors
NonLinearVersioning.Error.MergeWorkUnderChange=No se permite la fusi\u00f3n mientras se trabaja con control de cambios.
NonLinearVersioning.Error.MergeConfiguredObject=No se puede combinar porque algunos objetos est\u00e1n configurados.
NonLinearVersioning.Error.MergeTypeNotAllowed=No se permite la fusi\u00f3n para objetos $1.
NonLinearVersioning.Error.MergePathNotAllowed=No se permite fusionar objetos con rutas de $1.
NonLinearVersioning.Error.MergeSRNotAllowed=No se permite fusionar objetos que tengan rutas de relaci\u00f3n sem\u00e1ntica con la funci\u00f3n $1.
NonLinearVersioning.Error.MergeItfNotAllowed=No se permite combinar objetos con interfaces de $1.
NonLinearVersioning.Error.MergeUsageIntegrity=$1 y $2 deben tener el mismo uso.
NonLinearVersioning.Error.MergeVPLMControlledIntegrity=$1 debe estar controlado por vplm.
NonLinearVersioning.Error.MergeIsTerminalIntegrity=Los objetos de terminal no pueden tener objetos secundarios.
NonLinearVersioning.Error.MergeUsagePartIntegrity=No se puede eliminar 3DShape cuando se usa como 3DPart.
NonLinearVersioning.Error.MergeUpdatestampIntegrity=No se permite la fusi\u00f3n para datos antiguos.
NonLinearVersioning.Error.MergeMinorOrderIntegrity=No se permite fusionar objetos regidos por una pol\u00edtica de doble \u00edndice que tengan m\u00e1s de una revisi\u00f3n menor.
NonLinearVersioning.Error.MergeDisciplineIntegrity=No se permite la fusi\u00f3n para objetos $1.
NonLinearVersioning.Error.MergeSetOnlyOnceIntegrity=El atributo $1 no se puede sobrescribir porque ya se ha establecido con un valor diferente.
NonLinearVersioning.Error.MergeDelegateRelTo=La relaci\u00f3n delegada no puede redirigirse a un objeto diferente.
NonLinearVersioning.Error.MergeDelegateRelModelerExc=Se produjo un error durante la fusi\u00f3n de relaciones de $1: $2.
NonLinearVersioning.Error.MergeInputConsistency=Operaci\u00f3n de fusi\u00f3n incoherente entre $1 y $2.
NonLinearVersioning.Error.MergePostCheckKo=Estado de datos incoherente despu\u00e9s de la operaci\u00f3n de fusi\u00f3n.

#xRevision
NonLinearVersioning.Error.AddVersionRequestNotAuthorizedOperationOnEffectivityBased=Operaci\u00f3n no compatible sobre datos 'basados en la efectividad'.

#GraphSubset
NonLinearVersioning.Error.InvalidGraphSubsetMode=La entrada GraphSubset es nula.

# Error message coming from IRs
# IR-1194448-3DEXPERIENCER2023x
NonLinearVersioning.Error.StudyNotAllowedOnConfiguredNode=No se permite la duplicaci\u00f3n como rama en el nodo configurado.
# IR-1299841-3DEXPERIENCER2025x
NonLinearVersioning.Error.FilterMustBeSetForPStudyOnConfiguredNode=En un nodo configurado, se debe aplicar un filtro en la estructura para permitir una rama avanzada. Aplique un filtro de configuraci\u00f3n en la estructura antes de crear una rama usando "Nueva rama avanzada".
NonLinearVersioning.Error.FilterMustBeSingleEvolution=La rama avanzada en un nodo configurado solo est\u00e1 permitida si el filtro tiene un \u00fanico criterio de evoluci\u00f3n. Utilice "Nueva rama avanzada" para aplicar un filtro de configuraci\u00f3n definido con una sola versi\u00f3n del modelo.
