# Copyright 2019-2025 Dassault Systemes. All rights reserved.
#
#   Subject: Propose NLS support for Version Graph error messages.
NonLinearVersioning.Notice.SemanticEdgeNotFound=A rela\u00e7\u00e3o sem\u00e2ntica para excluir n\u00e3o foi encontrada, portanto, nenhuma opera\u00e7\u00e3o foi executada.
NonLinearVersioning.Error.NLVStatus=N\u00e3o \u00e9 poss\u00edvel obter o modo de gr\u00e1fico de revis\u00e3o (linear ou n\u00e3o).
NonLinearVersioning.Error.SystemCompletion=N\u00e3o foi poss\u00edvel obter o objeto associado para a opera\u00e7\u00e3o atual.
NonLinearVersioning.Error.SemanticEdgeNotDeleted=N\u00e3o \u00e9 poss\u00edvel excluir a rela\u00e7\u00e3o sem\u00e2ntica.
NonLinearVersioning.Error.SemanticNONE=O operador NONE \u00e9 inv\u00e1lido nesta solicita\u00e7\u00e3o.
NonLinearVersioning.Error.ItemNotDeleted=N\u00e3o foi poss\u00edvel excluir o Item.
NonLinearVersioning.Error.ItemNotLoaded=N\u00e3o foi poss\u00edvel carregar o item.
NonLinearVersioning.Error.ItemNotSet=Nenhum item definido!
NonLinearVersioning.Error.ItemFromVersion=N\u00e3o foi poss\u00edvel obter o item da revis\u00e3o.
NonLinearVersioning.Error.ItemFromVersionModel=N\u00e3o \u00e9 poss\u00edvel prosseguir, pois este produto \u00e9 de propriedade de outro usu\u00e1rio.
NonLinearVersioning.Error.ItemAlreadyExist=Um item j\u00e1 est\u00e1 definido para esta revis\u00e3o.
NonLinearVersioning.Error.ItemCreation=N\u00e3o foi poss\u00edvel criar o item.
NonLinearVersioning.Error.VersionNotSet=Nenhuma revis\u00e3o definida!
NonLinearVersioning.Error.VersionNull=O ID f\u00edsico da revis\u00e3o de entrada \u00e9 nulo ou vazio!
NonLinearVersioning.Error.TypeNull=A entrada do tipo de neg\u00f3cio n\u00e3o est\u00e1 definida (nula ou vazia)!
NonLinearVersioning.Error.VersionCopyFrom=N\u00e3o foi poss\u00edvel obter c\u00f3pia de.
NonLinearVersioning.Error.VersionDelete=N\u00e3o \u00e9 poss\u00edvel excluir a revis\u00e3o.
NonLinearVersioning.Error.computeVersionNumber=N\u00e3o foi poss\u00edvel computar o n\u00famero da revis\u00e3o (Informa\u00e7\u00f5es adicionais: $1.).
NonLinearVersioning.Error.VersionDeletePropagate=N\u00e3o \u00e9 poss\u00edvel propagar a exclus\u00e3o da revis\u00e3o.
NonLinearVersioning.Error.VersionDeleteSpinOff=N\u00e3o \u00e9 poss\u00edvel redirecionar o SPIN-OFF ap\u00f3s a exclus\u00e3o da revis\u00e3o.
NonLinearVersioning.Error.VersionDeleteLeaf=Somente a revis\u00e3o da folha pode ser exclu\u00edda.
NonLinearVersioning.Error.VersionCheckMajor=N\u00e3o \u00e9 poss\u00edvel verificar o acesso \u00e0 revis\u00e3o principal.
NonLinearVersioning.Error.VersionToItem=N\u00e3o foi poss\u00edvel conectar a revis\u00e3o ao item.
NonLinearVersioning.Error.VersionNoItem=A revis\u00e3o n\u00e3o est\u00e1 associada a um item e, portanto, n\u00e3o \u00e9 compat\u00edvel com o modo de gr\u00e1fico de vers\u00e3o.
NonLinearVersioning.Error.VersionAddSemantic=N\u00e3o \u00e9 poss\u00edvel adicionar ou atualizar o link sem\u00e2ntico.
NonLinearVersioning.Error.VersionReviseMajor=A cria\u00e7\u00e3o de uma nova revis\u00e3o n\u00e3o \u00e9 autorizada!
NonLinearVersioning.Error.VersionDuplicate=A cria\u00e7\u00e3o de um novo objeto a partir de um j\u00e1 existente n\u00e3o \u00e9 autorizada!
NonLinearVersioning.Error.VersionFamily=Falha ao pesquisar a revis\u00e3o da fam\u00edlia.
NonLinearVersioning.Error.VersionFamilyNull=O ID da fam\u00edlia de revis\u00f5es n\u00e3o pode ser nulo.
NonLinearVersioning.Error.VersionFamilyNotSet=O ID da fam\u00edlia de revis\u00f5es de entrada n\u00e3o est\u00e1 definido!
NonLinearVersioning.Error.VersionsNotLoaded=N\u00e3o foi poss\u00edvel acessar as fam\u00edlias de revis\u00f5es.
NonLinearVersioning.Error.AddVersionsNull=O mapa de solicita\u00e7\u00f5es de adi\u00e7\u00e3o de revis\u00e3o n\u00e3o pode ser nulo!
NonLinearVersioning.Error.GraphVersionsNull=O mapa de solicita\u00e7\u00f5es de revis\u00e3o do gr\u00e1fico sem\u00e2ntico n\u00e3o pode ser nulo!
NonLinearVersioning.Error.AddVersionRequestNull=A solicita\u00e7\u00e3o n\u00e3o pode ser nula!
NonLinearVersioning.Error.getLastVersionsFromJson=A solicita\u00e7\u00e3o da \u00faltima vers\u00e3o n\u00e3o pode ser nula!
NonLinearVersioning.Error.AddVersionRequestSpinOff=O SPIN-OFF n\u00e3o pode estar sozinho na solicita\u00e7\u00e3o de adi\u00e7\u00e3o de revis\u00e3o.
NonLinearVersioning.Error.AddVersionRequestSpinOffNew=O SPIN-OFF n\u00e3o pode ser combinado com o NOVO no modo de revis\u00e3o linear.
NonLinearVersioning.Error.AddVersionRequestFore=A opera\u00e7\u00e3o ANTERIOR tenta criar um ciclo no gr\u00e1fico da vers\u00e3o Sem\u00e2ntica para $1.!\u201d ) ; }
NonLinearVersioning.Error.AddVersionRequestForeSameSource=N\u00e3o h\u00e1 suporte para a opera\u00e7\u00e3o ANTERIOR se o ancestral e a origem forem os mesmos.
NonLinearVersioning.Error.AddVersionRequestSpinOffDup=O SPIN-OFF n\u00e3o pode ser combinado com a C\u00d3PIA no modo de revis\u00e3o linear.
NonLinearVersioning.Error.AddVersionRequestSameItemSemantic=Todas as inten\u00e7\u00f5es sem\u00e2nticas devem ser do mesmo item.
NonLinearVersioning.Error.AddVersionRequestSemanticOneMax=Somente uma inten\u00e7\u00e3o sem\u00e2ntica dessa revis\u00e3o \u00e9 permitida!
NonLinearVersioning.Error.AddVersionRequestDistinctItemSpinOff=O SPIN-OFF deve ser realizado em itens distintos!
NonLinearVersioning.Error.AddVersionRequestBadIntegrateOrSpinOff=Condi\u00e7\u00f5es pr\u00e9vias inv\u00e1lidas para a opera\u00e7\u00e3o INTEGRAR/SPINOFF.
NonLinearVersioning.Error.AddVersionRequestEvolutionOnly=Opera\u00e7\u00e3o fornecida $1. n\u00e3o autorizada para esse tipo de objeto.
NonLinearVersioning.Error.AddVersionRequestEvolutionOneMax=Somente uma EVOLU\u00c7\u00c3O \u00e9 permitida para esse tipo de objeto.
NonLinearVersioning.Error.AddVersionRequestIntentIgnore=A inten\u00e7\u00e3o $1. n\u00e3o \u00e9 suportada por esse tipo de objeto e ser\u00e1 ignorada.
NonLinearVersioning.Error.AddVersionRequestMinorForbidden=A revis\u00e3o secund\u00e1ria n\u00e3o \u00e9 v\u00e1lida para esse tipo.
NonLinearVersioning.Error.AddVersionRequestNewAuthorizeOnlySpinOff=Com a NOVA solicita\u00e7\u00e3o de adi\u00e7\u00e3o de revis\u00e3o, somente o SPIN-OFF \u00e9 autorizado!
NonLinearVersioning.Error.AddVersionRequestOnMinorExclusive=A adi\u00e7\u00e3o da revis\u00e3o secund\u00e1ria \u00e9 exclusiva e nenhuma outra inten\u00e7\u00e3o de revis\u00e3o sem\u00e2ntica \u00e9 autorizada!
NonLinearVersioning.Error.AddVersionRequestMIBNew=A opera\u00e7\u00e3o NOVA n\u00e3o \u00e9 compat\u00edvel com os dados MIB.
NonLinearVersioning.Error.RequestWithMutuallyExclusiveIntents=A solicita\u00e7\u00e3o define a inten\u00e7\u00e3o sem\u00e2ntica da revis\u00e3o mutuamente exclusiva:\n $1.
NonLinearVersioning.Error.AddVersionRequestSingleIntegrate=O INTEGRAR n\u00e3o pode ser a inten\u00e7\u00e3o sem\u00e2ntica da revis\u00e3o prim\u00e1ria!
NonLinearVersioning.Error.AddVersionRequestSingleSpinoff=O SPIN-OFF n\u00e3o pode ser a inten\u00e7\u00e3o sem\u00e2ntica de revis\u00e3o prim\u00e1ria!
NonLinearVersioning.Error.AddVersionInvalidNameProposal=Adicionar solicita\u00e7\u00e3o de vers\u00e3o para definir a string <$1.> como nome que cont\u00e9m caracteres proibidos!
NonLinearVersioning.Error.AddVersionInvalidCodeProposal=Adicionar conjunto de solicita\u00e7\u00f5es de vers\u00e3o proposto com a string <$1.> como n\u00famero de revis\u00e3o que cont\u00e9m caracteres proibidos!
NonLinearVersioning.Error.AddVersionPreprocess=Erro durante o processamento da adi\u00e7\u00e3o de revis\u00e3o!
NonLinearVersioning.Error.AddVersionPostProcessInsertOnFamily=Um objeto com essa revis\u00e3o j\u00e1 existe nessa fam\u00edlia.
NonLinearVersioning.Error.AddVersionPostprocessNoPreprocess=Chame o pr\u00e9-processo primeiro!
NonLinearVersioning.Error.AddVersionPostprocessNoNewVersion=O ID da nova revis\u00e3o n\u00e3o est\u00e1 definido!
NonLinearVersioning.Error.AddVersionError=Pelo menos um erro ao processar as cria\u00e7\u00f5es de revis\u00e3o.
NonLinearVersioning.Error.NoRequiredAccess=N\u00e3o \u00e9 poss\u00edvel acessar o objeto selecionado. Isso pode ser causado pela condi\u00e7\u00e3o de direito de acesso de seguran\u00e7a ou por uma exclus\u00e3o. Atualize o conte\u00fado do aplicativo
NonLinearVersioning.Error.IncompleteObjectCreationDefinition=A cria\u00e7\u00e3o do objeto exigiu a defini\u00e7\u00e3o de "$1.".
NonLinearVersioning.Error.OperationNotPossibleType=Essa opera\u00e7\u00e3o n\u00e3o est\u00e1 dispon\u00edvel para esse tipo de objeto.
NonLinearVersioning.Error.OperationMultipleOrigin=Origem de v\u00e1rias revis\u00f5es definida para a mesma fam\u00edlia de revis\u00f5es.
NonLinearVersioning.Error.OperationNotSameItem=N\u00e3o s\u00e3o permitidas inten\u00e7\u00f5es sem\u00e2nticas entre revis\u00f5es de itens distintos.
NonLinearVersioning.Error.SeveralVersionsCandidate=V\u00e1rias revis\u00f5es s\u00e3o candidatas a serem as \u00faltimas da ramifica\u00e7\u00e3o.
NonLinearVersioning.Error.OperationCycle=N\u00e3o s\u00e3o permitidos ciclos no gr\u00e1fico de revis\u00e3o da inten\u00e7\u00e3o sem\u00e2ntica!
NonLinearVersioning.Error.OperationMultipleCopy=Uma revis\u00e3o pode ser a c\u00f3pia de apenas uma outra revis\u00e3o.
NonLinearVersioning.Error.GraphNotLoaded=N\u00e3o foi poss\u00edvel carregar o gr\u00e1fico.
NonLinearVersioning.Error.PushContext=Erro ao enviar o contexto.
NonLinearVersioning.Error.PopContext=Erro ao abrir o contexto.
NonLinearVersioning.Error.ConstructorPID=Um ID f\u00edsico deve ser usado.
NonLinearVersioning.Error.JSONFormatUnexpected=A entrada JSON n\u00e3o tem um formato v\u00e1lido!
NonLinearVersioning.Error.JSONMissingKey=Chave de entrada JSON ausente: $1.
NonLinearVersioning.Error.JSONNoRequestDefined=Nenhuma solicita\u00e7\u00e3o definida no JSON de entrada (chave: $1.).
NonLinearVersioning.Error.JSONInvalidValue=Valor de entrada inv\u00e1lido "$2." para a propriedade JSON "$1.".
NonLinearVersioning.Error.JSONMaxHigherOrEqualToMin=O tamanho m\u00e1ximo "$1." deve ser maior ou igual ao tamanho m\u00ednimo "$1.".
NonLinearVersioning.Error.JSONInvalidType=Tipo de valor de entrada inv\u00e1lido "$2." para a propriedade JSON "$1.".
NonLinearVersioning.Error.JSONOnlyOneKey=A entrada cont\u00e9m mais de um objeto JSON de $1.
NonLinearVersioning.Error.JSONInvalidVersion=Vers\u00e3o JSON n\u00e3o compat\u00edvel: $1...
NonLinearVersioning.Error.JSONUnknownIntent=A inten\u00e7\u00e3o sem\u00e2ntica de revis\u00e3o no JSON n\u00e3o \u00e9 reconhecida: $1..
NonLinearVersioning.Error.JSONUnknownBlock=Bloco de n\u00famero de revis\u00e3o desconhecido (precisa ser selecionado no grupo, prim\u00e1rio, sequencial ou secund\u00e1rio)
NonLinearVersioning.Error.notValidVersionNumberRule=N\u00famero inv\u00e1lido da revis\u00e3o do gerador de script
NonLinearVersioning.Error.InvalidInputRevisionNumber=a revis\u00e3o de entrada n\u00famero $1. n\u00e3o \u00e9 consistente com a governan\u00e7a do objeto (consulte a Pol\u00edtica $2.).
NonLinearVersioning.Error.UnknownPredicateName=O predicado $1. n\u00e3o est\u00e1 entre a lista de predicados dispon\u00edveis.
NonLinearVersioning.Error.UnknownGeneratorName=O gerador de c\u00f3digo $1. n\u00e3o est\u00e1 na lista dos dispon\u00edveis.
NonLinearVersioning.Error.NotVersionNumberRules=Gerador de n\u00famero de revis\u00e3o n\u00e3o definido para a inten\u00e7\u00e3o sem\u00e2ntica $1.
NonLinearVersioning.Error.OneSourceAtOnce=Somente uma c\u00f3pia de uma fonte por vez!
NonLinearVersioning.Error.Query=Falha ao consultar oa base de dados
NonLinearVersioning.Error.SOVCarryOver=Falha ao atualizar a propriedade do vetor secund\u00e1rio: $1.
NonLinearVersioning.Error.POVCarryOver=Falha ao atualizar a propriedade do vetor prim\u00e1rio: $1.
NonLinearVersioning.Error.QueryExchangeStatus=Falha ao consultar o banco de dados para obter o status do Exchange.
NonLinearVersioning.Error.TransactionReport=Falha ao acessar o status do relat\u00f3rio de transa\u00e7\u00e3o.
NonLinearVersioning.Error.QueryRevision=Falha ao consultar a base de dados para revis\u00f5es.
NonLinearVersioning.Error.QueryFamily=Falha ao consultar a base de dados para o ID da fam\u00edlia.
NonLinearVersioning.Error.QuerySiteName=Falha ao consultar a base de dados para o nome do site.
NonLinearVersioning.Error.QueryVersionAttrs=Falha ao consultar a base de dados para obter atributos de revis\u00e3o.
NonLinearVersioning.Error.QuerySemantics=Falha ao consultar a base de dados para arestas de inten\u00e7\u00e3o sem\u00e2ntica.
NonLinearVersioning.Error.QueryAccessSequence=N\u00e3o \u00e9 poss\u00edvel acessar a sequ\u00eancia de revis\u00e3o usada para a inicializa\u00e7\u00e3o.
NonLinearVersioning.Error.VersionAccessPreviousRevision=N\u00e3o \u00e9 poss\u00edvel acessar a revis\u00e3o anterior.
NonLinearVersioning.Error.QueryAttributes=N\u00e3o foi poss\u00edvel ler os atributos do objeto.
NonLinearVersioning.Error.isConfiguredAsEvolution=N\u00e3o foi poss\u00edvel verificar se um objeto est\u00e1 configurado no Evolution: $1.
NonLinearVersioning.Error.QueryExists=N\u00e3o foi poss\u00edvel acessar o objeto. Ele existe?
NonLinearVersioning.Error.NotAccessible=Objeto n\u00e3o acess\u00edvel ($1.)?
NonLinearVersioning.Error.QueryAttributeInformation=N\u00e3o \u00e9 poss\u00edvel acessar as informa\u00e7\u00f5es do atributo $1.
NonLinearVersioning.Error.NoAccessToChangeInfo=N\u00e3o foi poss\u00edvel acessar as informa\u00e7\u00f5es da a\u00e7\u00e3o de mudan\u00e7a para $1.
NonLinearVersioning.Error.GetInterface=N\u00e3o foi poss\u00edvel acessar $1. no objeto.
NonLinearVersioning.Error.SetInterface=N\u00e3o foi poss\u00edvel definir $1. no objeto.
NonLinearVersioning.Error.ResetInterface=N\u00e3o foi poss\u00edvel redefinir $1. no objeto.
NonLinearVersioning.Error.QueryIndexPolicy=N\u00e3o \u00e9 poss\u00edvel obter acesso a $1. $2.
NonLinearVersioning.Error.NonMIBPolicy=A cria\u00e7\u00e3o de dados falhou, pois a pol\u00edtica $1. n\u00e3o \u00e9 uma pol\u00edtica MIB.
NonLinearVersioning.Error.QueryExpression=N\u00e3o \u00e9 poss\u00edvel acessar a express\u00e3o no objeto.
NonLinearVersioning.Error.InvokeClass=Classe n\u00e3o encontrada durante a invoca\u00e7\u00e3o.
NonLinearVersioning.Error.InvokeInstantiate=Falha ao instanciar durante a invoca\u00e7\u00e3o.
NonLinearVersioning.Error.InvokeAccess=Acesso ilegal durante a invoca\u00e7\u00e3o.
NonLinearVersioning.Error.InvokeSecurity=Problema de seguran\u00e7a durante a invoca\u00e7\u00e3o.
NonLinearVersioning.Error.InvokeMethod=N\u00e3o existe tal m\u00e9todo durante a invoca\u00e7\u00e3o.
NonLinearVersioning.Error.InvokeTarget=Erro de destino durante a invoca\u00e7\u00e3o.
NonLinearVersioning.Error.ReviseFromNotAuthorized=Falha na revis\u00e3o de algo que n\u00e3o est\u00e1 na fam\u00edlia de revis\u00e3o atual.
NonLinearVersioning.Error.IsLastCheck=N\u00e3o \u00e9 poss\u00edvel verificar se o objeto \u00e9 a \u00faltima revis\u00e3o.
NonLinearVersioning.Error.ReviseIntoForbidden=Revis\u00e3o que n\u00e3o \u00e9 a mais recente n\u00e3o \u00e9 autorizada para o objeto $1.
NonLinearVersioning.Error.ReviseFromNotLast=O objeto $1. j\u00e1 foi revisado.
NonLinearVersioning.Error.ReviseMajor=A cria\u00e7\u00e3o de uma nova revis\u00e3o n\u00e3o est\u00e1 autorizada para esse estado de maturidade!
NonLinearVersioning.Error.ReviseMinor=A cria\u00e7\u00e3o de uma nova revis\u00e3o secund\u00e1ria n\u00e3o est\u00e1 autorizada para esse estado de maturidade!
NonLinearVersioning.Error.NoReviseAccess=No momento, n\u00e3o \u00e9 poss\u00edvel revisar. Poss\u00edvel causa e solu\u00e7\u00e3o: talvez voc\u00ea n\u00e3o tenha a fun\u00e7\u00e3o de acesso necess\u00e1ria para revisar esse objeto no espa\u00e7o colaborativo de destino,... Verifique a fun\u00e7\u00e3o de acesso especificada em suas credenciais atuais ou crie outras credenciais. Para obter mais informa\u00e7\u00f5es sobre as fun\u00e7\u00f5es de acesso necess\u00e1rias para essa opera\u00e7\u00e3o, consulte a p\u00e1gina Acesso ao conte\u00fado no guia do usu\u00e1rio do seu aplicativo.
NonLinearVersioning.Error.NoReviseOnDistantData=A revis\u00e3o n\u00e3o \u00e9 poss\u00edvel em dados pertencentes a outro site (dados distantes).
NonLinearVersioning.Error.NoReviseAccessDueToMaturityState=A revis\u00e3o n\u00e3o \u00e9 poss\u00edvel no momento. A \u00faltima revis\u00e3o deste $1. est\u00e1 no estado de maturidade $2. onde se espera pelo menos o estado LIBERADO.
NonLinearVersioning.Error.LastERMinor=A \u00faltima opera\u00e7\u00e3o n\u00e3o \u00e9 compat\u00edvel com o objeto indexado como somente para secund\u00e1rios.
NonLinearVersioning.Error.MakeClone=Falha ao revisar ou duplicar.
NonLinearVersioning.Error.MakeCloneParam=N\u00e3o \u00e9 poss\u00edvel revisar ou duplicar o objeto $1...
NonLinearVersioning.Error.MakeCloneRevisionFormat=O formato de revis\u00e3o esperado \u00e9 $1...
NonLinearVersioning.Error.MakeCloneMultipleDelimiters=Delimitador \u00fanico esperado no formato de revis\u00e3o.
NonLinearVersioning.Error.MakeReadAccess=Este conte\u00fado n\u00e3o est\u00e1 mais acess\u00edvel. O objeto pode ter sido exclu\u00eddo ou voc\u00ea pode n\u00e3o ter mais o acesso necess\u00e1rio.
NonLinearVersioning.Error.DontExist=Este conte\u00fado n\u00e3o est\u00e1 mais acess\u00edvel. O objeto pode ter sido exclu\u00eddo.
NonLinearVersioning.Error.MakeCloneAccess=Poss\u00edvel causa e solu\u00e7\u00e3o: talvez voc\u00ea n\u00e3o tenha a responsabilidade necess\u00e1ria para criar esse objeto no espa\u00e7o colaborativo de destino.  Verifique a fun\u00e7\u00e3o de acesso especificada em suas credenciais atuais ou escolha outras credenciais.  Para obter mais informa\u00e7\u00f5es sobre as fun\u00e7\u00f5es de acesso necess\u00e1rias para essa opera\u00e7\u00e3o, consulte a p\u00e1gina Acesso ao conte\u00fado no guia do usu\u00e1rio do seu aplicativo.
NonLinearVersioning.Error.AccessRights=Alguns objetos n\u00e3o est\u00e3o acess\u00edveis para o usu\u00e1rio atual. Poss\u00edvel causa e solu\u00e7\u00e3o: talvez voc\u00ea n\u00e3o tenha a fun\u00e7\u00e3o de acesso necess\u00e1ria para criar esse objeto no espa\u00e7o colaborativo de destino.  Verifique a fun\u00e7\u00e3o de acesso especificada em suas credenciais atuais ou escolha outras credenciais.  Para obter mais informa\u00e7\u00f5es sobre as fun\u00e7\u00f5es de acesso necess\u00e1rias para essa opera\u00e7\u00e3o, consulte a p\u00e1gina Acesso ao conte\u00fado no guia do usu\u00e1rio do seu aplicativo.
NonLinearVersioning.Error.InsufficientAccessRights=Esta a\u00e7\u00e3o requer privil\u00e9gios de administrador para o usu\u00e1rio <$1>.
NonLinearVersioning.Error.MakeDuplicateAccess=Alguns objetos n\u00e3o est\u00e3o acess\u00edveis para o usu\u00e1rio atual. Poss\u00edvel causa e solu\u00e7\u00e3o: talvez voc\u00ea n\u00e3o tenha a fun\u00e7\u00e3o de acesso necess\u00e1ria para criar esse objeto no espa\u00e7o colaborativo de destino.  Verifique a fun\u00e7\u00e3o de acesso especificada em suas credenciais atuais ou escolha outras credenciais.  Para obter mais informa\u00e7\u00f5es sobre as fun\u00e7\u00f5es de acesso necess\u00e1rias para essa opera\u00e7\u00e3o, consulte a p\u00e1gina Acesso ao conte\u00fado no guia do usu\u00e1rio do seu aplicativo.
NonLinearVersioning.Error.MakeDeleteParam=N\u00e3o foi poss\u00edvel excluir o objeto $1...
NonLinearVersioning.Error.BatchReviseParam=Falha na revis\u00e3o devido a um destes objetos: $1.
NonLinearVersioning.Error.BatchDeleteParam=Falha ao excluir devido a um destes objetos: $1...
NonLinearVersioning.Error.UpdateMaturity=Falha ao definir a maturidade como $1. para revisar/clonar objeto.
NonLinearVersioning.Error.UpdateStamp=Falha ao definir o carimbo de atualiza\u00e7\u00e3o como $1. para revisar/clonar objeto.
NonLinearVersioning.Error.ResetConfiguration=Falha ao redefinir as informa\u00e7\u00f5es de configura\u00e7\u00e3o ap\u00f3s a opera\u00e7\u00e3o de revis\u00e3o/clonagem: $1..
NonLinearVersioning.Error.CleanConfiguration=N\u00e3o \u00e9 permitido duplicar porque pelo menos uma inst\u00e2ncia est\u00e1 em A\u00e7\u00e3o de altera\u00e7\u00e3o.
NonLinearVersioning.Error.BusinessLogicValidationFailed=A opera\u00e7\u00e3o foi recusada por verifica\u00e7\u00f5es de l\u00f3gica de neg\u00f3cios.
NonLinearVersioning.Error.DerivationNodeParametesr=Falha ao ler a propriedade de par\u00e2metros de deriva\u00e7\u00e3o de n\u00f3 no produto.
NonLinearVersioning.Error.HandlerEmptyPolicy=Pol\u00edtica n\u00e3o definida.
NonLinearVersioning.Error.HandlerUndefined=N\u00e3o foi poss\u00edvel encontrar o manipulador apropriado para o(s) objeto(s): $1.
NonLinearVersioning.Error.MigrationDistant=A migra\u00e7\u00e3o do gr\u00e1fico de vers\u00f5es n\u00e3o \u00e9 autorizada neste site: A primeira revis\u00e3o \u00e9 considerada distante.
NonLinearVersioning.Error.MigrationPresent=A migra\u00e7\u00e3o do gr\u00e1fico de vers\u00f5es n\u00e3o \u00e9 autorizada neste site: A primeira revis\u00e3o n\u00e3o est\u00e1 presente e algumas revis\u00f5es s\u00e3o consideradas distantes.
NonLinearVersioning.Error.PidFormat=Formato de ID f\u00edsico inv\u00e1lido $1. na solicita\u00e7\u00e3o $2. (chave: $3.).
NonLinearVersioning.Error.VidFormat=O formato VID n\u00e3o est\u00e1 correto.
NonLinearVersioning.Error.expectedObjectId=Espera-se um ID de objeto que n\u00e3o suporte o gerenciamento de itera\u00e7\u00e3o: $1. na solicita\u00e7\u00e3o $2. (chave: $3.).
NonLinearVersioning.Error.expectedBranchId=Espera-se um objeto no contexto da itera\u00e7\u00e3o: $1. na solicita\u00e7\u00e3o $2. (chave: $3.).
NonLinearVersioning.Error.expectedInvaliId=N\u00e3o h\u00e1 um ID de formato v\u00e1lido nesse contexto $1. na solicita\u00e7\u00e3o $2. (chave: $3.).
NonLinearVersioning.Error.CorruptedMultipleCopies=Corrup\u00e7\u00e3o de dados: uma revis\u00e3o n\u00e3o pode ser a c\u00f3pia de v\u00e1rias outras.
NonLinearVersioning.Error.CommitFailed=Falha na opera\u00e7\u00e3o de salvamento.
NonLinearVersioning.Error.RevisionSequence.NotDefined=Sequ\u00eancia de revis\u00e3o n\u00e3o definida.
NonLinearVersioning.Error.RevisionSequence.InvalidSequenceDefinition=A sequ\u00eancia de revis\u00e3o <$1.> n\u00e3o \u00e9 v\u00e1lida.
NonLinearVersioning.Error.RevisionSequence.LettersInRangeWithSameCase=O intervalo de caracteres definido na sequ\u00eancia de revis\u00e3o deve usar o mesmo caso.
NonLinearVersioning.Error.RevisionSequence.LettersInRangeAreNotOdered=O intervalo de caracteres definido na sequ\u00eancia de revis\u00e3o deve ser ordenado corretamente.
NonLinearVersioning.Error.RevisionSequence.PaddingIsOneSinglCharacter=Defini\u00e7\u00e3o de preenchimento inv\u00e1lida <$2.>, deve ser um caractere exclusivo (modifique a propriedade $1.).
NonLinearVersioning.Error.RevisionSequence.InitContainsBlank=Defini\u00e7\u00e3o de sequ\u00eancia de inicializa\u00e7\u00e3o inv\u00e1lida. N\u00e3o pode conter valores em branco.
NonLinearVersioning.Error.RevisionSequence.onlyLetterInSequence=A sequ\u00eancia de revis\u00e3o cont\u00e9m caracteres inv\u00e1lidos.
NonLinearVersioning.Error.RevisionSequence.AlreadyDefined=J\u00e1 existe uma sequ\u00eancia de revis\u00e3o chamada \u201c$1.\u201d.
NonLinearVersioning.Error.RevisionSequence.NotDeclared=A sequ\u00eancia de revis\u00e3o chamada \u201c$1.\u201d n\u00e3o existe.
NonLinearVersioning.Error.RevisionSequence.EditForbidden=A Sequ\u00eancia de Revis\u00e3o DS denominada "$1." pode ser modificada.
NonLinearVersioning.Error.RevisionSequence.NotCompatible=A defini\u00e7\u00e3o da sequ\u00eancia de revis\u00e3o de entrada n\u00e3o \u00e9 compat\u00edvel com a sequ\u00eancia de revis\u00e3o denominada "$1", portanto, a atualiza\u00e7\u00e3o \u00e9 proibida.
NonLinearVersioning.Error.RevisionSequence.MaximumSequenceSize=A sequ\u00eancia de revis\u00e3o estendida "$1." tem comprimento m\u00e1ximo de "$2.".
NonLinearVersioning.Error.RevisionSequence.LastSequenceReached=A \u00faltima sequ\u00eancia da Sequ\u00eancia de revis\u00e3o estendida "$1." foi alcan\u00e7ada.
NonLinearVersioning.Error.RevisionSequence.ForbiddenSequence=A Sequ\u00eancia de revis\u00e3o estendida cont\u00e9m o seguinte caractere <$1.>, que \u00e9 proibido.
NonLinearVersioning.Error.RevisionSequenceStillAssociated=A Sequ\u00eancia de revis\u00e3o ampliada n\u00e3o pode ser removida ou atualizada. Poss\u00edvel causa e solu\u00e7\u00e3o: algumas Sequ\u00eancias de revis\u00e3o ampliadas ainda est\u00e3o associadas a tipos de objetos
NonLinearVersioning.Error.RevisionSequence.RevisionSequenceStillUsedAsAlternate=A sequ\u00eancia de revis\u00e3o estendida n\u00e3o pode ser removida. Poss\u00edvel causa e solu\u00e7\u00e3o: algumas sequ\u00eancias de revis\u00e3o estendida ainda s\u00e3o usadas como uma sequ\u00eancia alternativa em l\u00f3gicas de revis\u00e3o estendida
NonLinearVersioning.Error.rerouteAfterCloning=Pelo menos uma opera\u00e7\u00e3o de redirecionamento ap\u00f3s a falha das opera\u00e7\u00f5es de revis\u00e3o/duplica\u00e7\u00e3o.
NonLinearVersioning.Error.NoAccessToRelationship=Falha ao consultar a base de dados de relacionamento durante opera\u00e7\u00f5es de redirecionamento ap\u00f3s opera\u00e7\u00f5es de revis\u00e3o/duplica\u00e7\u00e3o.
NonLinearVersioning.Error.NoAccessToPath=Falha ao consultar o banco de dados de caminhos durante opera\u00e7\u00f5es de redirecionamento ap\u00f3s opera\u00e7\u00f5es de revis\u00e3o/duplica\u00e7\u00e3o.
NonLinearVersioning.Error.UpdatePathFailed=Falha ao atualizar os caminhos durante a opera\u00e7\u00e3o de mesclagem/clonagem.
NonLinearVersioning.Error.AddVersionError=Falha ao invocar a l\u00f3gica de neg\u00f3cios de inicializa\u00e7\u00e3o. 
NonLinearVersioning.Error.Completion=Falha ao invocar a l\u00f3gica de neg\u00f3cios de revis\u00e3o, duplica\u00e7\u00e3o ou exclus\u00e3o de conclus\u00e3o devido a $1.. 
NonLinearVersioning.Error.Dedicated=Erro ao executar uma opera\u00e7\u00e3o de aplicativo (informa\u00e7\u00f5es detalhadas: $1.).
NonLinearVersioning.Error.DocumentType=Falha ao verificar o tipo de documento.
NonLinearVersioning.Error.CESTAMPCheck=O objeto foi modificado por outro usu\u00e1rio desde que voc\u00ea o abriu.
NonLinearVersioning.Error.ResetDerivedFrom=N\u00e3o \u00e9 poss\u00edvel separar a nova revis\u00e3o da fam\u00edlia anterior durante a opera\u00e7\u00e3o de duplica\u00e7\u00e3o.
NonLinearVersioning.Error.ReadDerivedFrom=N\u00e3o \u00e9 poss\u00edvel ler o valor "Derivado de".
NonLinearVersioning.Error.TwoEvolutionOnSameAncestor=A cria\u00e7\u00e3o de uma nova revis\u00e3o n\u00e3o \u00e9 autorizada, pois pelo menos duas revis\u00f5es pertencem \u00e0 mesma ramifica\u00e7\u00e3o: $1..
NonLinearVersioning.Error.AccessVersionNumberGenerator=N\u00e3o \u00e9 poss\u00edvel acessar a configura\u00e7\u00e3o relativa ao modo de gerador de revis\u00e3o: $1.
NonLinearVersioning.Error.BomSynchronizeForbidEditIntent=A edi\u00e7\u00e3o da vers\u00e3o do gr\u00e1fico \u00e9 proibida no objeto envolvido na sincroniza\u00e7\u00e3o do EBOM.
NonLinearVersioning.Error.ReadAttribute=N\u00e3o foi poss\u00edvel ler o atributo $1..
NonLinearVersioning.Error.ReadTitle=N\u00e3o foi poss\u00edvel ler o t\u00edtulo.
NonLinearVersioning.Error.UnavailableProductIntent=Inten\u00e7\u00e3o indispon\u00edvel para este produto.
NonLinearVersioning.Error.OnlyOneProductIntent=O produto suporta apenas uma \u00fanica inten\u00e7\u00e3o.
NonLinearVersioning.Error.DerivativeAfterFix=Derivativos ap\u00f3s uma corre\u00e7\u00e3o n\u00e3o s\u00e3o poss\u00edveis para produtos ou planos de fabrica\u00e7\u00e3o.
NonLinearVersioning.Error.EvolutionFromNotLast=O Evolution \u00e9 compat\u00edvel apenas com a \u00faltima revis\u00e3o do produto.
NonLinearVersioning.Error.UnableReadData=N\u00e3o foi poss\u00edvel ler os dados da base de dados.
NonLinearVersioning.Error.UnableWriteData=N\u00e3o \u00e9 poss\u00edvel gravar dados na base de dados.
NonLinearVersioning.Error.UnableToSetInformation=N\u00e3o foi poss\u00edvel atualizar as informa\u00e7\u00f5es na base de dados\n(Informa\u00e7\u00f5es adicionais: $1.).
NonLinearVersioning.Error.UnableSetData=N\u00e3o \u00e9 poss\u00edvel definir dados na base de dados.
NonLinearVersioning.Error.TNR=N\u00e3o \u00e9 poss\u00edvel criar um novo objeto $1. porque j\u00e1 existe outro objeto com o mesmo identificador.
NonLinearVersioning.Error.RequestSameTNR=Solicita\u00e7\u00e3o de v\u00e1rias revis\u00f5es com o mesmo identificador $1..
NonLinearVersioning.Error.NoVirtualItem=Item f\u00edsico esperado.
NonLinearVersioning.Error.UnexpectedMigration=Cria\u00e7\u00e3o inesperada de um item f\u00edsico.
NonLinearVersioning.Error.AddVersionRequestNotAuthorizedIntent=A solicita\u00e7\u00e3o de revis\u00e3o de adi\u00e7\u00e3o est\u00e1 usando um operador n\u00e3o autorizado: $1.
NonLinearVersioning.Error.AddVersionRequestOnlyOneIntentAuthorized=Para esse tipo de objeto, h\u00e1 suporte para apenas um operador de revis\u00e3o de adi\u00e7\u00e3o por solicita\u00e7\u00e3o.
NonLinearVersioning.Error.FirstOnlyOnceForConfiguredTime=Pelo menos uma Revis\u00e3o configurada j\u00e1 criada em $1. $2.
NonLinearVersioning.Error.ConfiguredRevisionNotAuthorized=A cria\u00e7\u00e3o da Revis\u00e3o configurada ainda n\u00e3o est\u00e1 dispon\u00edvel em $1. $2.
NonLinearVersioning.Error.MissingJsonHttpInput=A solicita\u00e7\u00e3o HTTP n\u00e3o fornece uma entrada JSON.
NonLinearVersioning.Error.MissingObjectHttpInput=A solicita\u00e7\u00e3o HTTP n\u00e3o fornece objeto de entrada.
NonLinearVersioning.Error.InvalidHttpContext=N\u00e3o \u00e9 poss\u00edvel abrir a sess\u00e3o!
NonLinearVersioning.Error.InvalidOutputFormat=Espera-se que retorne uma mensagem de sa\u00edda de $1. que n\u00e3o \u00e9 esperada pelo lado do cliente.
NonLinearVersioning.Error.ForbiddenAttributeUpdate=O atributo b\u00e1sico $1. (com valor $2.) n\u00e3o p\u00f4de fazer parte de uma cl\u00e1usula de atualiza\u00e7\u00e3o.
NonLinearVersioning.Error.NoAccessToJpo=Sem acesso ao programa <$1.>
NonLinearVersioning.Error.InvalidDatabaseAccess=Sem acesso \u00e0s informa\u00e7\u00f5es da base de dados <$1.>
NonLinearVersioning.Error.GlobalAuthoringOptionOnly=A op\u00e7\u00e3o de autoria global $1. \u00e9 definida como op\u00e7\u00e3o no n\u00edvel da solicita\u00e7\u00e3o.
NonLinearVersioning.Error.InvalidIntent=A opera\u00e7\u00e3o $1. n\u00e3o \u00e9 autorizada neste tipo de objeto.
NonLinearVersioning.Error.NotAuthorizedAddVersion=A cria\u00e7\u00e3o de revis\u00e3o do tipo $1. precisa de licen\u00e7as espec\u00edficas para $2. autorizados.
NonLinearVersioning.Error.UnableToCreateModuleBranch=N\u00e3o foi poss\u00edvel criar o m\u00f3dulo $1 ramifica\u00e7\u00e3o $2
NonLinearVersioning.Error.AuthoringOptionOnRevise=A op\u00e7\u00e3o de autoria $1. \u00e9 v\u00e1lida somente para a nova revis\u00e3o (nem para duplicata, nem para nova ramifica\u00e7\u00e3o).
NonLinearVersioning.Error.MQLCommandException=Exce\u00e7\u00e3o ao executar a linguagem de consulta
NonLinearVersioning.Error.MQLCommandFailed=Falha na execu\u00e7\u00e3o da linguagem de consulta (detalhe: $1.).
NonLinearVersioning.Error.TypeNameRevisionConflict=O tipo de exclusividade, o nome e a revis\u00e3o entram em conflito com $1. $2. $3.
NonLinearVersioning.Error.UnknownEditIntentOperation=Somente as opera\u00e7\u00f5es ADICIONAR E REMOVER s\u00e3o v\u00e1lidas para a edi\u00e7\u00e3o do gr\u00e1fico de vers\u00e3o sem\u00e2ntica
NonLinearVersioning.Error.MIBAddModule=N\u00e3o foi poss\u00edvel criar o m\u00f3dulo. (informa\u00e7\u00f5es adicionais: $1.)
NonLinearVersioning.Error.MIBOnly=Servi\u00e7o dispon\u00edvel somente para MIB.
NonLinearVersioning.Error.ObjectDontExist=O objeto n\u00e3o existe. (informa\u00e7\u00f5es adicionais: $1.)
NonLinearVersioning.Error.Kernel.Undefined=Falha na execu\u00e7\u00e3o de um comando do kernel. (informa\u00e7\u00f5es adicionais: $1.)
NonLinearVersioning.Error.PolicyDontExist=A pol\u00edtica $1. usada para criar dados n\u00e3o existe.
NonLinearVersioning.Error.TypeDontExist=O tipo $1. usado para criar dados n\u00e3o existe.
NonLinearVersioning.Error.NoReflexiveSemanticEdge=As vers\u00f5es anteriores e posteriores na edi\u00e7\u00e3o do gr\u00e1fico de vers\u00e3o sem\u00e2ntica devem ser diferentes.
NonLinearVersioning.Error.NoReflexiveComposition=As vers\u00f5es pai e filho na estrutura de composi\u00e7\u00e3o sem\u00e2ntica devem ser diferentes.
NonLinearVersioning.Error.NotComposedInFather=A vers\u00e3o $1. n\u00e3o \u00e9 composta em $2.
NonLinearVersioning.Error.CompositionRemovalFailed=N\u00e3o foi poss\u00edvel remover $1. como composi\u00e7\u00e3o de $2. (provavelmente n\u00e3o foi encontrado entre as composi\u00e7\u00f5es ou n\u00e3o h\u00e1 acesso a ela).
NonLinearVersioning.Error.CompositionAdditionFailed=N\u00e3o \u00e9 poss\u00edvel inserir $1. como nova composi\u00e7\u00e3o em $2.
NonLinearVersioning.Error.FormatOptionIgnored=A op\u00e7\u00e3o de formato \u00e9 ignorada, pois est\u00e1 localizada na defini\u00e7\u00e3o da solicita\u00e7\u00e3o
NonLinearVersioning.Error.RestoreSameResultingIteration=A itera\u00e7\u00e3o selecionada para restaura\u00e7\u00e3o \u00e9 a mesma que a atual.
NonLinearVersioning.Error.RestoreIterationOutOfRange=A itera\u00e7\u00e3o selecionada para restaura\u00e7\u00e3o est\u00e1 fora do intervalo de itera\u00e7\u00f5es dispon\u00edveis.
NonLinearVersioning.Error.RevisionSequenceNotFound=Sequ\u00eancia de revis\u00e3o $1. n\u00e3o encontrada.
NonLinearVersioning.Error.RevisionLogicNotFound=L\u00f3gica de revis\u00e3o $1. n\u00e3o encontrada.
NonLinearVersioning.Error.RevisionLogic.NotDeclared=A l\u00f3gica de revis\u00e3o chamada "$1." n\u00e3o existe.
NonLinearVersioning.Error.RevisionLogic.NotDefined=L\u00f3gica de revis\u00e3o n\u00e3o definida.
NonLinearVersioning.Error.RevisionLogic.InvalidJSON=Erro ao criar uma l\u00f3gica de revis\u00e3o a partir de um JSON: atributo "$1." ausente.
NonLinearVersioning.Error.UpdateRevisionSequence=N\u00e3o \u00e9 poss\u00edvel definir ou redefinir a Sequ\u00eancia de revis\u00e3o estendida em $1. $2.
NonLinearVersioning.Error.UpdateRevisionLogic=N\u00e3o \u00e9 poss\u00edvel definir ou redefinir a l\u00f3gica de revis\u00e3o estendida em $1. $2..
NonLinearVersioning.Error.PromoteNotAuthorized=A promo\u00e7\u00e3o para $1. n\u00e3o \u00e9 autorizada pelo modo de n\u00famero de revis\u00e3o $2. no objeto $3.
NonLinearVersioning.Error.AddVersionNewBranchOneMax=Apenas uma opera\u00e7\u00e3o de nova ramifica\u00e7\u00e3o \u00e9 aceita. Remova a opera\u00e7\u00e3o in\u00fatil $1.
NonLinearVersioning.Error.AddVersionNewRevisionOneMax=Somente uma opera\u00e7\u00e3o de nova revis\u00e3o \u00e9 aceita. Remova a opera\u00e7\u00e3o in\u00fatil $1.
NonLinearVersioning.Error.AddVersionDuplicateOneMax=Apenas uma opera\u00e7\u00e3o de opera\u00e7\u00e3o duplicada \u00e9 aceita. Remova a opera\u00e7\u00e3o in\u00fatil $1.
NonLinearVersioning.Error.AddVersionNewMinorRevisionOneMax=Somente uma opera\u00e7\u00e3o de nova revis\u00e3o secund\u00e1ria \u00e9 aceita. Remova a opera\u00e7\u00e3o in\u00fatil $1.
NonLinearVersioning.Error.AddVersionFirstRevisionOneMax=Somente uma opera\u00e7\u00e3o de nova revis\u00e3o da primeira configura\u00e7\u00e3o \u00e9 aceita. Remova a opera\u00e7\u00e3o in\u00fatil $1..
NonLinearVersioning.Error.AddVersionNewRevisionAndNewBranchCompatibility=A opera\u00e7\u00e3o de nova revis\u00e3o n\u00e3o \u00e9 compat\u00edvel com a nova ramifica\u00e7\u00e3o. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionNewRevisionAndDuplicateCompatibility=A opera\u00e7\u00e3o de nova revis\u00e3o n\u00e3o \u00e9 compat\u00edvel com a fun\u00e7\u00e3o duplicar. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionNewRevisionAndNewMinorRevisionOneMax=A opera\u00e7\u00e3o de nova revis\u00e3o n\u00e3o \u00e9 compat\u00edvel com a nova revis\u00e3o secund\u00e1ria. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionNewRevisionAndFirstOneMax=A opera\u00e7\u00e3o de nova revis\u00e3o n\u00e3o \u00e9 compat\u00edvel com a cria\u00e7\u00e3o da primeira revis\u00e3o configurada. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionNewBranchAndDuplicateCompatibility=A opera\u00e7\u00e3o de nova ramifica\u00e7\u00e3o n\u00e3o \u00e9 compat\u00edvel com a duplica\u00e7\u00e3o. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionNewBranchAndNewMinorRevisionOneMax=A opera\u00e7\u00e3o de nova ramifica\u00e7\u00e3o n\u00e3o \u00e9 compat\u00edvel com a nova revis\u00e3o secund\u00e1ria. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionNewRevisionAndFirstOneMax=A opera\u00e7\u00e3o de nova ramifica\u00e7\u00e3o n\u00e3o \u00e9 compat\u00edvel com a cria\u00e7\u00e3o da primeira revis\u00e3o configurada. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionDuplicateAndNewMinorRevisionOneMax=A opera\u00e7\u00e3o duplicada n\u00e3o \u00e9 compat\u00edvel com a nova revis\u00e3o secund\u00e1ria. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionDuplicateAndFirstOneMax=A opera\u00e7\u00e3o duplicada n\u00e3o \u00e9 compat\u00edvel com a cria\u00e7\u00e3o da primeira revis\u00e3o configurada. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionSecondaryAndFirstOneMax=A opera\u00e7\u00e3o de nova revis\u00e3o secund\u00e1ria n\u00e3o \u00e9 compat\u00edvel com a cria\u00e7\u00e3o da primeira revis\u00e3o configurada. Remova as opera\u00e7\u00f5es incompat\u00edveis.
NonLinearVersioning.Error.AddVersionNewReviseFromPolicyMissmatch=Os objetos de refer\u00eancia e de origem n\u00e3o t\u00eam a mesma pol\u00edtica.
NonLinearVersioning.nls.ConfiguredRevision.type=Revis\u00e3o configurada
NonLinearVersioning.nls.ConfiguredRevision.license=Configura\u00e7\u00e3o
NonLinearVersioning.Error.AssociatedRevisionSequence=Em um $1., associe a sequ\u00eancia de Revis\u00e3o $2. requer privil\u00e9gios de administrador para o usu\u00e1rio conectado <$3.>.
NonLinearVersioning.Error.ResetAssociatedRevisionSequence=Em um $1., dissociar uma sequ\u00eancia de revis\u00e3o requer privil\u00e9gios de administrador para o usu\u00e1rio conectado <$3.>.
NonLinearVersioning.Error.EditRevisionSequence=A edi\u00e7\u00e3o da sequ\u00eancia de revis\u00e3o $1. exige que o usu\u00e1rio conectado $2. tenha privil\u00e9gio de administrador.
NonLinearVersioning.Error.AssociatedRevisionLogic=Em um $1., associe a l\u00f3gica de Revis\u00e3o $2. requer privil\u00e9gios de administrador para o usu\u00e1rio conectado <$3.>.
NonLinearVersioning.Error.ResetAssociatedRevisionLogic=Em um $1., dissociar uma l\u00f3gica de revis\u00e3o requer privil\u00e9gios de administrador para o usu\u00e1rio conectado <$3.>.
NonLinearVersioning.Error.EditRevisionLogic=Editar a l\u00f3gica de revis\u00e3o $1. exigia que o usu\u00e1rio conectado $2. tivesse privil\u00e9gio de administrador.
NonLinearVersioning.Error.RevisionLogicStillAssociated=A l\u00f3gica de revis\u00e3o estendida n\u00e3o pode ser removida. Poss\u00edvel causa e solu\u00e7\u00e3o: algumas l\u00f3gicas de revis\u00e3o estendida ainda est\u00e3o associadas a tipos de objeto(s)
NonLinearVersioning.Error.VGStackActivationFailed=N\u00e3o \u00e9 poss\u00edvel ativar a pilha do gr\u00e1fico de vers\u00f5es.
NonLinearVersioning.Error.VGStackDeactivationFailed=N\u00e3o \u00e9 poss\u00edvel desativar a pilha do gr\u00e1fico de vers\u00f5es.
NonLinearVersioning.Error.UnableToCopyFiles=N\u00e3o \u00e9 poss\u00edvel copiar arquivos para um novo documento.
NonLinearVersioning.Error.UnableToFigureVault=N\u00e3o foi poss\u00edvel descobrir o cofre de destino.
NonLinearVersioning.Error.DuplicateForbiddenSystemModel=A duplica\u00e7\u00e3o n\u00e3o \u00e9 poss\u00edvel neste modelo de sistema.
NonLinearVersioning.Error.UncompliantCode=A entrada da string de revis\u00e3o n\u00e3o corresponde \u00e0s configura\u00e7\u00f5es do sistema.
NonLinearVersioning.Error.TooLargeResultingOrder=A string de revis\u00e3o de entrada resulta em um pedido muito grande.
NonLinearVersioning.Error.BomControlled=N\u00e3o \u00e9 poss\u00edvel controlar a vers\u00e3o desta entidade $1 $2 na sess\u00e3o do cliente. Crie a nova vers\u00e3o dessa entidade com a mesma sess\u00e3o de cliente usada para sua cria\u00e7\u00e3o.
NonLinearVersioning.Error.DuplicateForbiddenOnConfidentialData=N\u00e3o \u00e9 permitida a duplica\u00e7\u00e3o de dados confidenciais.
NonLinearVersioning.Error.BranchForbiddenOnConfidentialData=N\u00e3o \u00e9 permitida a ramifica\u00e7\u00e3o em dados confidenciais.
NonLinearVersioning.Error.AttributeMaximumLength=O atributo V_Name excede o comprimento m\u00e1ximo de 100.

#Merge errors
NonLinearVersioning.Error.MergeWorkUnderChange=A mesclagem n\u00e3o \u00e9 permitida ao trabalhar sob o controle de altera\u00e7\u00f5es.
NonLinearVersioning.Error.MergeConfiguredObject=A mesclagem n\u00e3o \u00e9 permitida porque alguns objetos est\u00e3o configurados.
NonLinearVersioning.Error.MergeTypeNotAllowed=A mesclagem n\u00e3o \u00e9 permitida para objetos $1.
NonLinearVersioning.Error.MergePathNotAllowed=A mesclagem n\u00e3o \u00e9 permitida para objetos com caminhos de $1.
NonLinearVersioning.Error.MergeSRNotAllowed=N\u00e3o \u00e9 permitida a mesclagem de objetos que tenham caminhos de rela\u00e7\u00e3o sem\u00e2ntica com uma fun\u00e7\u00e3o $1.
NonLinearVersioning.Error.MergeItfNotAllowed=A mesclagem n\u00e3o \u00e9 permitida para objetos com interfaces de $1.
NonLinearVersioning.Error.MergeUsageIntegrity=$1 e $2 devem ter o mesmo uso.
NonLinearVersioning.Error.MergeVPLMControlledIntegrity=$1 deve ser controlado por vplm.
NonLinearVersioning.Error.MergeIsTerminalIntegrity=Os objetos terminais n\u00e3o podem ter objetos filhos.
NonLinearVersioning.Error.MergeUsagePartIntegrity=O 3DShape usado como 3DPart n\u00e3o pode ser exclu\u00eddo.
NonLinearVersioning.Error.MergeUpdatestampIntegrity=N\u00e3o \u00e9 permitida a mesclagem de dados antigos.
NonLinearVersioning.Error.MergeMinorOrderIntegrity=N\u00e3o \u00e9 permitido mesclar objetos governados pela pol\u00edtica de dupla indexa\u00e7\u00e3o com mais de uma revis\u00e3o secund\u00e1ria.
NonLinearVersioning.Error.MergeDisciplineIntegrity=A mesclagem n\u00e3o \u00e9 permitida para objetos $1.
NonLinearVersioning.Error.MergeSetOnlyOnceIntegrity=O atributo $1 n\u00e3o pode ser substitu\u00eddo porque j\u00e1 foi definido a um valor diferente.
NonLinearVersioning.Error.MergeDelegateRelTo=O relacionamento delegado n\u00e3o pode ser redirecionado para um objeto diferente.
NonLinearVersioning.Error.MergeDelegateRelModelerExc=Ocorreu um erro durante a mesclagem de $1 rela\u00e7\u00f5es: $2.
NonLinearVersioning.Error.MergeInputConsistency=Opera\u00e7\u00e3o de mesclagem inconsistente entre $1 e $2.
NonLinearVersioning.Error.MergePostCheckKo=Estado inconsistente dos dados ap\u00f3s opera\u00e7\u00e3o de mesclagem.

#xRevision
NonLinearVersioning.Error.AddVersionRequestNotAuthorizedOperationOnEffectivityBased=Opera\u00e7\u00e3o incompat\u00edvel em dados \u201cbaseados em efetividade\u201d.

#GraphSubset
NonLinearVersioning.Error.InvalidGraphSubsetMode=A entrada GraphSubset \u00e9 nula.

# Error message coming from IRs
# IR-1194448-3DEXPERIENCER2023x
NonLinearVersioning.Error.StudyNotAllowedOnConfiguredNode=N\u00e3o \u00e9 permitido duplicar como ramifica\u00e7\u00e3o no n\u00f3 configurado.
# IR-1299841-3DEXPERIENCER2025x
NonLinearVersioning.Error.FilterMustBeSetForPStudyOnConfiguredNode=Em um n\u00f3 configurado, \u00e9 necess\u00e1rio aplicar um filtro \u00e0 estrutura para permitir a ramifica\u00e7\u00e3o avan\u00e7ada. Aplique um filtro de configura\u00e7\u00e3o na estrutura antes de criar uma ramifica\u00e7\u00e3o. Para isso, use "Nova ramifica\u00e7\u00e3o avan\u00e7ada".
NonLinearVersioning.Error.FilterMustBeSingleEvolution=A ramifica\u00e7\u00e3o avan\u00e7ada em um n\u00f3 configurado s\u00f3 \u00e9 permitida se o filtro tiver um \u00fanico crit\u00e9rio de evolu\u00e7\u00e3o.  Use a \u201cNova ramifica\u00e7\u00e3o avan\u00e7ada\u201d para aplicar um filtro de configura\u00e7\u00e3o definido com apenas uma vers\u00e3o de modelo.
