# Copyright 2019-2025 Dassault Systemes. All rights reserved.
#
#   Subject: Propose NLS support for Version Graph error messages.
NonLinearVersioning.Notice.SemanticEdgeNotFound=Nie znaleziono relacji semantycznej do usuni\u0119cia, wi\u0119c nie wykonano \u017cadnej operacji.
NonLinearVersioning.Error.NLVStatus=Nie mo\u017cna uzyska\u0107 trybu wykresu poprawek (liniowego lub nie).
NonLinearVersioning.Error.SystemCompletion=Nie mo\u017cna uzyska\u0107 skojarzonego obiektu dla bie\u017c\u0105cej operacji.
NonLinearVersioning.Error.SemanticEdgeNotDeleted=Nie mo\u017cna usun\u0105\u0107 relacji semantycznej.
NonLinearVersioning.Error.SemanticNONE=\u017bADEN operator nie jest nieprawid\u0142owy w tym \u017c\u0105daniu.
NonLinearVersioning.Error.ItemNotDeleted=Nie mo\u017cna usun\u0105\u0107 pozycji.
NonLinearVersioning.Error.ItemNotLoaded=Nie mo\u017cna za\u0142adowa\u0107 pozycji.
NonLinearVersioning.Error.ItemNotSet=Nie ustawiono pozycji!
NonLinearVersioning.Error.ItemFromVersion=Nie mo\u017cna pobra\u0107 pozycji z wersji.
NonLinearVersioning.Error.ItemFromVersionModel=Nie mo\u017cna kontynuowa\u0107, poniewa\u017c ten produkt jest w\u0142asno\u015bci\u0105 innego u\u017cytkownika.
NonLinearVersioning.Error.ItemAlreadyExist=Pozycja jest ju\u017c ustawiona dla tej poprawki.
NonLinearVersioning.Error.ItemCreation=Nie mo\u017cna utworzy\u0107 pozycji.
NonLinearVersioning.Error.VersionNotSet=Brak ustawionej poprawki!
NonLinearVersioning.Error.VersionNull=Identyfikator fizyczny poprawki wej\u015bciowej ma warto\u015b\u0107 zerow\u0105 lub jest pusty!
NonLinearVersioning.Error.TypeNull=Nie zdefiniowano wej\u015bciowego typu biznesowego (warto\u015b\u0107 zerowa lub pusty)!
NonLinearVersioning.Error.VersionCopyFrom=Nie mo\u017cna pobra\u0107 kopii z.
NonLinearVersioning.Error.VersionDelete=Nie mo\u017cna usun\u0105\u0107 poprawki.
NonLinearVersioning.Error.computeVersionNumber=Nie mo\u017cna obliczy\u0107 numeru poprawki (dodatkowe informacje: $1.).
NonLinearVersioning.Error.VersionDeletePropagate=Nie mo\u017cna propagowa\u0107 usuni\u0119cia poprawki.
NonLinearVersioning.Error.VersionDeleteSpinOff=Nie mo\u017cna zmieni\u0107 trasy SPIN-OFF po usuni\u0119ciu poprawki.
NonLinearVersioning.Error.VersionDeleteLeaf=Mo\u017cna usun\u0105\u0107 tylko poprawk\u0119 potomka.
NonLinearVersioning.Error.VersionCheckMajor=Nie mo\u017cna sprawdzi\u0107 dost\u0119pu do wersji g\u0142\u00f3wnej.
NonLinearVersioning.Error.VersionToItem=Nie mo\u017cna po\u0142\u0105czy\u0107 wersji z elementem.
NonLinearVersioning.Error.VersionNoItem=Wersja nie jest powi\u0105zana z elementem i dlatego nie obs\u0142uguje trybu wykresu wersji.
NonLinearVersioning.Error.VersionAddSemantic=Nie mo\u017cna doda\u0107 lub zaktualizowa\u0107 \u0142\u0105cza semantycznego.
NonLinearVersioning.Error.VersionReviseMajor=Utworzenie nowej wersji nie jest dozwolone!
NonLinearVersioning.Error.VersionDuplicate=Utworzenie nowego obiektu z istniej\u0105cego nie jest dozwolone!
NonLinearVersioning.Error.VersionFamily=Nie uda\u0142o si\u0119 wyszuka\u0107 poprawki rodziny.
NonLinearVersioning.Error.VersionFamilyNull=Identyfikator rodziny poprawek nie mo\u017ce by\u0107 zerowy.
NonLinearVersioning.Error.VersionFamilyNotSet=Identyfikator wej\u015bciowej rodziny poprawek nie jest ustawiony!
NonLinearVersioning.Error.VersionsNotLoaded=Nie mo\u017cna uzyska\u0107 dost\u0119pu do rodziny poprawek.
NonLinearVersioning.Error.AddVersionsNull=Mapa \u017c\u0105da\u0144 dodania poprawek nie mo\u017ce mie\u0107 warto\u015bci null!
NonLinearVersioning.Error.GraphVersionsNull=Mapa \u017c\u0105da\u0144 poprawek wykresu semantycznego nie mo\u017ce by\u0107 pusta!
NonLinearVersioning.Error.AddVersionRequestNull=\u017b\u0105danie nie mo\u017ce by\u0107 puste!
NonLinearVersioning.Error.getLastVersionsFromJson=\u017b\u0105danie ostatniej poprawki nie mo\u017ce by\u0107 puste!
NonLinearVersioning.Error.AddVersionRequestSpinOff=SPIN-OFF nie mo\u017ce by\u0107 samodzielny w \u017c\u0105daniu dodania poprawki!
NonLinearVersioning.Error.AddVersionRequestSpinOffNew=Nie mo\u017cna \u0142\u0105czy\u0107 SPIN-OFF z NOWYM w liniowym trybie poprawki.
NonLinearVersioning.Error.AddVersionRequestFore=Operacja FORE pr\u00f3buje utworzy\u0107 cykl w wykresie poprawki semantycznej dla $1.!" ) ; }
NonLinearVersioning.Error.AddVersionRequestForeSameSource=Operacja FORE nie jest obs\u0142ugiwana, je\u015bli przodek i \u017ar\u00f3d\u0142o s\u0105 takie same.
NonLinearVersioning.Error.AddVersionRequestSpinOffDup=Nie mo\u017cna \u0142\u0105czy\u0107 SPIN-OFF z DUPLIKATEM w liniowym trybie poprawki.
NonLinearVersioning.Error.AddVersionRequestSameItemSemantic=Wszystkie intencje semantyczne musz\u0105 pochodzi\u0107 z tego samego elementu.
NonLinearVersioning.Error.AddVersionRequestSemanticOneMax=Dozwolona jest tylko jedna taka intencja semantyczna z tej poprawce!
NonLinearVersioning.Error.AddVersionRequestDistinctItemSpinOff=SPIN-OFF nale\u017cy wykonywa\u0107 na oddzielnych elementach!
NonLinearVersioning.Error.AddVersionRequestBadIntegrateOrSpinOff=Nieprawid\u0142owe warunki wst\u0119pne dla operacji INTEGROWANIA/SPINOFF.
NonLinearVersioning.Error.AddVersionRequestEvolutionOnly=Podana operacja $1. nie jest autoryzowana dla tego typu obiektu.
NonLinearVersioning.Error.AddVersionRequestEvolutionOneMax=Dla tego typu obiektu dozwolona jest tylko jedna EWOLUCJA.
NonLinearVersioning.Error.AddVersionRequestIntentIgnore=Intencja $1. nie jest obs\u0142ugiwana przez ten typ obiektu i zostanie zignorowana.
NonLinearVersioning.Error.AddVersionRequestMinorForbidden=Poprawka podrz\u0119dna jest nieprawid\u0142owa dla tego typu.
NonLinearVersioning.Error.AddVersionRequestNewAuthorizeOnlySpinOff=Z NOWYM \u017c\u0105daniem dodania poprawki autoryzowany jest tylko SPIN-OFF!
NonLinearVersioning.Error.AddVersionRequestOnMinorExclusive=Dodatkowa poprawka podrz\u0119dna jest wy\u0142\u0105czna. Nie autoryzowano \u017cadnej innej intencji semantycznej poprawki!
NonLinearVersioning.Error.AddVersionRequestMIBNew=NOWA operacja nie jest obs\u0142ugiwana na danych MIB.
NonLinearVersioning.Error.RequestWithMutuallyExclusiveIntents=\u017b\u0105danie definiuje wzajemnie wykluczaj\u0105ce si\u0119 intencje semantyczne poprawki:\n $1..
NonLinearVersioning.Error.AddVersionRequestSingleIntegrate=ZINTEGRUJ nie mo\u017ce by\u0107 g\u0142\u00f3wn\u0105 intencj\u0105 semantyczn\u0105 poprawki!
NonLinearVersioning.Error.AddVersionRequestSingleSpinoff=SPIN-OFF nie mo\u017ce by\u0107 nadrz\u0119dn\u0105 intencj\u0105 semantyczn\u0105 poprawki!
NonLinearVersioning.Error.AddVersionInvalidNameProposal=Dodaj proponowany ci\u0105g zestawu \u017c\u0105da\u0144 poprawek <$1.> jako nazw\u0119 zawieraj\u0105c\u0105 niedozwolone znaki!
NonLinearVersioning.Error.AddVersionInvalidCodeProposal=Dodaj proponowany ci\u0105g zestawu \u017c\u0105da\u0144 poprawek <$1.> jako numer poprawki zawieraj\u0105cy niedozwolone znaki!
NonLinearVersioning.Error.AddVersionPreprocess=B\u0142\u0105d podczas przetwarzania dodawania poprawek!
NonLinearVersioning.Error.AddVersionPostProcessInsertOnFamily=Obiekt o tej wersji ju\u017c istnieje w tej rodzinie.
NonLinearVersioning.Error.AddVersionPostprocessNoPreprocess=Najpierw skontaktuj si\u0119 z procesem wst\u0119pnym!
NonLinearVersioning.Error.AddVersionPostprocessNoNewVersion=Nie zdefiniowano nowego identyfikatora poprawki!
NonLinearVersioning.Error.AddVersionError=Co najmniej jeden b\u0142\u0105d podczas przetwarzania tworzenia poprawek.
NonLinearVersioning.Error.NoRequiredAccess=By\u0107 mo\u017ce obiekt zosta\u0142 usuni\u0119ty lub nie masz ju\u017c wymaganych uprawnie\u0144 dost\u0119pu
NonLinearVersioning.Error.IncompleteObjectCreationDefinition=Tworzenie obiektu wymaga definicji \u201e$1.\u201d.
NonLinearVersioning.Error.OperationNotPossibleType=Ta operacja nie jest dost\u0119pna dla tego typu obiektu.
NonLinearVersioning.Error.OperationMultipleOrigin=Dla tej samej rodziny poprawek zdefiniowano pochodzenie wielu poprawek.
NonLinearVersioning.Error.OperationNotSameItem=Intencje semantyczne pomi\u0119dzy poprawkami z oddzielnych element\u00f3w nie s\u0105 dozwolone.
NonLinearVersioning.Error.SeveralVersionsCandidate=Kilka poprawek jest kandydatami do bycia ostatnim z ga\u0142\u0119zi.
NonLinearVersioning.Error.OperationCycle=Cykle na wykresie poprawki intencji semantycznej nie s\u0105 dozwolone!
NonLinearVersioning.Error.OperationMultipleCopy=Poprawka mo\u017ce by\u0107 kopi\u0105 tylko jednej innej poprawki.
NonLinearVersioning.Error.GraphNotLoaded=Nie mo\u017cna za\u0142adowa\u0107 wykresu.
NonLinearVersioning.Error.PushContext=B\u0142\u0105d podczas przesy\u0142ania kontekstu.
NonLinearVersioning.Error.PopContext=B\u0142\u0105d podczas podawania kontekstu.
NonLinearVersioning.Error.ConstructorPID=Nale\u017cy u\u017cy\u0107 fizycznego identyfikatora!
NonLinearVersioning.Error.JSONFormatUnexpected=Wej\u015bcie JSON nie ma prawid\u0142owego formatu!
NonLinearVersioning.Error.JSONMissingKey=Brakuj\u0105cy klucz wej\u015bcia JSON: $1..
NonLinearVersioning.Error.JSONNoRequestDefined=Brak \u017c\u0105dania zdefiniowanego w wej\u015bciu JSON (klucz: $1.).
NonLinearVersioning.Error.JSONInvalidValue=Nieprawid\u0142owa warto\u015b\u0107 wej\u015bciowa \u201e$2.\u201d w przypadku w\u0142a\u015bciwo\u015bci JSON \u201e$1.\u201d.
NonLinearVersioning.Error.JSONMaxHigherOrEqualToMin=Maksymalny rozmiar \u201e$1.\u201d musi by\u0107 wy\u017csza lub r\u00f3wna minimalnemu rozmiarowi \u201e$1.\u201d.
NonLinearVersioning.Error.JSONInvalidType=Nieprawid\u0142owy typ warto\u015bci wej\u015bciowej \u201e$2.\u201d w przypadku w\u0142a\u015bciwo\u015bci JSON \u201e$1.\u201d.
NonLinearVersioning.Error.JSONOnlyOneKey=Dane wej\u015bciowe zawieraj\u0105 wi\u0119cej ni\u017c jeden obiekt $1. JSON.
NonLinearVersioning.Error.JSONInvalidVersion=Nieobs\u0142ugiwana poprawka JSON: $1..
NonLinearVersioning.Error.JSONUnknownIntent=Intencja semantyczna poprawki w JSON nie jest rozpoznawana: $1..
NonLinearVersioning.Error.JSONUnknownBlock=Nieznany blok numeru poprawki (nale\u017cy wybra\u0107 w grupie, podstawowej, sekwencyjnej lub wt\u00f3rnej)
NonLinearVersioning.Error.notValidVersionNumberRule=Generator skryptu o nieprawid\u0142owym numerze poprawki
NonLinearVersioning.Error.InvalidInputRevisionNumber=Numer poprawki wej\u015bciowej $1. nie jest zgodny z zarz\u0105dzaniem obiektami (patrz Zasada $2.).
NonLinearVersioning.Error.UnknownPredicateName=Predykat $1. nie znajduje si\u0119 na li\u015bcie dost\u0119pnych.
NonLinearVersioning.Error.UnknownGeneratorName=Generator kodu $1. nie znajduje si\u0119 na li\u015bcie dost\u0119pnych.
NonLinearVersioning.Error.NotVersionNumberRules=Generator numeru poprawki nie jest zdefiniowany dla semantycznej intencji $1..
NonLinearVersioning.Error.OneSourceAtOnce=Tylko jedna kopia ze \u017ar\u00f3d\u0142a na raz!
NonLinearVersioning.Error.Query=Nie uda\u0142o si\u0119 wys\u0142a\u0107 zapytania do bazy danych.
NonLinearVersioning.Error.SOVCarryOver=Nie uda\u0142o si\u0119 zaktualizowa\u0107 w\u0142asno\u015bci wektora dodatkowego: $1..
NonLinearVersioning.Error.POVCarryOver=Nie uda\u0142o si\u0119 zaktualizowa\u0107 w\u0142asno\u015bci wektora g\u0142\u00f3wnego: $1..
NonLinearVersioning.Error.QueryExchangeStatus=Nie mo\u017cna wys\u0142a\u0107 zapytania do bazy danych o status wymiany.
NonLinearVersioning.Error.TransactionReport=Nie mo\u017cna uzyska\u0107 dost\u0119pu do statusu raportu transakcji.
NonLinearVersioning.Error.QueryRevision=Nie mo\u017cna wys\u0142a\u0107 zapytania do bazy danych poprawek.
NonLinearVersioning.Error.QueryFamily=Nie mo\u017cna wys\u0142a\u0107 zapytania do bazy danych o identyfikator rodziny.
NonLinearVersioning.Error.QuerySiteName=Nie mo\u017cna wys\u0142a\u0107 zapytania do bazy danych o nazw\u0119 zak\u0142adu.
NonLinearVersioning.Error.QueryVersionAttrs=Nie mo\u017cna wys\u0142a\u0107 zapytania do bazy danych o atrybuty poprawek.
NonLinearVersioning.Error.QuerySemantics=Nie mo\u017cna wys\u0142a\u0107 zapytania do bazy danych o kraw\u0119dzie intencji semantycznej.
NonLinearVersioning.Error.QueryAccessSequence=Nie mo\u017cna uzyska\u0107 dost\u0119pu do sekwencji poprawek u\u017cywanej do inicjalizacji.
NonLinearVersioning.Error.VersionAccessPreviousRevision=Nie mo\u017cna uzyska\u0107 dost\u0119pu do poprzedniej poprawki.
NonLinearVersioning.Error.QueryAttributes=Nie mo\u017cna odczyta\u0107 atrybut\u00f3w obiektu.
NonLinearVersioning.Error.isConfiguredAsEvolution=Nie mo\u017cna sprawdzi\u0107, czy obiekt jest skonfigurowany w Evolution: $1..
NonLinearVersioning.Error.QueryExists=Nie mo\u017cna uzyska\u0107 dost\u0119pu do obiektu. Czy istnieje?
NonLinearVersioning.Error.NotAccessible=Obiekt niedost\u0119pny ($1.)?
NonLinearVersioning.Error.QueryAttributeInformation=Nie mo\u017cna uzyska\u0107 dost\u0119pu do informacji o atrybucie $1..
NonLinearVersioning.Error.NoAccessToChangeInfo=Nie mo\u017cna uzyska\u0107 dost\u0119pu do informacji o akcji zmiany dla $1..
NonLinearVersioning.Error.GetInterface=Nie mo\u017cna uzyska\u0107 dost\u0119pu do $1. na obiekcie.
NonLinearVersioning.Error.SetInterface=Nie mo\u017cna ustawi\u0107 $1. na obiekcie.
NonLinearVersioning.Error.ResetInterface=Nie mo\u017cna zresetowa\u0107 $1. na obiekcie.
NonLinearVersioning.Error.QueryIndexPolicy=Nie mo\u017cna uzyska\u0107 dost\u0119pu do $1. $2.
NonLinearVersioning.Error.NonMIBPolicy=Utworzenie danych nie powiod\u0142o si\u0119, poniewa\u017c zasada $1. nie jest zasad\u0105 MIB.
NonLinearVersioning.Error.QueryExpression=Nie mo\u017cna uzyska\u0107 dost\u0119pu do wyra\u017cenia na obiekcie.
NonLinearVersioning.Error.InvokeClass=Nie znaleziono klasy podczas wywo\u0142ywania.
NonLinearVersioning.Error.InvokeInstantiate=Nie mo\u017cna utworzy\u0107 wyst\u0105pienia podczas wywo\u0142ania.
NonLinearVersioning.Error.InvokeAccess=Nielegalny dost\u0119p podczas wywo\u0142ywania.
NonLinearVersioning.Error.InvokeSecurity=Problem z bezpiecze\u0144stwem podczas wywo\u0142ywania.
NonLinearVersioning.Error.InvokeMethod=Nie ma takiej metody podczas wywo\u0142ywania.
NonLinearVersioning.Error.InvokeTarget=B\u0142\u0105d docelowy podczas wywo\u0142ywania.
NonLinearVersioning.Error.ReviseFromNotAuthorized=Nie uda\u0142o si\u0119 dokona\u0107 korekty z czego\u015b, co nie znajduje si\u0119 w bie\u017c\u0105cej rodzinie poprawek.
NonLinearVersioning.Error.IsLastCheck=Nie mo\u017cna sprawdzi\u0107, czy obiekt jest ostatni\u0105 wersj\u0105.
NonLinearVersioning.Error.ReviseIntoForbidden=Poprawka od innej ni\u017c ostatnia nie jest dozwolona dla obiektu $1..
NonLinearVersioning.Error.ReviseFromNotLast=Obiekt $1. jest ju\u017c poprawiony.
NonLinearVersioning.Error.ReviseMajor=Utworzenie nowej poprawki nie jest dozwolone dla tego stanu dojrza\u0142o\u015bci!
NonLinearVersioning.Error.ReviseMinor=Utworzenie nowej poprawki podrz\u0119dnej nie jest dozwolone dla tego stanu dojrza\u0142o\u015bci!
NonLinearVersioning.Error.NoReviseAccess=Korekta nie jest obecnie mo\u017cliwa. Mo\u017cliwa przyczyna i rozwi\u0105zanie: u\u017cytkownik mo\u017ce nie mie\u0107 wymaganej roli dost\u0119pu do korekty tego obiektu w docelowej przestrzeni wsp\u00f3\u0142pracy. Nale\u017cy sprawdzi\u0107 rol\u0119 dost\u0119pu okre\u015blon\u0105 w bie\u017c\u0105cych po\u015bwiadczeniach u\u017cytkownika lub wybra\u0107 inne po\u015bwiadczenia. Wi\u0119cej informacji na temat wymaganych r\u00f3l dost\u0119pu dla tej operacji mo\u017cna znale\u017a\u0107 na stronie Dost\u0119p do zawarto\u015bci w przewodniku u\u017cytkownika aplikacji.
NonLinearVersioning.Error.NoReviseOnDistantData=Korekta nie jest mo\u017cliwa w przypadku danych b\u0119d\u0105cych w\u0142asno\u015bci\u0105 innej witryny (dane odleg\u0142e).
NonLinearVersioning.Error.NoReviseAccessDueToMaturityState=Korekta nie jest obecnie mo\u017cliwa, ostatnia poprawka tego $1. jest w stanie dojrza\u0142o\u015bci $2., natomiast jej oczekiwany stan to przynajmniej ZWOLNIONY.
NonLinearVersioning.Error.LastERMinor=Ostatnia operacja nie jest obs\u0142ugiwana na indeksowanym obiekcie tylko podrz\u0119dnym.
NonLinearVersioning.Error.MakeClone=Nie mo\u017cna skorygowa\u0107 lub zduplikowa\u0107.
NonLinearVersioning.Error.MakeCloneParam=Nie mo\u017cna skorygowa\u0107 lub zduplikowa\u0107 obiektu $1..
NonLinearVersioning.Error.MakeCloneRevisionFormat=Oczekiwany format poprawki to $1..
NonLinearVersioning.Error.MakeCloneMultipleDelimiters=Oczekiwano pojedynczego ogranicznika w formacie poprawki.
NonLinearVersioning.Error.MakeReadAccess=Ta zawarto\u015b\u0107 nie jest ju\u017c dost\u0119pna. By\u0107 mo\u017ce obiekt zosta\u0142 usuni\u0119ty lub nie masz ju\u017c wymaganych uprawnie\u0144 dost\u0119pu
NonLinearVersioning.Error.DontExist=Ta zawarto\u015b\u0107 nie jest ju\u017c dost\u0119pna. By\u0107 mo\u017ce obiekt zosta\u0142 usuni\u0119ty.
NonLinearVersioning.Error.MakeCloneAccess=Mo\u017cliwa przyczyna i rozwi\u0105zanie: u\u017cytkownik mo\u017ce nie posiada\u0107 wymaganego zakresu odpowiedzialno\u015bci, aby m\u00f3c utworzy\u0107 ten obiekt w docelowej przestrzeni wsp\u00f3\u0142pracy. Sprawd\u017a rol\u0119 dost\u0119pu okre\u015blon\u0105 w bie\u017c\u0105cych po\u015bwiadczeniach lub wybierz inne po\u015bwiadczenia. Aby uzyska\u0107 wi\u0119cej informacji na temat wymaganych r\u00f3l dost\u0119pu dla tej operacji, zobacz stron\u0119 Dost\u0119p do zawarto\u015bci w instrukcji u\u017cytkownika aplikacji.
NonLinearVersioning.Error.AccessRights=Niekt\u00f3re obiekty nie s\u0105 dost\u0119pne dla bie\u017c\u0105cego u\u017cytkownika. Mo\u017cliwa przyczyna i rozwi\u0105zanie: u\u017cytkownik mo\u017ce nie posiada\u0107 wymaganej roli dost\u0119pu do utworzenia tego obiektu w docelowej przestrzeni wsp\u00f3\u0142pracy. Sprawd\u017a rol\u0119 dost\u0119pu okre\u015blon\u0105 w bie\u017c\u0105cych po\u015bwiadczeniach lub wybierz inne po\u015bwiadczenia. Aby uzyska\u0107 wi\u0119cej informacji na temat wymaganych r\u00f3l dost\u0119pu dla tej operacji, zobacz stron\u0119 Dost\u0119p do zawarto\u015bci w instrukcji u\u017cytkownika aplikacji.
NonLinearVersioning.Error.InsufficientAccessRights=Aby mo\u017cna by\u0142o wykona\u0107 to dzia\u0142anie, u\u017cytkownik <$1> musi mie\u0107 uprawnienia administratora.
NonLinearVersioning.Error.MakeDuplicateAccess=Niekt\u00f3re obiekty nie s\u0105 dost\u0119pne dla bie\u017c\u0105cego u\u017cytkownika. Mo\u017cliwa przyczyna i rozwi\u0105zanie: u\u017cytkownik mo\u017ce nie posiada\u0107 wymaganej roli dost\u0119pu do utworzenia tego obiektu w docelowej przestrzeni wsp\u00f3\u0142pracy. Sprawd\u017a rol\u0119 dost\u0119pu okre\u015blon\u0105 w bie\u017c\u0105cych po\u015bwiadczeniach lub wybierz inne po\u015bwiadczenia. Aby uzyska\u0107 wi\u0119cej informacji na temat wymaganych r\u00f3l dost\u0119pu dla tej operacji, zobacz stron\u0119 Dost\u0119p do zawarto\u015bci w instrukcji u\u017cytkownika aplikacji.
NonLinearVersioning.Error.MakeDeleteParam=Nie mo\u017cna usun\u0105\u0107 obiektu $1..
NonLinearVersioning.Error.BatchReviseParam=Nie uda\u0142o si\u0119 dokona\u0107 korekty z powodu jednego z tych obiekt\u00f3w: $1..
NonLinearVersioning.Error.BatchDeleteParam=Nie uda\u0142o si\u0119 usun\u0105\u0107 z powodu jednego z tych obiekt\u00f3w: $1..
NonLinearVersioning.Error.UpdateMaturity=Nie uda\u0142o si\u0119 ustali\u0107 dojrza\u0142o\u015bci na $1. dla korekty/klonowania obiektu.
NonLinearVersioning.Error.UpdateStamp=Nie mo\u017cna ustawi\u0107 znaczka aktualizacji na $1. dla korekty/klonowania obiektu.
NonLinearVersioning.Error.ResetConfiguration=Nie uda\u0142o si\u0119 zresetowa\u0107 informacji o konfiguracji po operacji poprawki/klonowania: $1..
NonLinearVersioning.Error.CleanConfiguration=Nie mo\u017cna duplikowa\u0107, poniewa\u017c co najmniej jedna instancja znajduje si\u0119 w ramach akcji zmiany.
NonLinearVersioning.Error.BusinessLogicValidationFailed=Operacja zosta\u0142a odrzucona przez kontrole logiki biznesowej.
NonLinearVersioning.Error.DerivationNodeParametesr=Nie uda\u0142o si\u0119 odczyta\u0107 w\u0142a\u015bciwo\u015bci parametr\u00f3w w\u0119z\u0142a wyprowadzania w produkcie.
NonLinearVersioning.Error.HandlerEmptyPolicy=Nie zdefiniowano zasady.
NonLinearVersioning.Error.HandlerUndefined=Nie mo\u017cna znale\u017a\u0107 odpowiedniego modu\u0142u obs\u0142ugi dla obiektu(-\u00f3w): $1..
NonLinearVersioning.Error.MigrationDistant=Wersja Migracja wykresu nie jest autoryzowana w tej witrynie: pierwsza wersja jest uwa\u017cana za odleg\u0142\u0105.
NonLinearVersioning.Error.MigrationPresent=Wersja Migracja wykresu nie jest autoryzowana w tej witrynie: brak pierwszej wersji, a niekt\u00f3re wersje s\u0105 uwa\u017cane za odleg\u0142e.
NonLinearVersioning.Error.PidFormat=Nieprawid\u0142owy format identyfikatora fizycznego $1. w \u017c\u0105daniu $2. (klucz: $3.).
NonLinearVersioning.Error.VidFormat=Format VID jest nieprawid\u0142owy.
NonLinearVersioning.Error.expectedObjectId=Oczekiwany identyfikator obiektu, kt\u00f3ry nie obs\u0142uguje zarz\u0105dzania iteracj\u0105: $1. w \u017c\u0105daniu $2. (klucz: $3.).
NonLinearVersioning.Error.expectedBranchId=Oczekiwany obiekt w kontek\u015bcie iteracji: $1. w \u017c\u0105daniu $2. (klucz: $3.).
NonLinearVersioning.Error.expectedInvaliId=Brak prawid\u0142owego identyfikatora formatu w tym kontek\u015bcie $1. w \u017c\u0105daniu $2. (klucz: $3.).
NonLinearVersioning.Error.CorruptedMultipleCopies=Uszkodzenie danych: poprawka nie mo\u017ce by\u0107 kopi\u0105 wielu innych.
NonLinearVersioning.Error.CommitFailed=Operacja zapisania nie powiod\u0142a si\u0119.
NonLinearVersioning.Error.RevisionSequence.NotDefined=Nie zdefiniowano sekwencji poprawek.
NonLinearVersioning.Error.RevisionSequence.InvalidSequenceDefinition=Sekwencja poprawek <$1.> nie jest prawid\u0142owa.
NonLinearVersioning.Error.RevisionSequence.LettersInRangeWithSameCase=Zakres znak\u00f3w zdefiniowany w sekwencji poprawki musi zawiera\u0107 t\u0119 sam\u0105 wielko\u015b\u0107 liter.
NonLinearVersioning.Error.RevisionSequence.LettersInRangeAreNotOdered=Zakres znak\u00f3w okre\u015blony w sekwencji poprawki musi by\u0107 odpowiednio uporz\u0105dkowany.
NonLinearVersioning.Error.RevisionSequence.PaddingIsOneSinglCharacter=Nieprawid\u0142owa definicja dope\u0142nienia <$2.>, musi by\u0107 unikalnym znakiem (zmodyfikuj w\u0142a\u015bciwo\u015b\u0107 $1.).
NonLinearVersioning.Error.RevisionSequence.InitContainsBlank=Nieprawid\u0142owa definicja sekwencji inicjalizacji \u2014 nie mo\u017ce zawiera\u0107 pustych warto\u015bci.
NonLinearVersioning.Error.RevisionSequence.onlyLetterInSequence=Sekwencja poprawek zawiera nieprawid\u0142owe znaki.
NonLinearVersioning.Error.RevisionSequence.AlreadyDefined=Ju\u017c istnieje jedna sekwencja poprawek o nazwie \u201e$1.\u201d.
NonLinearVersioning.Error.RevisionSequence.NotDeclared=Nie istnieje sekwencja poprawek o nazwie \u201e$1.\u201d.
NonLinearVersioning.Error.RevisionSequence.EditForbidden=Sekwencja poprawki DS o nazwie \u201e$1\u201d. mog\u0142a zosta\u0107 zmodyfikowana.
NonLinearVersioning.Error.RevisionSequence.NotCompatible=Definicja sekwencji poprawki wej\u015bciowej nie jest zgodna z sekwencj\u0105 poprawki o nazwie \u201e$1.\u201d, a tym samym aktualizacja jest zabroniona.
NonLinearVersioning.Error.RevisionSequence.MaximumSequenceSize=Maksymalna d\u0142ugo\u015b\u0107 rozszerzonej sekwencji poprawek \u201e$1.\u201d wynosi \u201e$2.\u201d.
NonLinearVersioning.Error.RevisionSequence.LastSequenceReached=Osi\u0105gni\u0119to ostatni\u0105 sekwencj\u0119 rozszerzonej sekwencji poprawek \u201e$1.\u201d.
NonLinearVersioning.Error.RevisionSequence.ForbiddenSequence=Rozszerzona sekwencja poprawek zawiera nast\u0119puj\u0105cy znak <$1.>, kt\u00f3ry jest zabroniony.
NonLinearVersioning.Error.RevisionSequenceStillAssociated=Nie mo\u017cna usun\u0105\u0107 ani zaktualizowa\u0107 rozszerzonej sekwencji poprawek. Mo\u017cliwa przyczyna i rozwi\u0105zanie: niekt\u00f3re rozszerzone sekwencje poprawek s\u0105 nadal powi\u0105zane z typami obiekt\u00f3w
NonLinearVersioning.Error.RevisionSequence.RevisionSequenceStillUsedAsAlternate=Nie mo\u017cna usun\u0105\u0107 rozszerzonej sekwencji poprawek. Mo\u017cliwa przyczyna i rozwi\u0105zanie: niekt\u00f3re rozszerzone sekwencje poprawek s\u0105 nadal u\u017cywane jako alternatywne sekwencje w rozszerzonej logice (rozszerzonych logikach) poprawek
NonLinearVersioning.Error.rerouteAfterCloning=Co najmniej jedna operacja zmiany trasy po nieudanych operacjach korekty/duplikowania uleg\u0142a uszkodzeniu.
NonLinearVersioning.Error.NoAccessToRelationship=Nie mo\u017cna utworzy\u0107 kwerendy relacyjnej bazy danych podczas operacji zmiany trasy po operacji korekty/duplikowania.
NonLinearVersioning.Error.NoAccessToPath=Nie mo\u017cna utworzy\u0107 kwerendy \u015bcie\u017cki bazy danych podczas operacji zmiany trasy po operacji korekty/duplikowania.
NonLinearVersioning.Error.UpdatePathFailed=Nie mo\u017cna zaktualizowa\u0107 \u015bcie\u017cek podczas operacji scalania/klonowania.
NonLinearVersioning.Error.AddVersionError=Niepowodzenie podczas wywo\u0142ania logiki biznesowej inicjalizacji. 
NonLinearVersioning.Error.Completion=Niepowodzenie podczas wywo\u0142ywania funkcji Koryguj, Duplikuj lub Usu\u0144 logik\u0119 biznesow\u0105 uko\u0144czenia z powodu $1.. 
NonLinearVersioning.Error.Dedicated=B\u0142\u0105d podczas uruchamiania operacji aplikacji (szczeg\u00f3\u0142owe informacje: $1.).
NonLinearVersioning.Error.DocumentType=Nie mo\u017cna sprawdzi\u0107 typu dokumentu.
NonLinearVersioning.Error.CESTAMPCheck=Obiekt zosta\u0142 zmodyfikowany przez innego u\u017cytkownika od momentu jego otwarcia.
NonLinearVersioning.Error.ResetDerivedFrom=Nie mo\u017cna od\u0142\u0105czy\u0107 nowej poprawki od poprzedniej rodziny podczas operacji powielania.
NonLinearVersioning.Error.ReadDerivedFrom=Nie mo\u017cna odczyta\u0107 warto\u015bci \u201eWyprowadzonej z\u201d.
NonLinearVersioning.Error.TwoEvolutionOnSameAncestor=Tworzenie nowej poprawki nie jest autoryzowane, poniewa\u017c co najmniej 2 poprawki nale\u017c\u0105 do tej samej ga\u0142\u0119zi: $1..
NonLinearVersioning.Error.AccessVersionNumberGenerator=Nie mo\u017cna uzyska\u0107 dost\u0119pu do ustawienia w stosunku do trybu generatora poprawek: $1..
NonLinearVersioning.Error.BomSynchronizeForbidEditIntent=Edycja wykresu poprawek jest zabroniona dla obiekt\u00f3w bior\u0105cych udzia\u0142 w synchronizacji EBOM.
NonLinearVersioning.Error.ReadAttribute=Nie mo\u017cna odczyta\u0107 atrybutu $1..
NonLinearVersioning.Error.ReadTitle=Nie mo\u017cna odczyta\u0107 tytu\u0142u.
NonLinearVersioning.Error.UnavailableProductIntent=Niedost\u0119pna intencja dla tego produktu.
NonLinearVersioning.Error.OnlyOneProductIntent=Produkt obs\u0142uguje tylko jeden cel.
NonLinearVersioning.Error.DerivativeAfterFix=Pochodna po naprawieniu nie jest mo\u017cliwa dla produkt\u00f3w lub plan\u00f3w produkcyjnych.
NonLinearVersioning.Error.EvolutionFromNotLast=Ewolucja jest obs\u0142ugiwana tylko w przypadku najnowszej wersji produktu.
NonLinearVersioning.Error.UnableReadData=Nie mo\u017cna odczyta\u0107 danych z bazy danych.
NonLinearVersioning.Error.UnableWriteData=Nie mo\u017cna zapisa\u0107 danych w bazie danych.
NonLinearVersioning.Error.UnableToSetInformation=Nie mo\u017cna zaktualizowa\u0107 informacji do bazy danych\n(dodatkowe informacje: $1.).
NonLinearVersioning.Error.UnableSetData=Nie mo\u017cna ustawi\u0107 danych w bazie danych.
NonLinearVersioning.Error.TNR=Nie mo\u017cna utworzy\u0107 nowego obiektu $1., poniewa\u017c inny obiekt ju\u017c istnieje z tym samym identyfikatorem.
NonLinearVersioning.Error.RequestSameTNR=\u017b\u0105danie wielu poprawek z tym samym identyfikatorem $1..
NonLinearVersioning.Error.NoVirtualItem=Oczekiwany element fizyczny.
NonLinearVersioning.Error.UnexpectedMigration=Nieoczekiwane utworzenie elementu fizycznego.
NonLinearVersioning.Error.AddVersionRequestNotAuthorizedIntent=\u017b\u0105danie dodania poprawki jest u\u017cywane przez nieautoryzowanego operatora: $1..
NonLinearVersioning.Error.AddVersionRequestOnlyOneIntentAuthorized=Dla tego typu obiektu obs\u0142ugiwany jest tylko jeden operator dodawania wersji na \u017c\u0105danie.
NonLinearVersioning.Error.FirstOnlyOnceForConfiguredTime=Co najmniej jedna skonfigurowana poprawka zosta\u0142a ju\u017c utworzona na $1. $2..
NonLinearVersioning.Error.ConfiguredRevisionNotAuthorized=Utworzenie skonfigurowanej poprawki nie jest jeszcze dost\u0119pne dla $1. $2..
NonLinearVersioning.Error.MissingJsonHttpInput=\u017b\u0105danie HTTP nie dostarcza wej\u015bcia JSON.
NonLinearVersioning.Error.MissingObjectHttpInput=\u017b\u0105danie HTTP nie dostarcza obiektu wej\u015bciowego.
NonLinearVersioning.Error.InvalidHttpContext=Nie mo\u017cna otworzy\u0107 sesji!
NonLinearVersioning.Error.InvalidOutputFormat=Oczekiwano zwrotu komunikatu wyj\u015bciowego $1., kt\u00f3ry nie jest oczekiwany przez sid klienta.
NonLinearVersioning.Error.ForbiddenAttributeUpdate=Podstawowy atrybut $1. (o warto\u015bci $2.) nie m\u00f3g\u0142 by\u0107 cz\u0119\u015bci\u0105 klauzuli aktualizacji.
NonLinearVersioning.Error.NoAccessToJpo=Brak dost\u0119pu do programu <$1.>
NonLinearVersioning.Error.InvalidDatabaseAccess=Brak dost\u0119pu do informacji o bazie danych <$1.>
NonLinearVersioning.Error.GlobalAuthoringOptionOnly=Globalna opcja autorska $1. jest ustawiona jako opcja na poziomie \u017c\u0105dania.
NonLinearVersioning.Error.InvalidIntent=Operacja $1. nie jest autoryzowana dla tego typu obiekt\u00f3w.
NonLinearVersioning.Error.NotAuthorizedAddVersion=Utworzenie poprawki typu $1. wymaga specjalnych licencji do autoryzowanego $2..
NonLinearVersioning.Error.UnableToCreateModuleBranch=Nie mo\u017cna utworzy\u0107 modu\u0142u $1 ga\u0142\u0119zi $2
NonLinearVersioning.Error.AuthoringOptionOnRevise=Opcja autora $1. jest wa\u017cna tylko dla nowej poprawki (nie dla Duplikuj ani Nowa ga\u0142\u0105\u017a).
NonLinearVersioning.Error.MQLCommandException=Wyj\u0105tek podczas wykonywania j\u0119zyka zapyta\u0144
NonLinearVersioning.Error.MQLCommandFailed=B\u0142\u0105d podczas wykonywania j\u0119zyka zapytania (szczeg\u00f3\u0142: $1.).
NonLinearVersioning.Error.TypeNameRevisionConflict=Typ unikatowo\u015bci, nazwa i poprawka s\u0105 sprzeczne z $1. $2. $3.
NonLinearVersioning.Error.UnknownEditIntentOperation=Tylko operacje DODAWANIA i USUWANIA s\u0105 prawid\u0142owe dla edycji wykresu wersji semantycznej
NonLinearVersioning.Error.MIBAddModule=Nie mo\u017cna utworzy\u0107 modu\u0142u. (dodatkowe informacje: $1.)
NonLinearVersioning.Error.MIBOnly=Us\u0142uga dost\u0119pna tylko dla MIB.
NonLinearVersioning.Error.ObjectDontExist=Obiekt nie istnieje. (dodatkowe informacje: $1.)
NonLinearVersioning.Error.Kernel.Undefined=B\u0142\u0105d podczas wykonywania polecenia j\u0105dra. (dodatkowe informacje: $1.)
NonLinearVersioning.Error.PolicyDontExist=Zasada $1. u\u017cywana do tworzenia danych nie istnieje.
NonLinearVersioning.Error.TypeDontExist=Typ $1. u\u017cywany do tworzenia danych nie istnieje.
NonLinearVersioning.Error.NoReflexiveSemanticEdge=Wersje przodk\u00f3w i nast\u0119pc\u00f3w w edycji wykresu wersji semantycznej musz\u0105 by\u0107 r\u00f3\u017cne.
NonLinearVersioning.Error.NoReflexiveComposition=Wersje ojca i dziecka w semantyce struktury kompozycji musi by\u0107 inna.
NonLinearVersioning.Error.NotComposedInFather=Wersja $1. nie jest zawarta w $2.
NonLinearVersioning.Error.CompositionRemovalFailed=Nie mo\u017cna usun\u0105\u0107 $1. jako elementu tworz\u0105cego z $2. (prawdopodobnie nie znaleziono w\u015br\u00f3d element\u00f3w tworz\u0105cych lub brak dost\u0119pu).
NonLinearVersioning.Error.CompositionAdditionFailed=Nie mo\u017cna wstawi\u0107 $1. jako nowego elementu tworz\u0105cego w $2.
NonLinearVersioning.Error.FormatOptionIgnored=Opcja formatu jest ignorowana jako znajduj\u0105ca si\u0119 w definicji \u017c\u0105dania
NonLinearVersioning.Error.RestoreSameResultingIteration=Wybrana iteracja do przywr\u00f3cenia jest identyczxna z bie\u017c\u0105c\u0105.
NonLinearVersioning.Error.RestoreIterationOutOfRange=Wybrana iteracja do przywr\u00f3cenia jest poza dost\u0119pnym zakresem iteracji.
NonLinearVersioning.Error.RevisionSequenceNotFound=Nie znaleziono sekwencji poprawek $1..
NonLinearVersioning.Error.RevisionLogicNotFound=Nie znaleziono logiki poprawek $1..
NonLinearVersioning.Error.RevisionLogic.NotDeclared=Nie istnieje logika poprawek o nazwie "$1.".
NonLinearVersioning.Error.RevisionLogic.NotDefined=Nie zdefiniowano logiki poprawek.
NonLinearVersioning.Error.RevisionLogic.InvalidJSON=Podczas tworzenia logiki poprawek z pliku JSON wyst\u0105pi\u0142 b\u0142\u0105d: brak atrybutu "$1.".
NonLinearVersioning.Error.UpdateRevisionSequence=Nie mo\u017cna ustawi\u0107 ani zresetowa\u0107 rozszerzonej sekwencji poprawek w $1. $2..
NonLinearVersioning.Error.UpdateRevisionLogic=Nie mo\u017cna ustawi\u0107 lub zresetowa\u0107 logiki rozszerzonych poprawek na $1. $2..
NonLinearVersioning.Error.PromoteNotAuthorized=Podniesienie poziomu do $1. nie jest autoryzowane przez tryb numeru wersji $2. w obiekcie $3..
NonLinearVersioning.Error.AddVersionNewBranchOneMax=Tylko jedna operacja nowej ga\u0142\u0119zi jest akceptowana, usu\u0144 bezu\u017cyteczn\u0105 operacj\u0119 $1..
NonLinearVersioning.Error.AddVersionNewRevisionOneMax=Tylko jedna operacja nowej poprawki jest akceptowana, usu\u0144 bezu\u017cyteczn\u0105 operacj\u0119 $1..
NonLinearVersioning.Error.AddVersionDuplicateOneMax=Tylko jedna operacja duplikowania jest akceptowana, usu\u0144 bezu\u017cyteczn\u0105 operacj\u0119 $1..
NonLinearVersioning.Error.AddVersionNewMinorRevisionOneMax=Tylko jedna operacja nowej poprawki podrz\u0119dnej jest akceptowana, usu\u0144 bezu\u017cyteczn\u0105 operacj\u0119 $1..
NonLinearVersioning.Error.AddVersionFirstRevisionOneMax=Tylko jedna operacja nowej poprawki pierwszej konfiguracji jest akceptowana, usu\u0144 bezu\u017cyteczn\u0105 operacj\u0119 $1..
NonLinearVersioning.Error.AddVersionNewRevisionAndNewBranchCompatibility=Operacja nowej poprawki nie jest zgodna z now\u0105 ga\u0142\u0119zi\u0105, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionNewRevisionAndDuplicateCompatibility=Operacja nowej poprawki nie jest zgodna z funkcj\u0105 Duplikuj, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionNewRevisionAndNewMinorRevisionOneMax=Operacji nowej poprawki nie jest zgodna z now\u0105 poprawk\u0105 podrz\u0119dn\u0105, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionNewRevisionAndFirstOneMax=Operacja nowej poprawki nie jest zgodna z utworzeniem pierwszej skonfigurowanej poprawki, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionNewBranchAndDuplicateCompatibility=Operacja nowej ga\u0142\u0119zi nie jest zgodna z funkcj\u0105 Duplikuj, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionNewBranchAndNewMinorRevisionOneMax=Operacja nowej ga\u0142\u0119zi nie jest zgodna z now\u0105 poprawk\u0105 podrz\u0119dn\u0105, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionNewRevisionAndFirstOneMax=Operacja nowej ga\u0142\u0119zi nie jest zgodna z utworzeniem pierwszej skonfigurowanej poprawki, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionDuplicateAndNewMinorRevisionOneMax=Operacja duplikowania nie jest zgodna z now\u0105 poprawk\u0105 podrz\u0119dn\u0105, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionDuplicateAndFirstOneMax=Zduplikowana operacja nie jest zgodna z utworzeniem pierwszej skonfigurowanej poprawki, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionSecondaryAndFirstOneMax=Operacja nowej poprawki podrz\u0119dnej nie jest zgodna z utworzeniem pierwszej skonfigurowanej poprawki, usu\u0144 niezgodne operacje.
NonLinearVersioning.Error.AddVersionNewReviseFromPolicyMissmatch=Obiekty referencyjne i \u017ar\u00f3d\u0142owe nie maj\u0105 tej samej zasady.
NonLinearVersioning.nls.ConfiguredRevision.type=Skonfigurowana poprawka
NonLinearVersioning.nls.ConfiguredRevision.license=Konfiguracja
NonLinearVersioning.Error.AssociatedRevisionSequence=Aby w $1. mo\u017cna by\u0142o skojarzy\u0107 sekwencj\u0119 poprawek $2., pod\u0142\u0105czony u\u017cytkownik <$3.> musi mie\u0107 uprawnienia administratora.
NonLinearVersioning.Error.ResetAssociatedRevisionSequence=Aby w $1. mo\u017cna by\u0142o od\u0142\u0105czy\u0107 sekwencj\u0119 poprawek, pod\u0142\u0105czony u\u017cytkownik <$3.> musi mie\u0107 uprawnienia administratora.
NonLinearVersioning.Error.EditRevisionSequence=Edycja sekwencji poprawek $1. wymaga\u0142a, aby pod\u0142\u0105czony u\u017cytkownik $2. mia\u0142 uprawnienia administratora.
NonLinearVersioning.Error.AssociatedRevisionLogic=Aby w $1. mo\u017cna by\u0142o skojarzy\u0107 logik\u0119 poprawek $2., pod\u0142\u0105czony u\u017cytkownik <$3.> musi mie\u0107 uprawnienia administratora.
NonLinearVersioning.Error.ResetAssociatedRevisionLogic=Aby w $1. mo\u017cna by\u0142o od\u0142\u0105czy\u0107 logik\u0119 poprawek, pod\u0142\u0105czony u\u017cytkownik <$3.> musi mie\u0107 uprawnienia administratora.
NonLinearVersioning.Error.EditRevisionLogic=Edycja logiki poprawek $1. wymaga\u0142a, aby pod\u0142\u0105czony u\u017cytkownik $2. mia\u0142 uprawnienia administratora.
NonLinearVersioning.Error.RevisionLogicStillAssociated=Nie mo\u017cna usun\u0105\u0107 rozszerzonej logiki poprawek. Mo\u017cliwa przyczyna i rozwi\u0105zanie: niekt\u00f3re rozszerzone logiki poprawek s\u0105 nadal skojarzone z typem (typami) obiektu (obiekt\u00f3w)
NonLinearVersioning.Error.VGStackActivationFailed=Nie mo\u017cna aktywowa\u0107 stosu wykresu poprawek.
NonLinearVersioning.Error.VGStackDeactivationFailed=Nie mo\u017cna dezaktywowa\u0107 stosu wykresu poprawek.
NonLinearVersioning.Error.UnableToCopyFiles=Nie mo\u017cna skopiowa\u0107 plik\u00f3w do nowego dokumentu.
NonLinearVersioning.Error.UnableToFigureVault=Nie mo\u017cna znale\u017a\u0107 przechowalni docelowej.
NonLinearVersioning.Error.DuplicateForbiddenSystemModel=Duplikat nie jest mo\u017cliwy w tym modelu systemowym.
NonLinearVersioning.Error.UncompliantCode=Wprowadzanie ci\u0105gu poprawek nie pasuje do ustawie\u0144 systemowych.
NonLinearVersioning.Error.TooLargeResultingOrder=Ci\u0105g poprawek wej\u015bciowych powoduje zbyt du\u017c\u0105 kolejno\u015b\u0107.
NonLinearVersioning.Error.BomControlled=Nie mo\u017cna utworzy\u0107 wersji tego elementu $1 $2 w sesji klienta. Utw\u00f3rz now\u0105 wersj\u0119 tego elementu przy u\u017cyciu tej samej sesji klienta, kt\u00f3rej u\u017cyto do utworzenia elementu.
NonLinearVersioning.Error.DuplicateForbiddenOnConfidentialData=Duplikat jest niedozwolony lub dane s\u0105 poufne.
NonLinearVersioning.Error.BranchForbiddenOnConfidentialData=Ga\u0142\u0105\u017a jest niedozwolona w poufnych danych.
NonLinearVersioning.Error.AttributeMaximumLength=Atrybut V_Name przekracza maksymaln\u0105 d\u0142ugo\u015b\u0107 100 znak\u00f3w.

#Merge errors
NonLinearVersioning.Error.MergeWorkUnderChange=Scalanie jest niedozwolone podczas pracy w warunkach kontroli zmian.
NonLinearVersioning.Error.MergeConfiguredObject=Scalanie jest niedozwolone, poniewa\u017c niekt\u00f3re obiekty s\u0105 skonfigurowane.
NonLinearVersioning.Error.MergeTypeNotAllowed=Scalanie jest dozwolone dla obiekt\u00f3w $1.
NonLinearVersioning.Error.MergePathNotAllowed=Scalanie jest niedozwolone dla obiekt\u00f3w ze \u015bcie\u017ckami $1.
NonLinearVersioning.Error.MergeSRNotAllowed=Scalanie jest niedozwolone dla obiektu maj\u0105cego \u015bcie\u017cki relacji semantycznej z rol\u0105 $1.
NonLinearVersioning.Error.MergeItfNotAllowed=Scalanie jest niedozwolone dla obiekt\u00f3w z interfejsami $1.
NonLinearVersioning.Error.MergeUsageIntegrity=$1 i $2 musz\u0105 mie\u0107 to samo zastosowanie.
NonLinearVersioning.Error.MergeVPLMControlledIntegrity=$1 musi mie\u0107 przypisan\u0105 kontrol\u0119 vplm
NonLinearVersioning.Error.MergeIsTerminalIntegrity=Obiekty terminala nie mog\u0105 mie\u0107 obiekt\u00f3w typu dziecko.
NonLinearVersioning.Error.MergeUsagePartIntegrity=Nie mo\u017cna usun\u0105\u0107 3DShape u\u017cywanego jako 3DPart.
NonLinearVersioning.Error.MergeUpdatestampIntegrity=Scalanie nie jest dozwolone dla starych danych.
NonLinearVersioning.Error.MergeMinorOrderIntegrity=Scalanie nie jest mo\u017cliwe w przypadku obiekt\u00f3w zarz\u0105dzanych przez zasad\u0119 podw\u00f3jnego indeksowania, kt\u00f3ra ma wi\u0119cej ni\u017c jedn\u0105 poprawk\u0119 pomocnicz\u0105.
NonLinearVersioning.Error.MergeDisciplineIntegrity=Scalanie jest dozwolone dla obiekt\u00f3w $1.
NonLinearVersioning.Error.MergeSetOnlyOnceIntegrity=Nie mo\u017cna zast\u0105pi\u0107 atrybutu $1, poniewa\u017c\u200b zosta\u0142 ju\u017c ustawiony z inn\u0105 warto\u015bci\u0105.
NonLinearVersioning.Error.MergeDelegateRelTo=Nie mo\u017cna zmieni\u0107 trasy delegowanej relacji do innego obiektu.
NonLinearVersioning.Error.MergeDelegateRelModelerExc=Podczas \u0142\u0105czenia $1 relacji wyst\u0105pi\u0142 b\u0142\u0105d: $2.
NonLinearVersioning.Error.MergeInputConsistency=Niesp\u00f3jne operacje scalania mi\u0119dzy $1 i $2.
NonLinearVersioning.Error.MergePostCheckKo=Niesp\u00f3jne stany danych po operacji scalania.

#xRevision
NonLinearVersioning.Error.AddVersionRequestNotAuthorizedOperationOnEffectivityBased=Dzia\u0142anie nie jest obs\u0142ugiwane w przypadku danych \u201eopartych na efektywno\u015bci\u201d.

#GraphSubset
NonLinearVersioning.Error.InvalidGraphSubsetMode=Dane wej\u015bciowe GraphSubset s\u0105 puste.

# Error message coming from IRs
# IR-1194448-3DEXPERIENCER2023x
NonLinearVersioning.Error.StudyNotAllowedOnConfiguredNode=Duplikat jako ga\u0142\u0105\u017a nie jest dozwolony na skonfigurowanym w\u0119\u017ale.
# IR-1299841-3DEXPERIENCER2025x
NonLinearVersioning.Error.FilterMustBeSetForPStudyOnConfiguredNode=Na skonfigurowanym w\u0119\u017ale nale\u017cy zastosowa\u0107 filtr w strukturze, aby umo\u017cliwi\u0107 u\u017cycie funkcji zaawansowana ga\u0142\u0105\u017a. Przed utworzeniem ga\u0142\u0119zi przy u\u017cyciu funkcji "Zaawansowana nowa ga\u0142\u0105\u017a" nale\u017cy zastosowa\u0107 filtr konfiguracji w strukturze.
NonLinearVersioning.Error.FilterMustBeSingleEvolution=Funkcja zaawansowana ga\u0142\u0105\u017a na skonfigurowanym w\u0119\u017ale jest dozwolona tylko wtedy, gdy filtr ma jedno kryterium ewolucji. U\u017cyj funkcji "Zaawansowana nowa ga\u0142\u0105\u017a", aby zastosowa\u0107 filtr konfiguracji zdefiniowany przy u\u017cyciu pojedynczej wersji modelu,
