#
#   Copyright (c) 1992-2020 Dassault Systemes.
#   All Rights Reserved.
#

# Parameterization
OOTBParameterization.LifecycleTopology.Workspace=\u041f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a
OOTBParameterization.LifecycleTopology.Workspace.Workspace=\u041a\u043e\u0440\u043d\u0435\u0432\u0430\u044f \u043f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a
OOTBParameterization.LifecycleTopology.Workspace.Workspace_Vault=\u041f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a

# Parameterization for BookmarkCreateInWork
#Domain
OOTBParameterization.BookmarkMdl=\u041f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a
OOTBParameterization.BookmarkMdl.tooltip=\u041f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0438\u0442\u044c \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0434\u043b\u044f \u043d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0438 \u043f\u043e\u0432\u0435\u0434\u0435\u043d\u0438\u044f \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a

#Family
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience=\u041d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0430 \u0438\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a

#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork=\u041f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435 \u0433\u043e\u0442\u043e\u0432\u043d\u043e\u0441\u0442\u0438 \u0412 \u0440\u0430\u0431\u043e\u0442\u0435
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.tooltip=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u044d\u0442\u043e\u0442 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0432 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438 \u0412 \u0440\u0430\u0431\u043e\u0442\u0435, \u043e\u0442\u043c\u0435\u043d\u0438\u0442\u0435 \u0432\u044b\u0431\u043e\u0440 \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0432 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438 \u0427\u0435\u0440\u043d\u043e\u0432\u0438\u043a
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument=\u041f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435 \u0433\u043e\u0442\u043e\u0432\u043d\u043e\u0441\u0442\u0438 \u0412 \u0440\u0430\u0431\u043e\u0442\u0435
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument.tooltip=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u044d\u0442\u043e\u0442 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0432 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438 \u0412 \u0440\u0430\u0431\u043e\u0442\u0435, \u043e\u0442\u043c\u0435\u043d\u0438\u0442\u0435 \u0432\u044b\u0431\u043e\u0440 \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0432 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438 \u0427\u0435\u0440\u043d\u043e\u0432\u0438\u043a


# Parameterization for BookmarkRootRestrictCreateToLeader
#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader=\u0420\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u044c \u0442\u043e\u043b\u044c\u043a\u043e \u0440\u0443\u043a\u043e\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u044f\u043c \u0441\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043f\u0435\u0440\u0432\u043e\u0433\u043e \u0443\u0440\u043e\u0432\u043d\u044f.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument=\u0420\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u044c \u0442\u043e\u043b\u044c\u043a\u043e \u0440\u0443\u043a\u043e\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u044f\u043c \u0441\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043f\u0435\u0440\u0432\u043e\u0433\u043e \u0443\u0440\u043e\u0432\u043d\u044f.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument.tooltip=\u0415\u0441\u043b\u0438 \u044d\u0442\u043e\u0442 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0432\u043a\u043b\u044e\u0447\u0435\u043d, \u0442\u043e\u043b\u044c\u043a\u043e \u0440\u0443\u043a\u043e\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u0438 \u043c\u043e\u0433\u0443\u0442 \u0441\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043f\u0435\u0440\u0432\u043e\u0433\u043e \u0443\u0440\u043e\u0432\u043d\u044f (\u043a\u043e\u0440\u043d\u0435\u0432\u044b\u0435 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a). \u0415\u0441\u043b\u0438 \u044d\u0442\u043e\u0442 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0432\u044b\u043a\u043b\u044e\u0447\u0435\u043d, \u0441\u043e\u0430\u0432\u0442\u043e\u0440\u044b, \u0430\u0432\u0442\u043e\u0440\u044b \u0438 \u0440\u0443\u043a\u043e\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u0438 \u043c\u043e\u0433\u0443\u0442 \u0441\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043f\u0435\u0440\u0432\u043e\u0433\u043e \u0443\u0440\u043e\u0432\u043d\u044f.


#Error message
WorkspaceMdl.ObjectAccess.NoAccessToAddRemove=\u0423 \u0432\u0430\u0441 \u043d\u0435\u0442 \u043f\u0440\u0430\u0432 \u043d\u0430 \u043f\u0440\u0435\u0434\u043e\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435, \u0430\u043d\u043d\u0443\u043b\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u0438\u043b\u0438 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u043a \u044d\u0442\u043e\u043c\u0443 \u043e\u0431\u044a\u0435\u043a\u0442\u0443.
WorkspaceMdl.Workspace.AlreadyExists=\u041f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0441 \u0442\u0430\u043a\u0438\u043c \u0438\u043c\u0435\u043d\u0435\u043c \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
WorkspaceMdl.WorkspaceDelete.Msg=\u0412\u043e\u0437\u043c\u043e\u0436\u043d\u043e, \u0443 \u0432\u0430\u0441 \u043d\u0435\u0442 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0445 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u0438\u0439, \u0438\u043b\u0438 \u043f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0438\u043b\u0438 \u043e\u0434\u043d\u0430 \u0438\u0437 \u0435\u0435 \u043f\u0430\u043f\u043e\u043a \u043f\u043e\u0434\u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442 \u043c\u0430\u0440\u0448\u0440\u0443\u0442\u044b \u0438\u043b\u0438 \u043e\u0431\u0441\u0443\u0436\u0434\u0435\u043d\u0438\u044f. \u0423\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c, \u0447\u0442\u043e \u0443 \u0432\u0430\u0441 \u0435\u0441\u0442\u044c \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u0430\u044f \u043e\u0431\u044f\u0437\u0430\u043d\u043d\u043e\u0441\u0442\u044c \u0438 \u0447\u0442\u043e \u0432 \u043f\u0430\u043f\u043a\u0435 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0438 \u0435\u0435 \u043f\u0430\u043f\u043a\u0430\u0445 \u043f\u043e\u0434\u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043d\u0435\u0442 \u043c\u0430\u0440\u0448\u0440\u0443\u0442\u043e\u0432 \u0438 \u043e\u0431\u0441\u0443\u0436\u0434\u0435\u043d\u0438\u0439.
WorkspaceMdl.FolderOwnershipRuleError=\u041d\u0430\u0440\u0443\u0448\u0435\u043d\u0438\u0435 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0432\u043b\u0430\u0434\u0435\u043d\u0438\u044f \u043f\u0430\u043f\u043a\u043e\u0439
WorkspaceMdl.FolderContentOwnershipRuleError=\u041d\u0430\u0440\u0443\u0448\u0435\u043d\u0438\u0435 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0432\u043b\u0430\u0434\u0435\u043d\u0438\u044f \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u044b\u043c \u043f\u0430\u043f\u043a\u0438
WorkspaceMdl.Workspace.MsgChangeContentFrozen=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u043e\u0435 \u044d\u0442\u043e\u0439 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0438\u0437-\u0437\u0430 \u0435\u0435 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u044f \u0433\u043e\u0442\u043e\u0432\u043d\u043e\u0441\u0442\u0438. \u0412\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u0435 \u043f\u043e\u043d\u0438\u0436\u0435\u043d\u0438\u0435 \u0434\u043e \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u044f, \u043f\u0440\u0438 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u043e \u0438\u0437\u043c\u0435\u043d\u044f\u0442\u044c \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u043e\u0435.
WorkspaceMdl.Workspace.MsgChangeStructureFrozen=\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443 \u044d\u0442\u043e\u0439 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0438\u0437-\u0437\u0430 \u0435\u0435 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u044f \u0433\u043e\u0442\u043e\u0432\u043d\u043e\u0441\u0442\u0438. \u0412\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u0435 \u043f\u043e\u043d\u0438\u0436\u0435\u043d\u0438\u0435 \u0434\u043e \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u044f, \u043f\u0440\u0438 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u043e \u0438\u0437\u043c\u0435\u043d\u044f\u0442\u044c \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443.
WorkspaceMdl.Workspace.MsgNoChangeStructureAccess=\u0423 \u0432\u0430\u0441 \u043d\u0435\u0442 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u0431\u0435\u0437\u043e\u043f\u0430\u0441\u043d\u043e\u0441\u0442\u0438 \u0434\u043b\u044f \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u044b \u044d\u0442\u043e\u0439 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.
WorkspaceMdl.WorkspaceMdlUtil.ErrorCreatingObjectType=\u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u043e\u0431\u044a\u0435\u043a\u0442\u0430 \u0441 \u0442\u0438\u043f\u043e\u043c '{0}'
WorkspaceMdl.WorkspaceVault.PersonalFolderMoveCopyError=\u041b\u0438\u0447\u043d\u044b\u0435 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043d\u0435 \u043c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u043f\u0435\u0440\u0435\u043c\u0435\u0449\u0435\u043d\u044b \u0438\u043b\u0438 \u0441\u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u044b \u0432 \u043b\u0438\u0447\u043d\u044b\u0435 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0434\u0440\u0443\u0433\u043e\u0433\u043e \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f.
WorkspaceMdl.WorkspaceVault.AccessError=\u041d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u043f\u0440\u0430\u0432 \u0434\u043b\u044f \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043d\u0438\u044f \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0438 \u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u044f/\u043f\u0435\u0440\u0435\u043c\u0435\u0449\u0435\u043d\u0438\u044f \u0434\u043b\u044f: 
WorkspaceMdl.WorkspaceVault.CopyError=\u041a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e, \u0442\u0430\u043a \u043a\u0430\u043a \u0443 \u0432\u0430\u0441 \u043d\u0435\u0442 \u0434\u043e\u043b\u0436\u043d\u044b\u0445 \u043f\u0440\u0430\u0432 \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u043a \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u043e\u043c\u0443 \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u043e\u043c\u0443 \u043f\u0430\u043f\u043e\u043a \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a/\u043f\u0430\u043f\u043e\u043a \u043f\u043e\u0434\u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.
WorkspaceMdl.WorkspaceVault.MoveCopyAccrossDifferentFolderError=\u041e\u043f\u0435\u0440\u0430\u0446\u0438\u0438 \u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u044f/\u043f\u0435\u0440\u0435\u043c\u0435\u0449\u0435\u043d\u0438\u044f \u043f\u0430\u043f\u043e\u043a \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044e\u0442\u0441\u044f \u043c\u0435\u0436\u0434\u0443 \u0440\u0430\u0437\u043d\u044b\u043c\u0438 \u0432\u0438\u0434\u0430\u043c\u0438 \u043f\u0430\u043f\u043e\u043a \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.
WorkspaceMdl.WorkspaceVault.CloneCopyError=\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u044c \u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435/\u043f\u0435\u0440\u0435\u043c\u0435\u0449\u0435\u043d\u0438\u0435/\u043a\u043b\u043e\u043d\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a <BOOKMARK> \u0432 \u043a\u043e\u0440\u043d\u0435\u0432\u0443\u044e \u043f\u0430\u043f\u043a\u0443 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a, \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u0449\u0443\u044e \u0434\u043e\u0447\u0435\u0440\u043d\u044e\u044e \u043f\u0430\u043f\u043a\u0443 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0441 \u0442\u0430\u043a\u0438\u043c \u0436\u0435 \u0438\u043c\u0435\u043d\u0435\u043c. \u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u0434\u0440\u0443\u0433\u043e\u0435 \u043c\u0435\u0441\u0442\u043e \u043d\u0430\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f.
WorkspaceMdl.WorkspaceVault.MoveCopyFolderError=\u041f\u0435\u0440\u0435\u043c\u0435\u0449\u0435\u043d\u0438\u0435 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0432 \u043e\u0434\u043d\u043e\u0433\u043e \u0438\u0437 \u0435\u0435 \u043f\u043e\u0442\u043e\u043c\u043a\u043e\u0432 \u043d\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u043e
WorkspaceMdl.WorkspaceVault.CannotCopyMoveLinkToInvalidFolder=\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u044c \u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435/\u043f\u0435\u0440\u0435\u043c\u0435\u0449\u0435\u043d\u0438\u0435/\u0441\u0432\u044f\u0437\u044c \u0441 \u043d\u0435\u043f\u043e\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0439 \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u044c\u0441\u043a\u043e\u0439/\u0442\u043e\u0439 \u0436\u0435 \u043f\u0430\u043f\u043a\u043e\u0439 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a/\u0434\u043e\u0447\u0435\u0440\u043d\u0438\u043c\u0438 \u043f\u0430\u043f\u043a\u0430\u043c\u0438 \u043f\u043e\u0434\u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a. \u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u0434\u0440\u0443\u0433\u043e\u0435 \u043c\u0435\u0441\u0442\u043e \u043d\u0430\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f.
WorkspaceMdl.WorkspaceVault.MoveCopyAccessError=\u0423 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f \u043d\u0435\u0442 \u043f\u0440\u0430\u0432 \u043d\u0430 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0435 \u0434\u0430\u043d\u043d\u043e\u0439 \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0438.
WorkspaceMdl.WorkspaceVault.MoveOperationError=\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u044c \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u044e \u043f\u0435\u0440\u0435\u043c\u0435\u0449\u0435\u043d\u0438\u044f, \u0442\u0430\u043a \u043a\u0430\u043a \u0443 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u043f\u0440\u0430\u0432\u0430 \u043d\u0430 \u0447\u0442\u0435\u043d\u0438\u0435 \u0434\u043b\u044f \u043e\u0434\u043d\u043e\u0433\u043e \u0438\u043b\u0438 \u0431\u043e\u043b\u0435\u0435 \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u043e\u0433\u043e \u043f\u0430\u043f\u043e\u043a \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a/\u043f\u0430\u043f\u043e\u043a \u043f\u043e\u0434\u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.
WorkspaceMdl.MoveCopyContent.ContentExistsInSourceFolderError=\u043e\u0431\u044a\u0435\u043a\u0442 \u0443\u0436\u0435 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0435\u043d \u043a \u0442\u043e\u0439 \u0436\u0435 \u043f\u0430\u043f\u043a\u0435 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.
WorkspaceMdl.MoveCopyContent.DoesnotExistsInSourceFolderError=\u0412 \u0438\u0441\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u0430\u043f\u043a\u0435 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043d\u0435 \u043c\u0435\u043d\u0435\u0435 \u043e\u0434\u043d\u043e\u0433\u043e \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u043e\u0433\u043e.
WorkspaceMdl.WorkspaceVault.CloneStructureError=\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u043a\u043b\u043e\u043d\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0432\u044b\u0431\u0440\u0430\u043d\u043d\u0443\u044e \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443. \u0414\u043b\u044f \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u044d\u0442\u043e\u0439 \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0438 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f \u0434\u043e\u0441\u0442\u0443\u043f \u043a\u043e \u0432\u0441\u0435\u043c \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430\u043c \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u044b
WorkspaceMdl.CopyFolder.ErrorCopyInDescendant=\u041a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0432 \u043e\u0434\u043d\u043e\u0433\u043e \u0438\u0437 \u0435\u0435 \u043f\u043e\u0442\u043e\u043c\u043a\u043e\u0432 \u0437\u0430\u043f\u0440\u0435\u0449\u0435\u043d\u043e.
WorkspaceMdl.Workspace.ErrorBulkDelete=\u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0443\u0434\u0430\u043b\u0438\u0442\u044c \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0435 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a. \u0412\u043e\u0437\u043c\u043e\u0436\u043d\u044b\u0435 \u043f\u0440\u0438\u0447\u0438\u043d\u044b: \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u0438\u043b\u0438 \u0433\u043e\u0442\u043e\u0432\u043d\u043e\u0441\u0442\u0438 \u0437\u0430\u043f\u0440\u0435\u0449\u0430\u0435\u0442 \u0443\u0434\u0430\u043b\u0435\u043d\u0438\u0435 \u043e\u0431\u044a\u0435\u043a\u0442\u0430 \u0432 \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0435.
WorkspaceMdl.LinkFolder.CannotLinkToInvalidFolder=\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0441\u0432\u044f\u0437\u044c \u0441 \u043d\u0435\u043f\u043e\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0439 \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u044c\u0441\u043a\u043e\u0439/\u0442\u043e\u0439 \u0436\u0435 \u043f\u0430\u043f\u043a\u043e\u0439 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a/\u0434\u043e\u0447\u0435\u0440\u043d\u0438\u043c\u0438 \u043f\u0430\u043f\u043a\u0430\u043c\u0438 \u043f\u043e\u0434\u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a. \u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u0434\u0440\u0443\u0433\u043e\u0435 \u043c\u0435\u0441\u0442\u043e \u043d\u0430\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f.
WorkspaceMdl.LinkFolder.AlreadyLinkedBookmark=\u041f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a \u0443\u0436\u0435 \u0441\u0432\u044f\u0437\u0430\u043d\u0430 \u0441 \u044d\u0442\u043e\u0439 \u043f\u0430\u043f\u043a\u043e\u0439 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a
WorkspaceMdl.SequenceOrder.InvalidConnectionId=\u041d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 \u0438\u0434\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f \u0434\u043b\u044f \u0441\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u043a\u0438.
WorkspaceMdl.SequenceOrder.InvalidInputConnection=\u041d\u0435\u0432\u0435\u0440\u043d\u044b\u0435 \u0432\u0445\u043e\u0434\u043d\u044b\u0435 \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f. \u041e\u043d\u0438 \u0434\u043e\u043b\u0436\u043d\u044b \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u043e\u0434\u043d\u043e\u043c\u0443 \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u044c\u0441\u043a\u043e\u043c\u0443 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0443.
WorkspaceMdl.SequenceOrder.NoSortAccess=\u0423 \u0432\u0430\u0441 \u043d\u0435\u0442 \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u0434\u043b\u044f \u0441\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u043a\u0438 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a, \u043e\u0442\u043d\u043e\u0441\u044f\u0449\u0435\u0439\u0441\u044f \u043a \u044d\u0442\u043e\u043c\u0443 \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u044c\u0441\u043a\u043e\u043c\u0443 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0443.
WorkspaceMdl.links.ErrorNoAddRemoveModifyLinkAccess=\u0423 \u0432\u0430\u0441 \u043d\u0435\u0442 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u0434\u043b\u044f \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u044f, \u0438\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f \u0438\u043b\u0438 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0441\u0441\u044b\u043b\u043e\u043a \u0432 \u044d\u0442\u043e\u0439 \u043f\u0430\u043f\u043a\u0435 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.
WorkspaceMdl.links.InvalidUriPattern=\u0414\u043b\u044f \u0441\u0441\u044b\u043b\u043a\u0438 \u0443\u043a\u0430\u0437\u0430\u043d \u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 \u043c\u0430\u0441\u0441\u0438\u0432. \u041f\u0440\u043e\u0432\u0435\u0440\u044c\u0442\u0435 \u0432 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430\u0446\u0438\u0438 \u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0435 \u043c\u0430\u0441\u0441\u0438\u0432\u044b.
WorkspaceMdl.links.UriAlreadyExists=\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e {0} \u044d\u0442\u0443 \u0441\u0441\u044b\u043b\u043a\u0443, \u0442\u0430\u043a \u043a\u0430\u043a \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u0449\u0438\u0439\u0441\u044f \u0432 \u043d\u0435\u0439 URI \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0432 \u0446\u0435\u043b\u0435\u0432\u043e\u0439 \u043f\u0430\u043f\u043a\u0435 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.
WorkspaceMdl.links.InvalidLinkId=\u041f\u0435\u0440\u0435\u0434\u0430\u043d \u043d\u0435\u0432\u0435\u0440\u043d\u044b\u0439 \u0438\u043b\u0438 \u043d\u0435\u0434\u043e\u0441\u0442\u0443\u043f\u043d\u044b\u0439 \u0438\u0434\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440 \u0441\u0441\u044b\u043b\u043a\u0438.
WorkspaceMdl.Workspace.MsgNoChangeContentAccess=\u0423 \u0432\u0430\u0441 \u043d\u0435\u0442 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u0431\u0435\u0437\u043e\u043f\u0430\u0441\u043d\u043e\u0441\u0442\u0438 \u0434\u043b\u044f \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u044b \u044d\u0442\u043e\u0439 \u043f\u0430\u043f\u043a\u0438 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a.


# Tree Node Properties
WorkspaceMdl.Command.Subfolder=\u041f\u0430\u043f\u043a\u0438 \u043f\u043e\u0434\u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a


# Route Wizard
WorkspaceMdl.Bookmarks.Owner=\u0412\u043b\u0430\u0434\u0435\u043b\u0435\u0446

# Bookmark Folder Display Names
WorkspaceMdl.type.Workspace=\u041a\u043e\u0440\u043d\u0435\u0432\u0430\u044f \u043f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a
WorkspaceMdl.type.WorkspaceVault=\u041f\u0430\u043f\u043a\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a

WorkspaceMdl.Common.AlreadyExists=\u0423\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
