#
#   Copyright (c) 1992-2020 Dassault Systemes.
#   All Rights Reserved.
#

# Parameterization
OOTBParameterization.LifecycleTopology.Workspace=Lesezeichen-Ordner
OOTBParameterization.LifecycleTopology.Workspace.Workspace=Lesezeichen-Stammordner
OOTBParameterization.LifecycleTopology.Workspace.Workspace_Vault=Lesezeichen-Ordner

# Parameterization for BookmarkCreateInWork
#Domain
OOTBParameterization.BookmarkMdl=Lesezeichen-Ordner
OOTBParameterization.BookmarkMdl.tooltip=Erm\u00f6glicht die Definition von Regeln zum Anpassen des Verhaltens des Lesezeichen-Ordners

#Family
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience=Lesezeichen-Ordnererfahrung konfigurieren

#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork=Setzen Sie beim Erstellen eines Lesezeichen-Ordners den Bearbeitungsstatus auf 'In Arbeit'
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.tooltip=W\u00e4hlen Sie diese Option aus, um einen Lesezeichen-Ordner im Status 'In Arbeit' zu erstellen. Deaktivieren Sie die Option f\u00fcr den Status 'Entwurf'
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument=Setzen Sie beim Erstellen eines Lesezeichen-Ordners den Bearbeitungsstatus auf 'In Arbeit'
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument.tooltip=W\u00e4hlen Sie diese Option aus, um einen Lesezeichen-Ordner im Status 'In Arbeit' zu erstellen. Deaktivieren Sie die Option f\u00fcr den Status 'Entwurf'


# Parameterization for BookmarkRootRestrictCreateToLeader
#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader=Nur Leitern das Erstellen von Lesezeichen-Ordnern auf der ersten Ebene gestatten.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument=Nur Leitern das Erstellen von Lesezeichen-Ordnern auf der ersten Ebene gestatten.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument.tooltip=Wenn aktiviert, k\u00f6nnen nur Leiter Lesezeichen-Ordner auf der ersten Ebene (Lesezeichen-Stammordner) erstellen. Wenn deaktiviert, k\u00f6nnen Mitwirkende, Autoren und Leiter Lesezeichen-Ordner auf der ersten Ebene erstellen.


#Error message
WorkspaceMdl.ObjectAccess.NoAccessToAddRemove=Sie haben keine Berechtigung zum Verleihen, Widerrufen oder \u00c4ndern dieser Objektberechtigungen.
WorkspaceMdl.Workspace.AlreadyExists=Ein Lesezeichen-Ordner mit demselben Namen ist bereits vorhanden
WorkspaceMdl.WorkspaceDelete.Msg=Sie haben m\u00f6glicherweise nicht die erforderlichen Berechtigungen oder der Lesezeichen-Ordner bzw. einer seiner Unter-Lesezeichen-Ordner enth\u00e4lt Weiterleitungen oder Diskussionen. Best\u00e4tigen Sie, dass Sie die erforderliche Zust\u00e4ndigkeit haben und dass auf dem Lesezeichen-Ordner oder einem der Unter-Lesezeichen-Ordner keine Weiterleitungen oder Diskussionen vorhanden sind.
WorkspaceMdl.FolderOwnershipRuleError=Verletzung der Eigentumsregeln f\u00fcr Ordner
WorkspaceMdl.FolderContentOwnershipRuleError=Verletzung der Eigentumsregeln f\u00fcr Ordnerinhalte
WorkspaceMdl.Workspace.MsgChangeContentFrozen=Sie k\u00f6nnen den Inhalt dieses Lesezeichen-Ordners aufgrund seines Bearbeitungsstatus nicht \u00e4ndern. Stufen Sie ihn auf einen Status zur\u00fcck, in dem das \u00c4ndern von Inhalten erlaubt ist.
WorkspaceMdl.Workspace.MsgChangeStructureFrozen=Sie k\u00f6nnen die Struktur dieses Lesezeichen-Ordners aufgrund seines Bearbeitungsstatus nicht \u00e4ndern. Stufen Sie ihn auf einen Status zur\u00fcck, in dem das \u00c4ndern der Struktur erlaubt ist.
WorkspaceMdl.Workspace.MsgNoChangeStructureAccess=Sie verf\u00fcgen nicht \u00fcber den n\u00f6tigen Sicherheitskontext, um die Struktur dieses Lesezeichen-Ordners zu \u00e4ndern.
WorkspaceMdl.WorkspaceMdlUtil.ErrorCreatingObjectType=Fehler beim Erstellen des Objekts vom Typ "{0}"
WorkspaceMdl.WorkspaceVault.PersonalFolderMoveCopyError=Pers\u00f6nliche Lesezeichen-Ordner k\u00f6nnen nicht zwischen pers\u00f6nlichen Lesezeichen-Ordnern von verschiedenen Benutzern verschoben oder kopiert werden.
WorkspaceMdl.WorkspaceVault.AccessError=Kopieren/Verschieben kann nicht abgeschlossen werden. Es besteht kein vollst\u00e4ndiger Zugriff auf: 
WorkspaceMdl.WorkspaceVault.CopyError=Kopieren nicht m\u00f6glich, da Sie f\u00fcr einige Inhalte der Lesezeichen-Ordner/Unter-Lesezeichen-Ordner nicht \u00fcber ausreichende Zugriffsrechte verf\u00fcgen.
WorkspaceMdl.WorkspaceVault.MoveCopyAccrossDifferentFolderError=Kopier-/Verschiebevorg\u00e4nge f\u00fcr Lesezeichen-Ordner zwischen unterschiedlichen Arten von Lesezeichen-Ordnern werden nicht unterst\u00fctzt.
WorkspaceMdl.WorkspaceVault.CloneCopyError=Das Kopieren/Verschieben/Klonen des Lesezeichen-Ordners <BOOKMARK> in einen Lesezeichen-Stammordner, der einen untergeordneten Lesezeichen-Ordner mit demselben Namen enth\u00e4lt, ist nicht m\u00f6glich. W\u00e4hlen Sie ein anderes Ziel aus.
WorkspaceMdl.WorkspaceVault.MoveCopyFolderError=Das Verschieben eines Lesezeichen-Ordners in eine seiner Ableitungen ist nicht zul\u00e4ssig
WorkspaceMdl.WorkspaceVault.CannotCopyMoveLinkToInvalidFolder=Das Kopieren/Verschieben/Verkn\u00fcpfen zu direkt \u00fcbergeordneten/gleichen Lesezeichen-Ordnern/untergeordneten Unter-Lesezeichen-Ordnern ist nicht m\u00f6glich. W\u00e4hlen Sie ein anderes Ziel aus.
WorkspaceMdl.WorkspaceVault.MoveCopyAccessError=Der Benutzer verf\u00fcgt nicht \u00fcber die Befugnis, diese Aktion auszuf\u00fchren.
WorkspaceMdl.WorkspaceVault.MoveOperationError=Verschieben nicht m\u00f6glich, da der Benutzer keinen Lesezugriff auf mindestens einen Inhalt der Lesezeichen-Ordner/Unter-Lesezeichen-Ordner hat.
WorkspaceMdl.MoveCopyContent.ContentExistsInSourceFolderError=Objekt ist bereits mit demselben Lesezeichen-Ordner verbunden.
WorkspaceMdl.MoveCopyContent.DoesnotExistsInSourceFolderError=Mindestens ein Inhalt ist in dem Quell-Lesezeichen-Ordner nicht vorhanden.
WorkspaceMdl.WorkspaceVault.CloneStructureError=Die ausgew\u00e4hlte Struktur kann nicht geklont werden. Sie m\u00fcssen Zugriff auf alle Strukturelemente haben, um diesen Vorgang auszuf\u00fchren.
WorkspaceMdl.CopyFolder.ErrorCopyInDescendant=Das Kopieren eines Lesezeichen-Ordners in eine seiner Ableitungen ist nicht zul\u00e4ssig.
WorkspaceMdl.Workspace.ErrorBulkDelete=Die folgenden Lesezeichen-Ordner konnten nicht gel\u00f6scht werden. M\u00f6gliche Gr\u00fcnde sind Zugriffs- oder Bearbeitungsstatus, die das L\u00f6schen eines Objekts in der Struktur verhindern.
WorkspaceMdl.LinkFolder.CannotLinkToInvalidFolder=Das Verkn\u00fcpfen mit direkt \u00fcbergeordneten/gleichen Lesezeichen-Ordnern/untergeordneten Unter-Lesezeichen-Ordnern ist nicht m\u00f6glich. W\u00e4hlen Sie ein anderes Ziel aus.
WorkspaceMdl.LinkFolder.AlreadyLinkedBookmark=Der Lesezeichen-Ordner ist bereits mit diesem Lesezeichen-Ordner verkn\u00fcpft
WorkspaceMdl.SequenceOrder.InvalidConnectionId=Verbindungs-ID zum Sortieren ist nicht g\u00fcltig.
WorkspaceMdl.SequenceOrder.InvalidInputConnection=Ung\u00fcltige Eingabeverbindungen. Diese m\u00fcssen sich unter demselben \u00fcbergeordneten Element befinden.
WorkspaceMdl.SequenceOrder.NoSortAccess=Sie haben keinen Zugriff auf das Sortieren des Lesezeichen-Ordners unter diesem \u00fcbergeordneten Element.
WorkspaceMdl.links.ErrorNoAddRemoveModifyLinkAccess=Sie haben nicht den n\u00f6tigen Zugriff zum Hinzuf\u00fcgen, Entfernen oder \u00c4ndern von Verkn\u00fcpfungen dieses Lesezeichen-Ordners.
WorkspaceMdl.links.InvalidUriPattern=Ung\u00fcltiges Muster f\u00fcr Verkn\u00fcpfung angegeben. \u00dcberpr\u00fcfen Sie die Dokumentation f\u00fcr g\u00fcltige Muster.
WorkspaceMdl.links.UriAlreadyExists=Sie k\u00f6nnen diese Referenz nicht {0}, da die darin enthaltene URI bereits im Ziel-Lesezeichen-Ordner vorhanden ist.
WorkspaceMdl.links.InvalidLinkId=Ung\u00fcltige oder unzug\u00e4ngliche Link-ID wird \u00fcbermittelt.
WorkspaceMdl.Workspace.MsgNoChangeContentAccess=Sie verf\u00fcgen nicht \u00fcber den n\u00f6tigen Sicherheitskontext, um den Inhalt dieses Lesezeichen-Ordners zu \u00e4ndern.


# Tree Node Properties
WorkspaceMdl.Command.Subfolder=Unter-Lesezeichen-Ordner


# Route Wizard
WorkspaceMdl.Bookmarks.Owner=Eigent\u00fcmer

# Bookmark Folder Display Names
WorkspaceMdl.type.Workspace=Lesezeichen-Stammordner
WorkspaceMdl.type.WorkspaceVault=Lesezeichen-Ordner

WorkspaceMdl.Common.AlreadyExists=Bereits vorhanden
