#
#   Copyright (c) 1992-2020 Dassault Systemes.
#   All Rights Reserved.
#

# Parameterization
OOTBParameterization.LifecycleTopology.Workspace=\ubd81\ub9c8\ud06c \ud3f4\ub354
OOTBParameterization.LifecycleTopology.Workspace.Workspace=\ubd81\ub9c8\ud06c \ub8e8\ud2b8 \ud3f4\ub354
OOTBParameterization.LifecycleTopology.Workspace.Workspace_Vault=\ubd81\ub9c8\ud06c \ud3f4\ub354

# Parameterization for BookmarkCreateInWork
#Domain
OOTBParameterization.BookmarkMdl=\ubd81\ub9c8\ud06c \ud3f4\ub354
OOTBParameterization.BookmarkMdl.tooltip=\ubd81\ub9c8\ud06c \ud3f4\ub354 \ub3d9\uc791\uc744 \uc0ac\uc6a9\uc790 \uc815\uc758\ud558\ub294 \uaddc\uce59\uc744 \uc815\uc758\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.

#Family
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience=\ubd81\ub9c8\ud06c \ud3f4\ub354 \ud658\uacbd \uad6c\uc131

#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork=\ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \ub9cc\ub4e4 \ub54c \uc131\uc219\ub3c4 \uc0c1\ud0dc\ub97c \uc791\uc5c5 \uc911\uc73c\ub85c \uc124\uc815\ud569\ub2c8\ub2e4.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.tooltip=\uc791\uc5c5 \uc911 \uc0c1\ud0dc\uc778 \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \ub9cc\ub4e4\ub824\uba74 \uc120\ud0dd\ud558\uace0 \ucd08\uc548 \uc0c1\ud0dc\uc5d0\ub294 \uc120\ud0dd\uc744 \ucde8\uc18c\ud569\ub2c8\ub2e4.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument=\ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \ub9cc\ub4e4 \ub54c \uc131\uc219\ub3c4 \uc0c1\ud0dc\ub97c \uc791\uc5c5 \uc911\uc73c\ub85c \uc124\uc815\ud569\ub2c8\ub2e4.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument.tooltip=\uc791\uc5c5 \uc911 \uc0c1\ud0dc\uc778 \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \ub9cc\ub4e4\ub824\uba74 \uc120\ud0dd\ud558\uace0 \ucd08\uc548 \uc0c1\ud0dc\uc5d0\ub294 \uc120\ud0dd\uc744 \ucde8\uc18c\ud569\ub2c8\ub2e4.


# Parameterization for BookmarkRootRestrictCreateToLeader
#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader=\ub9ac\ub354\ub9cc \uccab \ubc88\uc9f8 \uc218\uc900 \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \uc791\uc131\ud560 \uc218 \uc788\ub3c4\ub85d \ud5c8\uc6a9\ud569\ub2c8\ub2e4.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument=\ub9ac\ub354\ub9cc \uccab \ubc88\uc9f8 \uc218\uc900 \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \uc791\uc131\ud560 \uc218 \uc788\ub3c4\ub85d \ud5c8\uc6a9\ud569\ub2c8\ub2e4.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument.tooltip=\uc774 \uc635\uc158\uc744 \ucf1c\uba74 \ub9ac\ub354\ub9cc \uccab \ubc88\uc9f8 \uc218\uc900 \ubd81\ub9c8\ud06c \ud3f4\ub354(\ubd81\ub9c8\ud06c \ub8e8\ud2b8 \ud3f4\ub354)\ub97c \uc791\uc131\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \ub044\uba74 \ucc38\uc5ec\uc790, \uc791\uc131\uc790, \ub9ac\ub354\uac00 \uccab \ubc88\uc9f8 \uc218\uc900 \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \uc791\uc131\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.


#Error message
WorkspaceMdl.ObjectAccess.NoAccessToAddRemove=\uc774 \uac1c\uccb4\uc5d0 \ub300\ud55c \uc561\uc138\uc2a4\ub97c \ud5c8\uc6a9, \ucde8\uc18c \ub610\ub294 \uc218\uc815\ud560 \uc218 \uc788\ub294 \uad8c\ud55c\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.Workspace.AlreadyExists=\ub3d9\uc77c\ud55c \uc774\ub984\uc758 \ubd81\ub9c8\ud06c \ud3f4\ub354\uac00 \uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceDelete.Msg=\ud544\uc694\ud55c \ud5c8\uac00\uac00 \uc5c6\uac70\ub098 \ubd81\ub9c8\ud06c \ud3f4\ub354 \ub610\ub294 \ud574\ub2f9 \ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354 \uc911 \ud558\ub098\uc5d0 \uacb0\uc7ac \ub77c\uc778 \ub610\ub294 \ud1a0\ub860\uc774 \ud3ec\ud568\ub418\uc5b4 \uc788\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \ud544\uc694\ud55c \uc9c1\ubb34\uac00 \uc788\ub294\uc9c0 \uadf8\ub9ac\uace0, \ubd81\ub9c8\ud06c \ud3f4\ub354 \ub610\ub294 \ud574\ub2f9 \ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc5d0 \uacb0\uc7ac \ub77c\uc778\uc774\ub098 \ud1a0\ub860\uc774 \uc5c6\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
WorkspaceMdl.FolderOwnershipRuleError=\ud3f4\ub354 \uc18c\uc720\uad8c \uaddc\uce59 \uc704\ubc18
WorkspaceMdl.FolderContentOwnershipRuleError=\ud3f4\ub354 \ucf58\ud150\uce20 \uc18c\uc720\uad8c \uaddc\uce59 \uc704\ubc18
WorkspaceMdl.Workspace.MsgChangeContentFrozen=\uc131\uc219\ub3c4 \uc0c1\ud0dc \ub54c\ubb38\uc5d0 \uc774 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc758 \ucf58\ud150\uce20\ub97c \ubcc0\uacbd\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ucf58\ud150\uce20 \ubcc0\uacbd\uc774 \ud5c8\uc6a9\ub418\ub294 \uc0c1\ud0dc\ub85c \uac15\ub4f1\uc2dc\ud0a4\uc2ed\uc2dc\uc624.
WorkspaceMdl.Workspace.MsgChangeStructureFrozen=\uc131\uc219\ub3c4 \uc0c1\ud0dc \ub54c\ubb38\uc5d0 \uc774 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc758 \uad6c\uc870\ub97c \ubcc0\uacbd\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uad6c\uc870 \ubcc0\uacbd\uc774 \ud5c8\uc6a9\ub418\ub294 \uc0c1\ud0dc\ub85c \uac15\ub4f1\uc2dc\ud0a4\uc2ed\uc2dc\uc624.
WorkspaceMdl.Workspace.MsgNoChangeStructureAccess=\uc774 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc758 \uad6c\uc870\ub97c \ubcc0\uacbd\ud560 \uc218 \uc788\ub294 \ubcf4\uc548 \ucee8\ud14d\uc2a4\ud2b8\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceMdlUtil.ErrorCreatingObjectType='{0}' \uc720\ud615\uc758 \uac1c\uccb4\ub97c \uc0dd\uc131\ud558\ub294 \uc911 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceVault.PersonalFolderMoveCopyError=\uac1c\uc778 \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \ub2e4\ub978 \uc0ac\uc6a9\uc790\uc758 \uac1c\uc778 \ubd81\ub9c8\ud06c \ud3f4\ub354 \uc544\ub798\uc5d0 \uc774\ub3d9\ud558\uac70\ub098 \ubcf5\uc0ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceVault.AccessError=\uc561\uc138\uc2a4 \uad8c\ud55c\uc774 \ucda9\ubd84\ud558\uc9c0 \uc54a\uc544\uc11c \ubcf5\uc0ac/\uc774\ub3d9 \uc791\uc5c5\uc744 \uc644\ub8cc\ud560 \uc218 \uc5c6\uc74c: 
WorkspaceMdl.WorkspaceVault.CopyError=\ubd81\ub9c8\ud06c \ud3f4\ub354/\ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc758 \uc77c\ubd80 \ub0b4\uc6a9\uc5d0 \ub300\ud574 \uc801\uc808\ud55c \uc561\uc138\uc2a4 \uad8c\ud55c\uc744 \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc73c\ubbc0\ub85c \ubcf5\uc0ac\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceVault.MoveCopyAccrossDifferentFolderError=\uc11c\ub85c \ub2e4\ub978 \ub450 \uc885\ub958\uc758 \ubd81\ub9c8\ud06c \ud3f4\ub354 \uac04\uc5d0\ub294 \ubd81\ub9c8\ud06c \ud3f4\ub354 \ubcf5\uc0ac/\uc774\ub3d9 \uc791\uc5c5\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceVault.CloneCopyError=\ub3d9\uc77c\ud55c \uc774\ub984\uc758 \ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354\uac00 \uc788\ub294 \ubd81\ub9c8\ud06c \ub8e8\ud2b8 \ud3f4\ub354\ub85c \ubd81\ub9c8\ud06c \ud3f4\ub354 <BOOKMARK>\uc744(\ub97c) \ubcf5\uc0ac/\uc774\ub3d9/\ubcf5\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ub2e4\ub978 \ub300\uc0c1\uc744 \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
WorkspaceMdl.WorkspaceVault.MoveCopyFolderError=\ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \uc774 \ud3f4\ub354\uc758 \ud558\uc704 \uc911 \ud558\ub098\ub85c \uc774\ub3d9\ud558\ub294 \uc791\uc5c5\uc740 \ud5c8\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceVault.CannotCopyMoveLinkToInvalidFolder=\ubc14\ub85c \uc704 \uc0c1\uc704/\ub3d9\uc77c\ud55c \ubd81\ub9c8\ud06c \ud3f4\ub354/\ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc5d0 \ubcf5\uc0ac/\uc774\ub3d9/\uc5f0\uacb0\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ub2e4\ub978 \ub300\uc0c1\uc744 \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
WorkspaceMdl.WorkspaceVault.MoveCopyAccessError=\uc0ac\uc6a9\uc790\uac00 \uc791\uc5c5\uc744 \uc704\ud55c \uad8c\ud55c\uc744 \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceVault.MoveOperationError=\uc0ac\uc6a9\uc790\uac00 \ubd81\ub9c8\ud06c \ud3f4\ub354/\ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc758 \ucf58\ud150\uce20 \uc911 \ud558\ub098 \uc774\uc0c1\uc5d0 \ub300\ud574 \uc77d\uae30 \uad8c\ud55c\uc744 \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc73c\ubbc0\ub85c \uc774\ub3d9 \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.MoveCopyContent.ContentExistsInSourceFolderError=\uac1c\uccb4\uac00 \uc774\ubbf8 \ub3d9\uc77c\ud55c \ubd81\ub9c8\ud06c \ud3f4\ub354\uc5d0 \uc5f0\uacb0\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.MoveCopyContent.DoesnotExistsInSourceFolderError=\ud558\ub098 \uc774\uc0c1\uc758 \ucf58\ud150\uce20\uac00 \uc18c\uc2a4 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc5d0 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.WorkspaceVault.CloneStructureError=\uc120\ud0dd\ud55c \uad6c\uc870\ub97c \ubcf5\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.\uc774 \uc791\uc5c5\uc744 \uc218\ud589\ud558\ub824\uba74 \uad6c\uc870\uc758 \ubaa8\ub4e0 \uc694\uc18c\uc5d0 \ub300\ud55c \uc561\uc138\uc2a4\uac00 \ud544\uc694\ud569\ub2c8\ub2e4.
WorkspaceMdl.CopyFolder.ErrorCopyInDescendant=\uc885\uc18d \ud56d\ubaa9 \uc911 \ud558\ub098\uc5d0\uc11c \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \ubcf5\uc0ac\ud558\ub294 \uac83\uc740 \ud5c8\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.Workspace.ErrorBulkDelete=\ub2e4\uc74c \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uac00\ub2a5\ud55c \uc774\uc720\ub294 \uc561\uc138\uc2a4 \ub610\ub294 \uc131\uc219\ub3c4 \uc0c1\ud0dc\uac00 \uad6c\uc870\uc5d0\uc11c \uac1c\uccb4 \uc0ad\uc81c\ub97c \uae08\uc9c0\ud558\uae30 \ub54c\ubb38\uc785\ub2c8\ub2e4.
WorkspaceMdl.LinkFolder.CannotLinkToInvalidFolder=\ubc14\ub85c \uc704 \uc0c1\uc704/\ub3d9\uc77c\ud55c \ubd81\ub9c8\ud06c \ud3f4\ub354/\ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc5d0 \ub9c1\ud06c\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ub2e4\ub978 \ub300\uc0c1\uc744 \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
WorkspaceMdl.LinkFolder.AlreadyLinkedBookmark=\ubd81\ub9c8\ud06c \ud3f4\ub354\uac00 \uc774\ubbf8 \uc774 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc5d0 \ub9c1\ud06c\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.SequenceOrder.InvalidConnectionId=\uc815\ub82c\ud560 \uc5f0\uacb0 ID\uac00 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.SequenceOrder.InvalidInputConnection=\uc785\ub825 \uc5f0\uacb0\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub3d9\uc77c\ud55c \uc0c1\uc704 \uc544\ub798 \uc788\uc5b4\uc57c \ud569\ub2c8\ub2e4.
WorkspaceMdl.SequenceOrder.NoSortAccess=\uc774 \uc0c1\uc704 \uc544\ub798\uc758 \ubd81\ub9c8\ud06c \ud3f4\ub354\ub97c \uc815\ub82c\ud560 \uad8c\ud55c\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.links.ErrorNoAddRemoveModifyLinkAccess=\uc774 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc758 \ub9c1\ud06c\ub97c \ucd94\uac00, \uc81c\uac70 \ub610\ub294 \uc218\uc815\ud558\ub294 \ub370 \ud544\uc694\ud55c \uc561\uc138\uc2a4 \uad8c\ud55c\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.links.InvalidUriPattern=\ub9c1\ud06c\uc5d0 \uc798\ubabb\ub41c \ud328\ud134\uc774 \uc9c0\uc815\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \ubb38\uc11c\uc5d0\uc11c \uc720\ud6a8\ud55c \ud328\ud134\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
WorkspaceMdl.links.UriAlreadyExists=\ud3ec\ud568\ub41c URI\uac00 \uc774\ubbf8 \ub300\uc0c1 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc5d0 \uc874\uc7ac\ud558\ubbc0\ub85c \uc774 \ucc38\uc870\ub97c {0}\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.links.InvalidLinkId=\uc720\ud6a8\ud558\uc9c0 \uc54a\uac70\ub098 \uc561\uc138\uc2a4\ud560 \uc218 \uc5c6\ub294 linkid\uac00 \uc804\ub2ec\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
WorkspaceMdl.Workspace.MsgNoChangeContentAccess=\uc774 \ubd81\ub9c8\ud06c \ud3f4\ub354\uc758 \ucf58\ud150\uce20\ub97c \ubcc0\uacbd\ud560 \uc218 \uc788\ub294 \ubcf4\uc548 \ucee8\ud14d\uc2a4\ud2b8\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.


# Tree Node Properties
WorkspaceMdl.Command.Subfolder=\ud558\uc704 \ubd81\ub9c8\ud06c \ud3f4\ub354


# Route Wizard
WorkspaceMdl.Bookmarks.Owner=\uc18c\uc720\uc790

# Bookmark Folder Display Names
WorkspaceMdl.type.Workspace=\ubd81\ub9c8\ud06c \ub8e8\ud2b8 \ud3f4\ub354
WorkspaceMdl.type.WorkspaceVault=\ubd81\ub9c8\ud06c \ud3f4\ub354

WorkspaceMdl.Common.AlreadyExists=\uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4
