#
#   Copyright (c) 1992-2020 Dassault Systemes.
#   All Rights Reserved.
#

# Parameterization
OOTBParameterization.LifecycleTopology.Workspace=Yer \u0130\u015fareti Klas\u00f6r\u00fc
OOTBParameterization.LifecycleTopology.Workspace.Workspace=Yer \u0130\u015fareti K\u00f6k Klas\u00f6r\u00fc
OOTBParameterization.LifecycleTopology.Workspace.Workspace_Vault=Yer \u0130\u015fareti Klas\u00f6r\u00fc

# Parameterization for BookmarkCreateInWork
#Domain
OOTBParameterization.BookmarkMdl=Yer \u0130\u015fareti Klas\u00f6r\u00fc
OOTBParameterization.BookmarkMdl.tooltip=Yer \u0130\u015fareti Klas\u00f6r\u00fc davran\u0131\u015f\u0131n\u0131 \u00f6zelle\u015ftirmek i\u00e7in kural tan\u0131mlamay\u0131 sa\u011flar

#Family
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience=Yer \u0130\u015fareti Klas\u00f6r\u00fc Deneyimini Yap\u0131land\u0131r

#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork=Yer \u0130\u015fareti Klas\u00f6r\u00fc olu\u015ftururken olgunluk durumunu \u00c7al\u0131\u015fmada \u015feklinde ayarlay\u0131n
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.tooltip=\u00c7al\u0131\u015fmada durumunda Yer \u0130\u015fareti Klas\u00f6r\u00fc olu\u015fturmak i\u00e7in bunu se\u00e7in; Taslak durumu i\u00e7in se\u00e7imi kald\u0131r\u0131n
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument=Yer \u0130\u015fareti Klas\u00f6r\u00fc olu\u015ftururken olgunluk durumunu \u00c7al\u0131\u015fmada \u015feklinde ayarlay\u0131n
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument.tooltip=\u00c7al\u0131\u015fmada durumunda Yer \u0130\u015fareti Klas\u00f6r\u00fc olu\u015fturmak i\u00e7in bunu se\u00e7in; Taslak durumu i\u00e7in se\u00e7imi kald\u0131r\u0131n


# Parameterization for BookmarkRootRestrictCreateToLeader
#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader=Yaln\u0131zca Liderlerin birinci seviye Yer \u0130\u015fareti Klas\u00f6rleri olu\u015fturmas\u0131na izin verin.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument=Yaln\u0131zca Liderlerin birinci seviye Yer \u0130\u015fareti Klas\u00f6rleri olu\u015fturmas\u0131na izin verin.
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument.tooltip=Etkinken yaln\u0131zca Liderler birinci seviye Yer \u0130\u015fareti Klas\u00f6rleri (Yer \u0130\u015fareti K\u00f6k Klas\u00f6rleri) olu\u015fturabilir. Devre d\u0131\u015f\u0131 b\u0131rak\u0131ld\u0131\u011f\u0131nda Kat\u0131l\u0131mc\u0131lar, Yazarlar ve Liderler birinci seviye Yer \u0130\u015fareti Klas\u00f6rleri olu\u015fturabilir.


#Error message
WorkspaceMdl.ObjectAccess.NoAccessToAddRemove=Bu nesne i\u00e7in eri\u015fim Verme, \u0130ptal Etme veya De\u011fi\u015ftirme yetkisine sahip de\u011filsiniz.
WorkspaceMdl.Workspace.AlreadyExists=Ayn\u0131 ada sahip Yer \u0130\u015fareti Klas\u00f6r\u00fc zaten mevcut
WorkspaceMdl.WorkspaceDelete.Msg=Gerekli izinlere sahip olmayabilirsiniz veya Yer \u0130\u015fareti Klas\u00f6r\u00fc ya da alt Yer \u0130\u015fareti Klas\u00f6rlerinden biri rotalar veya g\u00f6r\u00fc\u015fmeler i\u00e7eriyor olabilir. Gerekli sorumlulu\u011fa sahip oldu\u011funuzu ve Yer \u0130\u015fareti Klas\u00f6r\u00fc ya da alt Yer \u0130\u015fareti Klas\u00f6rleri \u00fczerinde rota veya g\u00f6r\u00fc\u015fme olmad\u0131\u011f\u0131n\u0131 do\u011frulay\u0131n.
WorkspaceMdl.FolderOwnershipRuleError=Klas\u00f6r Sahiplik Kural\u0131 \u0130hlali
WorkspaceMdl.FolderContentOwnershipRuleError=Klas\u00f6r \u0130\u00e7eri\u011fi Sahiplik Kural\u0131 \u0130hlali
WorkspaceMdl.Workspace.MsgChangeContentFrozen=Olgunluk durumu nedeniyle bu Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fcn i\u00e7eri\u011fini de\u011fi\u015ftiremezsiniz. L\u00fctfen i\u00e7eri\u011fin de\u011fi\u015ftirilmesine izin veren bir duruma d\u00fc\u015f\u00fcr\u00fcn.
WorkspaceMdl.Workspace.MsgChangeStructureFrozen=Olgunluk durumu nedeniyle bu Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fcn yap\u0131s\u0131n\u0131 de\u011fi\u015ftiremezsiniz. L\u00fctfen yap\u0131n\u0131n de\u011fi\u015ftirilmesine izin veren bir duruma d\u00fc\u015f\u00fcr\u00fcn.
WorkspaceMdl.Workspace.MsgNoChangeStructureAccess=Bu Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fcn yap\u0131s\u0131n\u0131 de\u011fi\u015ftirmek i\u00e7in gerekli g\u00fcvenlik ba\u011flam\u0131n\u0131z yok.
WorkspaceMdl.WorkspaceMdlUtil.ErrorCreatingObjectType="{0}" tipinde nesne olu\u015fturulurken hata olu\u015ftu
WorkspaceMdl.WorkspaceVault.PersonalFolderMoveCopyError=Ki\u015fisel Yer \u0130\u015fareti Klas\u00f6rleri, farkl\u0131 bir Kullan\u0131c\u0131n\u0131n Ki\u015fisel Yer \u0130\u015fareti Klas\u00f6rlerinin alt\u0131na ta\u015f\u0131namaz veya kopyalanamaz.
WorkspaceMdl.WorkspaceVault.AccessError=\u015eununla ilgili eri\u015fimin yetersiz olmas\u0131 nedeniyle Kopyalama/Ta\u015f\u0131ma i\u015flemi tamamlanam\u0131yor: 
WorkspaceMdl.WorkspaceVault.CopyError=Yer \u0130\u015fareti Klas\u00f6rleri/Alt Yer \u0130\u015fareti Klas\u00f6rleri i\u00e7eriklerinin baz\u0131lar\u0131na uygun eri\u015fiminiz olmad\u0131\u011f\u0131 i\u00e7in kopyalanam\u0131yor.
WorkspaceMdl.WorkspaceVault.MoveCopyAccrossDifferentFolderError=\u0130ki farkl\u0131 Yer \u0130\u015fareti Klas\u00f6r\u00fc t\u00fcr\u00fc aras\u0131nda Yer \u0130\u015fareti Klas\u00f6r\u00fc Kopyalama/Ta\u015f\u0131ma i\u015flemleri desteklenmez.
WorkspaceMdl.WorkspaceVault.CloneCopyError=<BOOKMARK> Yer \u0130\u015fareti Klas\u00f6r\u00fc ayn\u0131 ada sahip alt Yer \u0130\u015fareti Klas\u00f6r\u00fc olan bir Yer \u0130\u015fareti K\u00f6k Klas\u00f6r\u00fc'ne kopyalanamaz/ta\u015f\u0131namaz/klonlanamaz; l\u00fctfen farkl\u0131 bir hedef se\u00e7in.
WorkspaceMdl.WorkspaceVault.MoveCopyFolderError=Bir Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fcn alt \u00f6\u011felerden birine ta\u015f\u0131nmas\u0131na izin verilmez
WorkspaceMdl.WorkspaceVault.CannotCopyMoveLinkToInvalidFolder=Do\u011frudan \u00fcst \u00f6\u011feyi/ayn\u0131 Yer \u0130\u015fareti Klas\u00f6r\u00fcn\u00fc/alt \u00f6\u011fe Alt Yer \u0130\u015fareti Klas\u00f6rlerini Kopyalama/Ta\u015f\u0131ma/Ba\u011flama i\u015flemleri yap\u0131lamaz; l\u00fctfen farkl\u0131 bir hedef se\u00e7in.
WorkspaceMdl.WorkspaceVault.MoveCopyAccessError=Kullan\u0131c\u0131n\u0131n i\u015flem i\u00e7in Yetkisi yok.
WorkspaceMdl.WorkspaceVault.MoveOperationError=Kullan\u0131c\u0131n\u0131n Yer \u0130\u015fareti Klas\u00f6rleri/Alt Yer \u0130\u015fareti Klas\u00f6rleri i\u00e7eri\u011finin biri veya daha fazlas\u0131 i\u00e7in okuma eri\u015fimi olmad\u0131\u011f\u0131ndan ta\u015f\u0131ma i\u015flemi ger\u00e7ekle\u015ftirilemiyor.
WorkspaceMdl.MoveCopyContent.ContentExistsInSourceFolderError=nesne zaten ayn\u0131 Yer \u0130\u015fareti Klas\u00f6r\u00fc'ne ba\u011fl\u0131.
WorkspaceMdl.MoveCopyContent.DoesnotExistsInSourceFolderError=Kaynak Yer \u0130\u015fareti Klas\u00f6r\u00fc'nde en az bir i\u00e7erik mevcut de\u011fil.
WorkspaceMdl.WorkspaceVault.CloneStructureError=Se\u00e7ili yap\u0131 kopyalanam\u0131yor. Bu i\u015flemi ger\u00e7ekle\u015ftirmek i\u00e7in yap\u0131n\u0131n t\u00fcm elemanlar\u0131na eri\u015fim gerekir.
WorkspaceMdl.CopyFolder.ErrorCopyInDescendant=Bir Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fcn alt \u00f6\u011felerden birine kopyalanmas\u0131na izin verilmez.
WorkspaceMdl.Workspace.ErrorBulkDelete=A\u015fa\u011f\u0131daki Yer \u0130\u015fareti Klas\u00f6rleri silinemedi. Eri\u015fim veya olgunluk durumu, yap\u0131daki bir nesnenin silinmesini engelliyor olabilir.
WorkspaceMdl.LinkFolder.CannotLinkToInvalidFolder=Do\u011frudan \u00fcst \u00f6\u011feyi/ayn\u0131 Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fc/alt \u00f6\u011fe Alt Yer \u0130\u015fareti Klas\u00f6rlerini hedef alan Ba\u011flant\u0131 i\u015flemleri yerine getirilemez; l\u00fctfen farkl\u0131 bir hedef se\u00e7in.
WorkspaceMdl.LinkFolder.AlreadyLinkedBookmark=Yer \u0130\u015fareti Klas\u00f6r\u00fc zaten bu Yer \u0130\u015fareti Klas\u00f6r\u00fc ile ba\u011flant\u0131l\u0131
WorkspaceMdl.SequenceOrder.InvalidConnectionId=S\u0131ralanacak ba\u011flant\u0131 kimli\u011fi ge\u00e7ersiz.
WorkspaceMdl.SequenceOrder.InvalidInputConnection=Ge\u00e7ersiz girdi ba\u011flant\u0131lar\u0131. Bunlar ayn\u0131 \u00fcst \u00f6\u011fenin alt\u0131nda olmal\u0131d\u0131r.
WorkspaceMdl.SequenceOrder.NoSortAccess=Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fc bu \u00fcst \u00f6\u011fenin alt\u0131nda s\u0131ralama eri\u015fiminiz yok.
WorkspaceMdl.links.ErrorNoAddRemoveModifyLinkAccess=Bu Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fcn ba\u011flant\u0131lar\u0131n\u0131 eklemek, kald\u0131rmak veya de\u011fi\u015ftirmek i\u00e7in gerekli eri\u015fiminiz yok.
WorkspaceMdl.links.InvalidUriPattern=Ba\u011flant\u0131 i\u00e7in ge\u00e7ersiz e\u015fle\u015fme dizesi belirtildi. Ge\u00e7erli e\u015fle\u015fme dizeleri i\u00e7in belgeleri kontrol edin.
WorkspaceMdl.links.UriAlreadyExists=Bu referansta {0} i\u015flemi yapamazs\u0131n\u0131z \u00e7\u00fcnk\u00fc i\u00e7erdi\u011fi URL hedef Yer \u0130\u015fareti Klas\u00f6r\u00fc'nde zaten mevcut.
WorkspaceMdl.links.InvalidLinkId=Ge\u00e7ersiz veya eri\u015filemeyen ba\u011flant\u0131 kimli\u011fi iletildi.
WorkspaceMdl.Workspace.MsgNoChangeContentAccess=Bu Yer \u0130\u015fareti Klas\u00f6r\u00fc'n\u00fcn i\u00e7eri\u011fini de\u011fi\u015ftirmek i\u00e7in gerekli g\u00fcvenlik ba\u011flam\u0131n\u0131z yok.


# Tree Node Properties
WorkspaceMdl.Command.Subfolder=Alt Yer \u0130\u015fareti Klas\u00f6rleri


# Route Wizard
WorkspaceMdl.Bookmarks.Owner=Sahip

# Bookmark Folder Display Names
WorkspaceMdl.type.Workspace=Yer \u0130\u015fareti K\u00f6k Klas\u00f6r\u00fc
WorkspaceMdl.type.WorkspaceVault=Yer \u0130\u015fareti Klas\u00f6r\u00fc

WorkspaceMdl.Common.AlreadyExists=Zaten mevcut
