#
#   Copyright (c) 1992-2020 Dassault Systemes.
#   All Rights Reserved.
#

# Parameterization
OOTBParameterization.LifecycleTopology.Workspace=\u66f8\u7c64\u8cc7\u6599\u593e
OOTBParameterization.LifecycleTopology.Workspace.Workspace=\u66f8\u7c64\u6839\u8cc7\u6599\u593e
OOTBParameterization.LifecycleTopology.Workspace.Workspace_Vault=\u66f8\u7c64\u8cc7\u6599\u593e

# Parameterization for BookmarkCreateInWork
#Domain
OOTBParameterization.BookmarkMdl=\u66f8\u7c64\u8cc7\u6599\u593e
OOTBParameterization.BookmarkMdl.tooltip=\u5141\u8a31\u5b9a\u7fa9\u898f\u5247\u4ee5\u81ea\u8a02\u66f8\u7c64\u8cc7\u6599\u593e\u884c\u70ba

#Family
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience=\u8a2d\u5b9a\u66f8\u7c64\u8cc7\u6599\u593e\u7d93\u9a57

#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork=\u5efa\u7acb\u66f8\u7c64\u8cc7\u6599\u593e\u6642\uff0c\u5c07\u6210\u719f\u72c0\u614b\u8a2d\u5b9a\u70ba\u300c\u5de5\u4f5c\u4e2d\u300d
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.tooltip=\u9078\u64c7\u4ee5\u5efa\u7acb\u66f8\u7c64\u8cc7\u6599\u593e\u70ba\u300c\u5de5\u4f5c\u4e2d\u300d\u72c0\u614b\uff0c\u53d6\u6d88\u9078\u64c7\u4ee5\u5efa\u7acb\u70ba\u300c\u8349\u7a3f\u300d\u72c0\u614b
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument=\u5efa\u7acb\u66f8\u7c64\u8cc7\u6599\u593e\u6642\uff0c\u5c07\u6210\u719f\u72c0\u614b\u8a2d\u5b9a\u70ba\u300c\u5de5\u4f5c\u4e2d\u300d
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkCreateInWork.Argument.tooltip=\u9078\u64c7\u4ee5\u5efa\u7acb\u66f8\u7c64\u8cc7\u6599\u593e\u70ba\u300c\u5de5\u4f5c\u4e2d\u300d\u72c0\u614b\uff0c\u53d6\u6d88\u9078\u64c7\u4ee5\u5efa\u7acb\u70ba\u300c\u8349\u7a3f\u300d\u72c0\u614b


# Parameterization for BookmarkRootRestrictCreateToLeader
#Parameter
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader=\u50c5\u5141\u8a31\u4e3b\u7ba1\u5efa\u7acb\u7b2c\u4e00\u5c64\u66f8\u7c64\u8cc7\u6599\u593e\u3002
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument=\u50c5\u5141\u8a31\u4e3b\u7ba1\u5efa\u7acb\u7b2c\u4e00\u5c64\u66f8\u7c64\u8cc7\u6599\u593e\u3002
OOTBParameterization.BookmarkMdl.ConfigureBookmarkExperience.BookmarkRootRestrictCreateToLeader.Argument.tooltip=\u958b\u555f\u6642\uff0c\u50c5\u6709\u4e3b\u7ba1\u80fd\u5efa\u7acb\u7b2c\u4e00\u5c64\u66f8\u7c64\u8cc7\u6599\u593e (\u66f8\u7c64\u6839\u8cc7\u6599\u593e)\u3002\u95dc\u9589\u6642\uff0c\u53c3\u8207\u8005\u3001\u4f5c\u8005\u548c\u4e3b\u7ba1\u90fd\u80fd\u5efa\u7acb\u7b2c\u4e00\u5c64\u66f8\u7c64\u8cc7\u6599\u593e\u3002


#Error message
WorkspaceMdl.ObjectAccess.NoAccessToAddRemove=\u60a8\u6c92\u6709\u6388\u8207\u3001\u64a4\u56de\u6216\u4fee\u6539\u6b64\u7269\u4ef6\u5b58\u53d6\u6b0a\u7684\u6b0a\u9650\u3002
WorkspaceMdl.Workspace.AlreadyExists=\u64c1\u6709\u76f8\u540c\u540d\u7a31\u7684\u66f8\u7c64\u8cc7\u6599\u593e\u5df2\u7d93\u5b58\u5728
WorkspaceMdl.WorkspaceDelete.Msg=\u60a8\u53ef\u80fd\u6c92\u6709\u5fc5\u8981\u6b0a\u9650\uff0c\u6216\u662f\u8a72\u66f8\u7c64\u8cc7\u6599\u593e\u6216\u5176\u6b21\u66f8\u7c64\u8cc7\u6599\u593e\u4e4b\u4e00\u5305\u542b\u7c3d\u6838\u6d41\u7a0b\u6216\u8a0e\u8ad6\u3002\u8acb\u78ba\u8a8d\u60a8\u64c1\u6709\u5fc5\u8981\u8cac\u4efb\u4e14\u8a72\u66f8\u7c64\u8cc7\u6599\u593e\u6216\u5176\u4efb\u4f55\u6b21\u66f8\u7c64\u8cc7\u6599\u593e\u6c92\u6709\u7c3d\u6838\u6d41\u7a0b\u6216\u8a0e\u8ad6\u3002
WorkspaceMdl.FolderOwnershipRuleError=\u8cc7\u6599\u593e\u64c1\u6709\u6b0a\u898f\u5247\u9055\u898f
WorkspaceMdl.FolderContentOwnershipRuleError=\u8cc7\u6599\u593e\u5167\u5bb9\u64c1\u6709\u6b0a\u898f\u5247\u9055\u898f
WorkspaceMdl.Workspace.MsgChangeContentFrozen=\u56e0\u70ba\u6b64\u66f8\u7c64\u8cc7\u6599\u593e\u7684\u6210\u719f\u72c0\u614b\uff0c\u6545\u60a8\u7121\u6cd5\u8b8a\u66f4\u5176\u5167\u5bb9\u3002\u8acb\u964d\u7d1a\u81f3\u5141\u8a31\u8b8a\u66f4\u5167\u5bb9\u7684\u72c0\u614b\u3002
WorkspaceMdl.Workspace.MsgChangeStructureFrozen=\u56e0\u70ba\u6b64\u66f8\u7c64\u8cc7\u6599\u593e\u7684\u6210\u719f\u72c0\u614b\uff0c\u6545\u60a8\u7121\u6cd5\u8b8a\u66f4\u5176\u7d50\u69cb\u3002\u8acb\u964d\u7d1a\u81f3\u5141\u8a31\u8b8a\u66f4\u7d50\u69cb\u7684\u72c0\u614b\u3002
WorkspaceMdl.Workspace.MsgNoChangeStructureAccess=\u60a8\u6c92\u6709\u53ef\u8b8a\u66f4\u6b64\u66f8\u7c64\u8cc7\u6599\u593e\u7d50\u69cb\u7684\u5b89\u5168\u6027\u95dc\u806f\u3002
WorkspaceMdl.WorkspaceMdlUtil.ErrorCreatingObjectType=\u5efa\u7acb\u7269\u4ef6\u985e\u578b\u300c{0}\u300d\u6642\u767c\u751f\u932f\u8aa4
WorkspaceMdl.WorkspaceVault.PersonalFolderMoveCopyError=\u5728\u4e0d\u540c\u7684\u4f7f\u7528\u8005\u500b\u4eba\u66f8\u7c64\u8cc7\u6599\u593e\u4e4b\u4e0b\uff0c\u7121\u6cd5\u79fb\u52d5\u6216\u8907\u88fd\u500b\u4eba\u66f8\u7c64\u8cc7\u6599\u593e\u3002
WorkspaceMdl.WorkspaceVault.AccessError=\u8907\u88fd/\u79fb\u52d5\u64cd\u4f5c\u7121\u6cd5\u5b8c\u6210\uff0c\u56e0\u70ba\u4ee5\u4e0b\u5b58\u53d6\u6b0a\u4e0d\u8db3\uff1a 
WorkspaceMdl.WorkspaceVault.CopyError=\u7121\u6cd5\u8907\u88fd\uff0c\u56e0\u70ba\u60a8\u672a\u7372\u90e8\u5206\u66f8\u7c64\u8cc7\u6599\u593e/\u6b21\u66f8\u7c64\u8cc7\u6599\u593e\u5167\u5bb9\u7684\u9069\u7576\u5b58\u53d6\u6b0a\u9650\u3002
WorkspaceMdl.WorkspaceVault.MoveCopyAccrossDifferentFolderError=\u4e0d\u652f\u63f4\u5728\u5169\u500b\u4e0d\u540c\u985e\u578b\u66f8\u7c64\u8cc7\u6599\u593e\u4e4b\u9593\u9032\u884c\u66f8\u7c64\u8cc7\u6599\u593e\u8907\u88fd/\u79fb\u52d5\u64cd\u4f5c\u3002
WorkspaceMdl.WorkspaceVault.CloneCopyError=\u7121\u6cd5\u8907\u88fd/\u79fb\u52d5/\u4eff\u88fd\u66f8\u7c64<BOOKMARK>\u81f3\u5305\u542b\u64c1\u6709\u76f8\u540c\u540d\u7a31\u4e4b\u5b50\u66f8\u7c64\u8cc7\u6599\u593e\u7684\u66f8\u7c64\u6839\u8cc7\u6599\u593e\uff0c\u8acb\u9078\u64c7\u4e0d\u540c\u7684\u76ee\u7684\u5730\u3002
WorkspaceMdl.WorkspaceVault.MoveCopyFolderError=\u4e0d\u5141\u8a31\u5c07\u66f8\u7c64\u8cc7\u6599\u593e\u79fb\u81f3\u5176\u4e2d\u4e00\u500b\u4e0b\u4ee3
WorkspaceMdl.WorkspaceVault.CannotCopyMoveLinkToInvalidFolder=\u7121\u6cd5\u8907\u88fd/\u79fb\u52d5/\u9023\u7d50\u81f3\u76f4\u5c6c\u7236\u9805/\u76f8\u540c\u66f8\u7c64\u8cc7\u6599\u593e/\u5b50\u9805\u6b21\u66f8\u7c64\u8cc7\u6599\u593e\uff0c\u8acb\u9078\u64c7\u4e0d\u540c\u7684\u76ee\u7684\u5730\u3002
WorkspaceMdl.WorkspaceVault.MoveCopyAccessError=\u4f7f\u7528\u8005\u6c92\u6709\u6b0a\u9650\u9032\u884c\u64cd\u4f5c\u3002
WorkspaceMdl.WorkspaceVault.MoveOperationError=\u7121\u6cd5\u57f7\u884c\u79fb\u52d5\u64cd\u4f5c\uff0c\u56e0\u70ba\u4f7f\u7528\u8005\u5c0d\u65bc\u4e00\u500b\u6216\u4ee5\u4e0a\u7684\u66f8\u7c64\u8cc7\u6599\u593e/\u6b21\u66f8\u7c64\u8cc7\u6599\u593e\u5167\u5bb9\u6c92\u6709\u8b80\u53d6\u5b58\u53d6\u6b0a\u3002
WorkspaceMdl.MoveCopyContent.ContentExistsInSourceFolderError=\u7269\u4ef6\u5df2\u7d93\u9023\u63a5\u5230\u76f8\u540c\u7684\u66f8\u7c64\u8cc7\u6599\u593e\u3002
WorkspaceMdl.MoveCopyContent.DoesnotExistsInSourceFolderError=\u4f86\u6e90\u66f8\u7c64\u8cc7\u6599\u593e\u4e2d\u7f3a\u5c11\u4e86\u81f3\u5c11\u5176\u4e2d\u4e00\u7a2e\u5167\u5bb9\u3002
WorkspaceMdl.WorkspaceVault.CloneStructureError=\u6240\u9078\u7d50\u69cb\u7121\u6cd5\u4eff\u88fd\u3002\u8981\u57f7\u884c\u9019\u500b\u64cd\u4f5c\uff0c\u5fc5\u9808\u64c1\u6709\u7d50\u69cb\u4e2d\u5168\u90e8\u5143\u7d20\u7684\u5b58\u53d6\u6b0a
WorkspaceMdl.CopyFolder.ErrorCopyInDescendant=\u4e0d\u5141\u8a31\u8907\u88fd\u5176\u4e2d\u4e00\u500b\u4e0b\u4ee3\u4e2d\u7684\u66f8\u7c64\u8cc7\u6599\u593e\u3002
WorkspaceMdl.Workspace.ErrorBulkDelete=\u4e0b\u5217\u66f8\u7c64\u8cc7\u6599\u593e\u7121\u6cd5\u522a\u9664\u3002\u53ef\u80fd\u7684\u539f\u56e0\u70ba\u5b58\u53d6\u6b0a\u6216\u6210\u719f\u72c0\u614b\u9650\u5236\u522a\u9664\u7d50\u69cb\u88e1\u7684\u7269\u4ef6\u3002
WorkspaceMdl.LinkFolder.CannotLinkToInvalidFolder=\u7121\u6cd5\u9023\u7d50\u81f3\u76f4\u5c6c\u7236\u9805/\u76f8\u540c\u66f8\u7c64\u8cc7\u6599\u593e/\u5b50\u9805\u6b21\u66f8\u7c64\u8cc7\u6599\u593e\uff0c\u8acb\u9078\u64c7\u4e0d\u540c\u7684\u76ee\u7684\u5730\u3002
WorkspaceMdl.LinkFolder.AlreadyLinkedBookmark=\u66f8\u7c64\u8cc7\u6599\u593e\u5df2\u9023\u7d50\u81f3\u6b64\u66f8\u7c64\u8cc7\u6599\u593e
WorkspaceMdl.SequenceOrder.InvalidConnectionId=\u8981\u6392\u5e8f\u7684\u9023\u63a5 Id \u7121\u6548\u3002
WorkspaceMdl.SequenceOrder.InvalidInputConnection=\u8f38\u5165\u9023\u63a5\u7121\u6548\u3002\u9019\u4e9b\u5fc5\u9808\u96b8\u5c6c\u65bc\u76f8\u540c\u7684\u7236\u9805\u6b21\u3002
WorkspaceMdl.SequenceOrder.NoSortAccess=\u60a8\u6c92\u6709\u6b0a\u9650\u5728\u6b64\u7236\u9805\u4e0b\u6392\u5e8f\u66f8\u7c64\u8cc7\u6599\u593e\u3002
WorkspaceMdl.links.ErrorNoAddRemoveModifyLinkAccess=\u60a8\u6c92\u6709\u65b0\u589e\u3001\u79fb\u9664\u6216\u4fee\u6539\u6b64\u66f8\u7c64\u8cc7\u6599\u593e\u9023\u7d50\u7684\u5fc5\u8981\u5b58\u53d6\u6b0a\u3002
WorkspaceMdl.links.InvalidUriPattern=\u6307\u5b9a\u7d66\u9023\u7d50\u7684\u7121\u6548\u6a21\u5f0f\u3002\u6aa2\u67e5\u6587\u4ef6\u7684\u6709\u6548\u6a21\u5f0f\u3002
WorkspaceMdl.links.UriAlreadyExists=\u60a8\u7121\u6cd5{0}\u6b64\u53c3\u8003\uff0c\u56e0\u70ba\u5176\u5167\u542b\u7684 URI \u5df2\u5b58\u5728\u65bc\u76ee\u6a19\u66f8\u7c64\u8cc7\u6599\u593e\u3002
WorkspaceMdl.links.InvalidLinkId=\u5df2\u901a\u904e\u7121\u6548\u6216\u7121\u6cd5\u5b58\u53d6\u7684\u9023\u7d50 ID\u3002
WorkspaceMdl.Workspace.MsgNoChangeContentAccess=\u60a8\u6c92\u6709\u53ef\u8b8a\u66f4\u6b64\u66f8\u7c64\u8cc7\u6599\u593e\u5167\u5bb9\u7684\u5b89\u5168\u6027\u95dc\u806f\u3002


# Tree Node Properties
WorkspaceMdl.Command.Subfolder=\u6b21\u66f8\u7c64\u8cc7\u6599\u593e


# Route Wizard
WorkspaceMdl.Bookmarks.Owner=\u64c1\u6709\u8005

# Bookmark Folder Display Names
WorkspaceMdl.type.Workspace=\u66f8\u7c64\u6839\u8cc7\u6599\u593e
WorkspaceMdl.type.WorkspaceVault=\u66f8\u7c64\u8cc7\u6599\u593e

WorkspaceMdl.Common.AlreadyExists=\u5df2\u7d93\u5b58\u5728
