{
  "RISK": "Risque",
  "RISKS": "Risques",
  "IMPACT": "Impact",
  "CLASS_TYPE": "Type de risque",
  "ABATEMENT": "Plan de diminution",
  "RPN": "Evaluation",
  "RISK_TREND": "Tendance du risque",
  "SHOW_COMPLETED": "Afficher les risques terminés",
  "ALL_CONTEXT_ITEMS": "Tous les risques liés au contexte",
  "ALL_PROJECT_RISKS": "Tous les risques de projet",
  "OWNED": "Mes risques",
  "ALL_MY_ASSIGNED_ITEMS": "Tout (Mes risques + affectés)",
  "PROJECT_RISKS": "Risques de projet",
  "SUB_PROJECT_RISKS": "Risques du projet + sous-projet",
  "ASSOCIATED_RISKS": "Risques associés",
  "RISK_PROFILE": "Profil de risque",
  "FROM_PROFILE": "Depuis le profil",
  "RISK_TEMPLATE": "Modèle de risque",
  "DUPLICATE_NO_CONTEXT_ACCESS": "Vous ne disposez peut-être pas d'un accès contextuel pour effectuer des duplications des objets suivants ",
  "RISK_PROFILE_DOES_NOT_EXIST": "Le profil de risque n'existe pas",
  "RISK_PROFILE_EXECUTION_CONTEXT_NOT_SUPPORTED": "L'exécution du profil de risque pour le contexte sélectionné n'est pas prise en charge",
  "TOOLTIP_ROOT_CAUSE": "Cause racine du risque.",
  "TOOLTIP_CONTEXT": "Contexte du risque. Cela peut comprendre un projet d'entreprise, un projet, une tâche, un document, un fournisseur ou un portefeuille.",
  "TOOLTIP_MATRIX_CONFIGURATION": "Configuration connectée au contexte. Si le contexte possède plusieurs configurations, une liste répertorie toutes les configurations connectées au contexte tout en créant le premier risque sous ce contexte ou dans les propriétés d'un risque non valide créé sous ce contexte.",
  "TOOLTIP_EFFECTIVE_DATE": "Date d'effet pour le risque.",
  "TOOLTIP_IMPACT": "Impact du risque. Les valeurs par défaut sont 1-Négligeable, 2-Mineur, 3-Modéré, 4-Majeur ou 5-Elevé. Pour définir d'autres valeurs, vous pouvez personnaliser la configuration de la matrice.",
  "TOOLTIP_PROBABILITY": "Probabilité du risque. Les valeurs par défaut sont 1-Rare, 2-Improbable, 3-Possible, 4-Probable ou 5-Presque certain.  Pour définir d'autres valeurs, vous pouvez personnaliser la configuration de la matrice.",
  "TOOLTIP_RATING": "Cette valeur est basée sur les valeurs que vous sélectionnez dans Impact et Probabilité. La carte thermique du risque reflète ces valeurs.",
  "TOOLTIP_SEVERITY": "La gravité est basée sur les valeurs Impact et Probabilité saisies. Par exemple, avec les valeurs par défaut, un impact de '2' et une probabilité de '4' donnent un niveau de risque calculé de 2 dans la configuration de la matrice de risque. Par conséquent, la gravité s'affiche comme '2-Moyen'. '2' reflète le niveau du risque et 'Moyen' représente la valeur de gravité respective.",
  "TOOLTIP_IMPACT_GOAL": "Notation du plan d'atténuation du risque ou d'autres actions. Les valeurs par défaut sont 1-Négligeable, 2-Mineur, 3-Modéré, 4-Majeur ou 5-Elevé. Pour définir d'autres valeurs, vous pouvez personnaliser la configuration de la matrice.",
  "TOOLTIP_PROBABILITY_GOAL": "Probabilité d'achèvement de l'objectif. Les valeurs par défaut sont 1-Rare, 2-Improbable, 3-Possible, 4-Probable ou 5-Presque certain. Pour définir d'autres valeurs, vous pouvez personnaliser la configuration de la matrice.",
  "TOOLTIP_RISK_RATING_GOAL": "Cette valeur est basée sur les valeurs que vous sélectionnez dans 'Objectif d'impact' et 'Objectif de probabilité'.",
  "TOOLTIP_HEATMAP": "Si des informations d'objectif sont saisies, la carte thermique affiche des informations de statut de l'objectif. Les cellules présentant une répétition se situent dans les limites de l'objectif. L'objectif est représenté par un cercle ; la notation courante est accompagnée d'une coche. Une coche dans le cercle indique que l'objectif et la notation sont identiques. Vous pouvez cliquer dans une cellule sur la carte thermique pour affecter 'l'impact' et la 'probabilité' au risque.",
  "TOOLTIP_TYPE_OF": "Utilisé pour classifier les risques. Les valeurs comprennent Coût, Qualité, Technique, Ressource, Performance, Confidentialité, Sécurité, Calendrier, Avantages, Fabricabilité et Autre",
  "TOOLTIP_MATURITY_STATE": "Etat de maturité du risque. Les valeurs sont Brouillon, A faire, En traitement, En approbation ou Terminé.",
  "TOOLTIP_ORGANIZATION": "Organisation à laquelle appartient le risque.",
  "TOOLTIP_COLLABORATIVE_SPACE": "Espace de collaboration dans lequel ce risque est créé."
}
