{
  "RISK": "Risiko",
  "RISKS": "Risiken",
  "IMPACT": "Auswirkung",
  "CLASS_TYPE": "Risikotyp",
  "ABATEMENT": "Sanierungsplan",
  "RPN": "Bewertung",
  "RISK_TREND": "Risikotrend",
  "SHOW_COMPLETED": "Abgeschlossene Risiken einblenden",
  "ALL_CONTEXT_ITEMS": "Alle Kontextrisiken",
  "ALL_PROJECT_RISKS": "Alle Projektrisiken",
  "OWNED": "Meine Risiken",
  "ALL_MY_ASSIGNED_ITEMS": "Alle (Meine Risiken + Zugewiesen)",
  "PROJECT_RISKS": "Projektrisiken",
  "SUB_PROJECT_RISKS": "Projekt- und Teilprojektrisiken",
  "ASSOCIATED_RISKS": "Zugeordnete Risiken",
  "RISK_PROFILE": "Risikoprofil",
  "FROM_PROFILE": "Aus Profil",
  "RISK_TEMPLATE": "Risiko-Vorlage",
  "DUPLICATE_NO_CONTEXT_ACCESS": "Sie haben möglicherweise keinen Kontextzugriff, um Duplizierungen der folgenden Objekte auszuführen ",
  "RISK_PROFILE_DOES_NOT_EXIST": "Risikoprofil ist nicht vorhanden",
  "RISK_PROFILE_EXECUTION_CONTEXT_NOT_SUPPORTED": "Die Ausführung des Risikoprofils für den ausgewählten Kontext wird nicht unterstützt",
  "TOOLTIP_ROOT_CAUSE": "Die Grundursache des Risikos.",
  "TOOLTIP_CONTEXT": "Der Kontext für das Risiko. Dies kann ein Unternehmensprojekt, ein Projekt, eine Aufgabe, ein Dokument, einen Lieferanten, oder Portfolio enthalten.",
  "TOOLTIP_MATRIX_CONFIGURATION": "Die mit dem Kontext verbundene Konfiguration. Wenn der Kontext mehrere Konfigurationen hat, zeigt eine Liste alle Konfigurationen an, die mit dem Kontext verbunden sind, während das erste Risiko unter diesem Kontext erzeugt wird, oder in den Eigenschaften für ein ungültiges Risiko, das unter diesem Kontext erzeugt wurde.",
  "TOOLTIP_EFFECTIVE_DATE": "Das Datum, an dem das Risiko wirksam wird.",
  "TOOLTIP_IMPACT": "Die Auswirkung des Risikos. Die Standardwerte sind 1-Vernachlässigbar, 2-Geringfügig, 3-Mäßig, 4-Schwer oder 5-Hoch. Um andere Werte zu definieren, können Sie die Matrixkonfiguration anpassen.",
  "TOOLTIP_PROBABILITY": "Die Wahrscheinlichkeit des Auftretens des Risikos. Die Standardwerte sind 1-Selten, 2-Unwahrscheinlich, 3-Möglich, 4-Wahrscheinlich oder 5-Fast sicher. Um andere Werte zu definieren, können Sie die Matrixkonfiguration anpassen.",
  "TOOLTIP_RATING": "Dieser Wert basiert auf den Werten, die Sie unter Auswirkung und Wahrscheinlichkeit auswählen. Die Risiko-Heatmap spiegelt diese Werte wider.",
  "TOOLTIP_SEVERITY": "Der Schweregrad basiert auf der eingegebenen Auswirkung und Wahrscheinlichkeit. Wenn Sie beispielsweise die Standardwerte verwenden, führen eine Auswirkung von „2“ und eine Wahrscheinlichkeit von „4“ zu einer berechneten Risikostufe von 2 in der Risikomatrixkonfiguration. Daher wird der Schweregrad als „2-Mittel“ angezeigt. „2“ steht für die Risikostufe und „Mittel“ für den jeweiligen Schweregrad.",
  "TOOLTIP_IMPACT_GOAL": "Eine Bewertung des Risikominderungsplans oder anderer Maßnahmen. Die Standardwerte sind 1-Vernachlässigbar, 2-Geringfügig, 3-Mäßig, 4-Schwer oder 5-Hoch. Um andere Werte zu definieren, können Sie die Matrixkonfiguration anpassen.",
  "TOOLTIP_PROBABILITY_GOAL": "Die Abschlusswahrscheinlichkeit des Ziels. Die Standardwerte sind 1-Selten, 2-Unwahrscheinlich, 3-Möglich, 4-Wahrscheinlich oder 5-Fast sicher. Um andere Werte zu definieren, können Sie die Matrixkonfiguration anpassen.",
  "TOOLTIP_RISK_RATING_GOAL": "Dieser Wert basiert auf den Werten, die Sie unter „Auswirkungsziel“ und „Wahrscheinlichkeitsziel“ auswählen.",
  "TOOLTIP_HEATMAP": "Wenn Zielinformationen eingegeben werden, zeigt die Heatmap Informationen zum Zielstatus an. Zellen mit einem Muster liegen innerhalb des Ziellimits. Das Ziel wird durch einen Kreis dargestellt, die aktuelle Bewertung ist mit einem Häkchen versehen. Ein Häkchen innerhalb des Kreises zeigt an, dass das Ziel und die Bewertung identisch sind. Sie können in eine Zelle in der Heatmap klicken, um dem Risiko „Auswirkung“ und „Wahrscheinlichkeit“ zuzuweisen.",
  "TOOLTIP_TYPE_OF": "Wird zur Klassifizierung von Risiken verwendet. Zu den Werten zählen „Kosten“, „Qualität“, „Technik“, „Ressource“, „Leistung“, „Datenschutz“, „Sicherheit“, „Zeitplan“, „Vorteile“, „Herstellbarkeit“, und „Andere“",
  "TOOLTIP_MATURITY_STATE": "Der Bearbeitungsstatus des Risikos. Die Werte sind „Entwurf“, „Zu erledigen“, „In Bearbeitung“, „In Genehmigung“ oder „Abgeschlossen“.",
  "TOOLTIP_ORGANIZATION": "Die Organisation, zu der dieses Risiko gehört.",
  "TOOLTIP_COLLABORATIVE_SPACE": "Der Teamarbeitsbereich, in dem dieses Risiko entsteht."
}
