{
  "RISK": "Rischio",
  "RISKS": "Rischi",
  "IMPACT": "Impatto",
  "CLASS_TYPE": "Tipo di rischio",
  "ABATEMENT": "Piano di abbattimento",
  "RPN": "Valutazione",
  "RISK_TREND": "Trend di rischio",
  "SHOW_COMPLETED": "Mostra rischi completati",
  "ALL_CONTEXT_ITEMS": "Tutti i rischi di contesto",
  "ALL_PROJECT_RISKS": "Tutti i rischi del progetto",
  "OWNED": "Rischi personali",
  "ALL_MY_ASSIGNED_ITEMS": "Tutto (rischi personali + assegnati)",
  "PROJECT_RISKS": "Rischi progetto",
  "SUB_PROJECT_RISKS": "Rischi progetto + sottoprogetto",
  "ASSOCIATED_RISKS": "Rischi associati",
  "RISK_PROFILE": "Profilo di rischio",
  "FROM_PROFILE": "Dal profilo",
  "RISK_TEMPLATE": "Modello di rischio",
  "DUPLICATE_NO_CONTEXT_ACCESS": "È possibile che non si disponga dell'accesso al contesto per effettuare duplicati dei seguenti oggetti ",
  "RISK_PROFILE_DOES_NOT_EXIST": "Il profilo di rischio non esiste",
  "RISK_PROFILE_EXECUTION_CONTEXT_NOT_SUPPORTED": "L'esecuzione del profilo di rischio per il contesto selezionato non è supportata",
  "TOOLTIP_ROOT_CAUSE": "La causa principale del rischio.",
  "TOOLTIP_CONTEXT": "Il contesto del rischio. Questo può includere un progetto aziendale, un progetto, un'attività, un documento, un fornitore o un portfolio.",
  "TOOLTIP_MATRIX_CONFIGURATION": "La configurazione collegata al contesto. Se il contesto ha più configurazioni, un elenco mostra tutte le configurazioni collegate al contesto durante la creazione del primo rischio in quel contesto o nelle proprietà di un rischio non valido creato in quel contesto.",
  "TOOLTIP_EFFECTIVE_DATE": "La data in cui il rischio diventa valido.",
  "TOOLTIP_IMPACT": "L'impatto del rischio. I valori predefiniti sono 1-Trascurabile, 2-Minimo, 3-Moderato, 4-Importante o 5-Elevato. Per definire altri valori, è possibile personalizzare la Configurazione della matrice.",
  "TOOLTIP_PROBABILITY": "La probabilità che si verifichi il rischio. I valori predefiniti sono 1-Raro, 2-Improbabile, 3-Probabile, 4-Molto probabile, o 5-Quasi certo.  Per definire altri valori, è possibile personalizzare la Configurazione della matrice.",
  "TOOLTIP_RATING": "Questo valore si basa sui valori selezionati in Impatto e Probabilità. La mappa termica del rischio riflette questi valori.",
  "TOOLTIP_SEVERITY": "La gravità si basa sull'Impatto e sulla Probabilità immessi. Ad esempio, utilizzando i valori predefiniti, un Impatto di '2' e una Probabilità di '4' determinano un livello di rischio calcolato di 2 nella configurazione della matrice di rischio. Pertanto, la gravità viene visualizzata come '2-Medio'. '2' riflette il livello di rischio e 'Medio' è il rispettivo valore di gravità.",
  "TOOLTIP_IMPACT_GOAL": "Una valutazione del piano di mitigazione del rischio o di altre azioni. I valori predefiniti sono 1-Trascurabile, 2-Minimo, 3-Moderato, 4-Importante o 5-Elevato. Per definire altri valori, è possibile personalizzare la Configurazione della matrice.",
  "TOOLTIP_PROBABILITY_GOAL": "La probabilità di completamento dell'obiettivo. I valori predefiniti sono 1-Raro, 2-Improbabile, 3-Probabile, 4-Molto probabile o 5-Quasi certo. Per definire altri valori, è possibile personalizzare la Configurazione della matrice.",
  "TOOLTIP_RISK_RATING_GOAL": "Questo valore si basa sui valori selezionati in 'Obiettivo impatto' e 'Obiettivo probabilità'.",
  "TOOLTIP_HEATMAP": "Se sono state inserite informazioni sull'obiettivo, la mappa termica mostra le informazioni sullo stato dell'obiettivo. Le celle che presentano una ripetizione rientrano nel limite dell'obiettivo. L'obiettivo è rappresentato da un cerchio; la valutazione attuale è contrassegnata da un segno di spunta. Un segno di spunta all'interno del cerchio indica che l'obiettivo e la valutazione sono uguali. È possibile fare clic all'interno di una cella della mappa termica per assegnare 'Impatto' e 'Probabilità' al rischio.",
  "TOOLTIP_TYPE_OF": "Utilizzato per classificare i rischi. I valori includono Costo, Qualità, Tecnico, Risorsa, Prestazioni, Privacy, Sicurezza, Programma, Profitti, Potenzialità di produzione e Altro",
  "TOOLTIP_MATURITY_STATE": "Lo stato di maturità del rischio. I valori sono Bozza, Da fare, In corso, In approvazione o Completato.",
  "TOOLTIP_ORGANIZATION": "L'organizzazione a cui appartiene questo rischio.",
  "TOOLTIP_COLLABORATIVE_SPACE": "L'area di collaborazione in cui viene creato questo rischio."
}
