{
  "RISK": "Ryzyko",
  "RISKS": "Ryzyka",
  "IMPACT": "Wpływ",
  "CLASS_TYPE": "Typ ryzyka",
  "ABATEMENT": "Plan redukcji",
  "RPN": "Ocena",
  "RISK_TREND": "Trend ryzyka",
  "SHOW_COMPLETED": "Pokaż zakończone ryzyka",
  "ALL_CONTEXT_ITEMS": "Wszystkie ryzyka kontekstowe",
  "ALL_PROJECT_RISKS": "Wszystkie ryzyka projektowe",
  "OWNED": "Moje ryzyka",
  "ALL_MY_ASSIGNED_ITEMS": "Wszystkie (Moje ryzyka + Przypisano)",
  "PROJECT_RISKS": "Ryzyka projektowe",
  "SUB_PROJECT_RISKS": "Ryzyka projektowe + podprojektowe",
  "ASSOCIATED_RISKS": "Powiązane ryzyka",
  "RISK_PROFILE": "Profil ryzyka",
  "FROM_PROFILE": "Z profilu",
  "RISK_TEMPLATE": "Szablon ryzyka",
  "DUPLICATE_NO_CONTEXT_ACCESS": "Być może nie masz dostępu kontekstowego do powielania następujących obiektów ",
  "RISK_PROFILE_DOES_NOT_EXIST": "Profil ryzyka nie istnieje",
  "RISK_PROFILE_EXECUTION_CONTEXT_NOT_SUPPORTED": "Wykonanie profilu ryzyka dla wybranego kontekstu nie jest obsługiwane",
  "TOOLTIP_ROOT_CAUSE": "Główna przyczyna ryzyka.",
  "TOOLTIP_CONTEXT": "Kontekst ryzyka. Może to być Projekt Enterprise, Projekt, Zadanie, Dokument, Dostawca lub Oferta.",
  "TOOLTIP_MATRIX_CONFIGURATION": "Konfiguracja połączona z kontekstem. Jeżeli kontekst ma wiele konfiguracji, lista pokazuje wszystkie konfiguracje połączone z kontekstem podczas tworzenia pierwszego ryzyka w tym kontekście lub we właściwościach dla nieprawidłowego ryzyka utworzonego w tym kontekście.",
  "TOOLTIP_EFFECTIVE_DATE": "W tym polu wyświetla się data wejścia w życie ryzyka.",
  "TOOLTIP_IMPACT": "Wpływ ryzyka. Wartości domyślne to 1-Pomijalne, 2-Minimalne, 3-Umiarkowane, 4-Duże lub 5-Wysokie. Aby zdefiniować inne wartości, można dostosować konfigurację macierzy.",
  "TOOLTIP_PROBABILITY": "Prawdopodobieństwo wystąpienia ryzyka. Wartości domyślne to 1-Rzadkie, 2-Mało prawdopodobne, 3-Możliwe, 4-Prawdopodobne lub 5-Prawie pewne. Aby zdefiniować inne wartości, można dostosować konfigurację macierzy.",
  "TOOLTIP_RATING": "Wartość ta jest oparta na wartościach wybranych w oknie Wpływ i prawdopodobieństwo. Mapa cieplna ryzyka odzwierciedla te wartości.",
  "TOOLTIP_SEVERITY": "Istotność jest oparta na wprowadzonym wpływie i prawdopodobieństwie. Na przykład w przypadku użycia wartości domyślnych wpływ o wartości „2” i prawdopodobieństwo o wartości „4” powoduje uzyskanie obliczonego poziomu ryzyka 2 w konfiguracji macierzy ryzyka. Z tego względu stopień istotności jest wyświetlany jako „2-Średni”. „2” odzwierciedla poziom ryzyka, a „Średni” to odpowiednia wartość istotności.",
  "TOOLTIP_IMPACT_GOAL": "Ocena planu ograniczania ryzyka lub innych działań. Wartości domyślne to 1-Pomijalne, 2-Minimalne, 3-Umiarkowane, 4-Duże lub 5-Wysokie. Aby zdefiniować inne wartości, można dostosować konfigurację macierzy.",
  "TOOLTIP_PROBABILITY_GOAL": "Prawdopodobieństwo realizacji celu. Wartości domyślne to 1-Rzadkie, 2-Mało prawdopodobne, 3-Możliwe, 4-Prawdopodobne lub 5-Prawie pewne. Aby zdefiniować inne wartości, można dostosować konfigurację macierzy.",
  "TOOLTIP_RISK_RATING_GOAL": "Wartość ta jest oparta na wartościach wybranych w polach „Cel wpływu” i „Cel prawdopodobieństwa”.",
  "TOOLTIP_HEATMAP": "Po wprowadzeniu informacji o celu mapa cieplna wyświetla informacje o stanie celu. Komórki mające wzór znajdują się w granicach celu. Cel jest reprezentowany przez okrąg; bieżąca ocena ma znak zaznaczenia. Znak zaznaczenia wewnątrz okręgu oznacza, że cel i ocena są takie same. Możesz kliknąć wewnątrz komórki na mapie cieplnej, aby przypisać „Wpływ” i „Prawdopodobieństwo” do ryzyka.",
  "TOOLTIP_TYPE_OF": "Służy do klasyfikacji ryzyka. Wartości obejmują Koszty, Jakość, Kwestie techniczne, Zasoby, Wydajność, Prywatność, Bezpieczeństwo, Harmonogram, Korzyści, Wykonalność i Inne.",
  "TOOLTIP_MATURITY_STATE": "W tym polu znajduje się stan dojrzałości ryzyka. Wartości to Szkic, Do wykonania, Przetwarzanie, W zatwierdzeniu lub Zakończone.",
  "TOOLTIP_ORGANIZATION": "Organizacja, do której należy to ryzyko.",
  "TOOLTIP_COLLABORATIVE_SPACE": "Przestrzeń współpracy, w której powstaje to ryzyko."
}
