{
  "({0} Administrators)": "({0} Yönetici)",
  "An error occurred while retrieving the data": "Veriler alınırken bir hata oluştu",
  "Cancel": "İptal",
  "Capacity almost reached": "Kapasite dolmak üzere",
  "Expiring Soon": "Süresi Yakında Doluyor",
  "Granted": "Verildi",
  "Granted Roles": "Verilen Roller",
  "Invite Members": "Üyeleri Davet Et",
  "Members": "Üyeler",
  "Pending Invitations": "Bekleyen Davetler",
  "Pending Requests": "Bekleyen Talepler",
  "Remaining Invitations": "Kalan Davetler",
  "Rename": "Yeniden Adlandır",
  "Requests": "İstekler",
  "Roles": "Roller",
  "Roles Expire Soon": "Roller Yakında Sona Eriyor",
  "Save": "Kaydet",
  "Storage": "Depolama",
  "To do that, go to the next Tab: \"Members\".": "Bunu yapmak için bir sonraki \"Üyeler\" sekmesine gidin.",
  "Total capacity: {0}": "Toplam kapasite: {0}",
  "Upgrade Storage": "Depolamayı Yükselt",
  "Used: {0}": "Kullanılan: {0}",
  "Welcome to your platform": "Platformunuza hoş geldiniz",
  "You have been selected as an administrator to manage users & roles.": "Kullanıcıları ve rolleri yönetmek için yönetici olarak seçildiniz.",
  "Only roles whose license will expire in less than 30 days": "Yalnızca lisansı 30 günden kısa bir süre içinde sona erecek olan roller",
  "Only roles whose usage capacity exceeds 90%": "Yalnızca kullanım kapasitesi %90'ı aşan roller",
  "Begin by going to the next tab, “Members”, where you can invite other users and give them access to apps by granting them roles.": "Diğer kullanıcıları davet edebileceğiniz ve onlara roller vererek uygulamalara erişmelerini sağlayabileceğiniz bir sonraki sekme olan “Üyeler” sekmesine giderek başlayın.",
  "Use the 3DDashboard left panel to switch to a different dashboard, such as My First Dashboard. You can also create your own dashboard.": "3DDashboard sol panelini kullanarak İlk Panom gibi farklı bir panoya geçin. Kendi panonuzu da oluşturabilirsiniz.",
  "Be sure to give yourself the roles you need, too.": "Ayrıca kendinize ihtiyacınız olan rolleri verdiğinizden emin olun.",
  "Find your apps in Compass. Some apps can be dragged onto the dashboard, and some launch in other windows.": "Uygulamalarınızı Pusula'da bulun. Bazı uygulamalar panoya sürüklenebilir ve bazıları diğer pencerelerde başlatılır.",
  "This is the Members Management dashboard.": "Bu, Üye Yönetimi panosudur.",
  "This is the Platform Management dashboard.": "Bu, Platform Yönetimi panosudur."
}