# Copyright (c) 1992-2025 Dassault Systemes.
# All Rights Reserved.

# NLS UI Label
dsimpl.Create.Success=\u5b9f\u88c5\u30ea\u30f3\u30af\u3092\u6b63\u5e38\u306b\u4f5c\u6210\u3057\u307e\u3057\u305f
dsimpl.Create.Error=\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u4f5c\u6210\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
dsimpl.Delete.Success=\u5b9f\u88c5\u30ea\u30f3\u30af\u3092\u6b63\u5e38\u306b\u524a\u9664\u3057\u307e\u3057\u305f
dsimpl.Delete.Error=\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u524a\u9664\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
dsimpl.OptionNotAuthorized.Error=\u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u30e9\u30a4\u30bb\u30f3\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044
dsimpl.TypeNotSupported.Error=\u7121\u52b9\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30bf\u30a4\u30d7\u3067\u3059\u3002\u30bf\u30a4\u30d7%1\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

dsimpl.Create.Failure.Error=\u9805\u76ee%1\u306e\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u4f5c\u6210\u306f\u3001\u30a8\u30e9\u30fc\u30b9\u30c6\u30fc\u30bf\u30b9%2\u306b\u3088\u308a\u5931\u6557\u3057\u307e\u3057\u305f
dsimpl.Create.AlreadyExist.Error=\u9805\u76ee%1\u306e\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u5b9f\u88c5\u5143\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3068\u5b9f\u88c5\u5148\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u9593\u306b\u306f\u3059\u3067\u306b\u5b9f\u88c5\u30ea\u30f3\u30af\u304c\u5b58\u5728\u3057\u307e\u3059
dsimpl.Create.PatternNOTAuthorized.Error=\u9805\u76ee%1\u306e\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u5b9f\u88c5\u5143\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30bf\u30a4\u30d7\u3068\u5b9f\u88c5\u5148\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30bf\u30a4\u30d7\u306e\u9593\u3067\u306f\u3001\u30d1\u30bf\u30fc\u30f3\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093
dsimpl.Create.FailedInBL.Error=\u9805\u76ee%1\u306e\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af\u306e\u5b9f\u884c\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
dsimpl.Create.NotAuthorizedByBL.Error=\u9805\u76ee%1\u306e\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30d3\u30b8\u30cd\u30b9\u30ed\u30b8\u30c3\u30af\u306b\u3088\u3063\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093
dsimpl.Delete.TypeNotSupported.Error=\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u524a\u9664\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u7121\u52b9\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30bf\u30a4\u30d7\u3067\u3059\u3002\u30bf\u30a4\u30d7%1\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

dsimpl.Navigate.InvalidValueForIdentifier.Error=\u8b58\u5225\u5b50\u306e\u5024\u304c\u7121\u52b9\u3067\u3059\uff1a%1
dsimpl.Navigate.TypeNotSupported.Error=\u7121\u52b9\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30bf\u30a4\u30d7\u3067\u3059\u3002\u30bf\u30a4\u30d7%1\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
dsimpl.Navigate.InternalError.Error=\u5185\u90e8\u30a8\u30e9\u30fc
dsimpl.Navigate.ListSizeDifferent.Error=\u5185\u90e8\u30a8\u30e9\u30fc\u3002\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u30ea\u30b9\u30c8\u3068\u3001\u5b9f\u88c5\u5143\u3068\u5b9f\u88c5\u5148\u306e\u30ea\u30b9\u30c8\u306e\u30b5\u30a4\u30ba\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093
dsimpl.Navigate.OccOccNotSupported.Error=\u7121\u52b9\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30bf\u30a4\u30d7\u3067\u3059\u3002\u30aa\u30ab\u30ec\u30f3\u30b9\u9593\u5b9f\u88c5\u30ea\u30f3\u30af\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

dsimpl.InternalError.ParentNotFound.Error=\u5185\u90e8\u30a8\u30e9\u30fc\u3002\u5b9f\u88c5\u30ea\u30f3\u30af\u306e\u89aa\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093

Payload.InvalidValueForKey.Error=\u7121\u52b9\u306a\u30da\u30a4\u30ed\u30fc\u30c9\u3002\u30d5\u30a3\u30fc\u30eb\u30c9%1\u306e\u5024\u304c\u7121\u52b9\u3067\u3059
Payload.InvalidMissingMandatoryKey.Error=\u7121\u52b9\u306a\u30da\u30a4\u30ed\u30fc\u30c9\u3002\u5fc5\u9808\u30d5\u30a3\u30fc\u30eb\u30c9%1\u304c\u5165\u529b\u3055\u308c\u3066\u3044\u307e\u305b\u3093
Payload.InvalidEmptyStringValue.Error=\u7121\u52b9\u306a\u30da\u30a4\u30ed\u30fc\u30c9\u3002%1\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7a7a\u306b\u3059\u308b\u3053\u3068\u3082\u3001\u7a7a\u767d\u306e\u307f\u306b\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u305b\u3093
Payload.InvalidValueForIdentifier.Error=\u7121\u52b9\u306a\u30da\u30a4\u30ed\u30fc\u30c9\u3002\u8b58\u5225\u5b50%1\u306e\u5024\u304c\u7121\u52b9\u3067\u3059
Payload.AttributeValueExceedMaxLength.Error=\u9805\u76ee%1\u306e\u30da\u30a4\u30ed\u30fc\u30c9\u304c\u7121\u52b9\u3067\u3059\u3002 \u2019%2\u2019 \u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5024\u306f%3\u6587\u5b57\u3092\u8d85\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
Payload.NumberOfItemsExceedMaxSize.Error=\u7121\u52b9\u306a\u30da\u30a4\u30ed\u30fc\u30c9\u3002%1\u914d\u5217\u304c%2\u8981\u7d20\u3092\u542b\u307f\u3001%3\u306e\u30b5\u30a4\u30ba\u5236\u9650\u3092\u8d85\u3048\u3066\u3044\u307e\u3059

dsimpl.referencedObjects.Field=\u53c2\u7167\u30aa\u30d6\u30b8\u30a7\u30af\u30c8
dsimpl.FTACnxType.Field=FTACnxType

