{
  "reserveTitle": "Bloquear",
  "unreserveTitle": "Desbloquear",
  "instance": "Instância",
  "reference": "Referência",
  "referenceInstance": "Referência e instância",
  "instances": "Instâncias ",
  "references": "Referências ",
  "reserveQuestion": "Você deseja bloquear os objetos selecionados?",
  "reserveFailed": "Falha ao bloquear",
  "unreserveFailed": "Falha ao desbloquear",
  "okButton": "Ok",
  "cancelButton": "Cancelar",
  "choiceButton": "Lembre-se da minha escolha",
  "selections": "Seleções",
  "noObject": "É necessário selecionar um objeto",
  "epmtyPhysicalId": "O código de identificação físico está vazio",
  "ErrorSecurityContext": "Não é possível obter o contexto de segurança atual",
  "ErrorSecurityContextEmpty": "Não é possível obter o contexto de segurança atual. Escolha um contexto de segurança para sua conta (botão Início)",
  "reservationSucceeded": "Êxito ao bloquear",
  "unreservationSucceeded": "Êxito ao desbloquear",
  "reserving": "Bloqueando...",
  "unreserving": "Desbloqueando...",
  "v5InstancesExcluded": "Os seguintes objetos foram excluídos desta operação porque representam instâncias do CATIA V5:",
  "error in list": "Alguns dos objetos selecionados não foram bloqueados como ",
  "referenceLockTooltip": "Uma referência é um objeto que pode ser usado em estruturas diferentes. O bloqueio da referência afeta todas as estruturas que a utilizam.",
  "instanceLockTooltip": "Uma instância é o uso de uma referência em uma estrutura. Bloquear uma instância bloqueia apenas esse uso. A referência relacionada e suas outras instâncias não são afetadas.",
  "referenceInstanceLockTooltip": "Uma referência é um objeto usado em várias estruturas e o bloqueio afeta todas as estruturas que o utilizam. Uma instância é um uso específico de uma referência em uma estrutura e bloqueá-la afeta somente esse uso, sem afetar a referência ou suas outras instâncias.",
  "referenceUnlockTooltip": "Uma referência é um objeto que pode ser usado em estruturas diferentes. Desbloquear a referência afeta todas as estruturas que a utilizam.",
  "instanceUnlockTooltip": "Uma instância é o uso de uma referência em uma estrutura. Desbloquear uma instância bloqueia apenas esse uso. A referência relacionada e suas outras instâncias não são afetadas.",
  "referenceInstanceUnlockTooltip": "Uma referência é um objeto usado em várias estruturas e o desbloqueio afeta todas as estruturas que o utilizam. Uma instância é um uso específico de uma referência em uma estrutura e desbloqueá-la afeta somente esse uso, sem afetar a referência ou suas outras instâncias.",
  "swInfo": "Bloquear uma referência de formato diferente de 3DEXPERIENCE CAD bloqueia suas instâncias filhas."
}
