{
  "reserveTitle": "Заблокировать",
  "unreserveTitle": "Разблокировать",
  "instance": "Экземпляр",
  "reference": "Ссылка",
  "referenceInstance": "Ссылка и экземпляр",
  "instances": "Экземпляры ",
  "references": "Ссылки ",
  "reserveQuestion": "Заблокировать выбранные объекты?",
  "reserveFailed": "Сбой блокировки",
  "unreserveFailed": "Сбой разблокировки",
  "okButton": "OK",
  "cancelButton": "Отмена",
  "choiceButton": "Запомнить мой выбор",
  "selections": "Выбранные элементы",
  "noObject": "Необходимо выбрать объект",
  "epmtyPhysicalId": "Пустой физический ИД",
  "ErrorSecurityContext": "Невозможно получить текущий контекст безопасности",
  "ErrorSecurityContextEmpty": "Невозможно получить текущий контекст безопасности. Выберите контекст безопасности для вашей учетной записи (кнопка Главная)",
  "reservationSucceeded": "Блокировка выполнена",
  "unreservationSucceeded": "Разблокировка выполнена",
  "reserving": "Блокировка...",
  "unreserving": "Разблокировка...",
  "v5InstancesExcluded": "Следующие объекты исключены из этой операции, так как они представляют экземпляры CATIA V5:",
  "error in list": "Некоторые из выбранных объектов не заблокированы как ",
  "referenceLockTooltip": "Ссылка — это объект, который может использоваться в различных структурах. Блокировка ссылки влияет на все структуры, которые ее используют.",
  "instanceLockTooltip": "Экземпляр — это использование ссылки в структуре. Блокировка экземпляра блокирует только это использование. Соответствующая ссылка и другие ее экземпляры не затрагиваются.",
  "referenceInstanceLockTooltip": "Ссылка — это объект, который используется в нескольких структурах, и блокировка этого объекта влияет на все структуры, которые его используют. Экземпляр — это конкретное использование ссылки в структуре, и блокировка экземпляра влияет только на это использование, не затрагивая ссылку или другие ее экземпляры.",
  "referenceUnlockTooltip": "Ссылка — это объект, который может использоваться в различных структурах. Разблокировка ссылки влияет на все структуры, которые ее используют.",
  "instanceUnlockTooltip": "Экземпляр — это использование ссылки в структуре. Разблокировка экземпляра блокирует только это использование. Соответствующая ссылка и другие ее экземпляры не затрагиваются.",
  "referenceInstanceUnlockTooltip": "Ссылка — это объект, который используется в нескольких структурах, и разблокировка этого объекта влияет на все структуры, которые его используют. Экземпляр — это конкретное использование ссылки в структуре, и разблокировка экземпляра влияет только на это использование, не затрагивая ссылку или другие ее экземпляры.",
  "swInfo": "Блокировка ссылки на формат САПР, отличный от 3DEXPERIENCE, блокирует дочерние экземпляры."
}
