{
  "reserveTitle": "Bloquear",
  "unreserveTitle": "Desbloquear",
  "instance": "Instancia",
  "reference": "Referencia",
  "referenceInstance": "Referencia e instancia",
  "instances": "Instancias ",
  "references": "Referencias ",
  "reserveQuestion": "¿Desea bloquear los objetos seleccionados?",
  "reserveFailed": "Error al bloquear",
  "unreserveFailed": "Error al desbloquear",
  "okButton": "Aceptar",
  "cancelButton": "Cancelar",
  "choiceButton": "Recordar mi elección",
  "selections": "Selecciones",
  "noObject": "Debe seleccionar un objeto",
  "epmtyPhysicalId": "El ID físico está vacío",
  "ErrorSecurityContext": "No puede obtenerse el contexto de seguridad actual",
  "ErrorSecurityContextEmpty": "No puede obtenerse el contexto de seguridad actual. Seleccione un contexto de seguridad para su cuenta (botón Inicio)",
  "reservationSucceeded": "Bloqueo realizado correctamente",
  "unreservationSucceeded": "Desbloqueo realizado correctamente",
  "reserving": "Bloqueando...",
  "unreserving": "Desbloqueando...",
  "v5InstancesExcluded": "Los siguientes objetos están excluidos de esta operación porque representan instancias de CATIA V5:",
  "error in list": "Algunos objetos seleccionados no se han bloqueado como ",
  "referenceLockTooltip": "Una referencia es un objeto que se puede utilizar en diferentes estructuras. El bloqueo de la referencia afecta a todas las estructuras que la utilizan.",
  "instanceLockTooltip": "Una instancia es el uso de una referencia en una estructura. El bloqueo de una instancia solo bloquea este uso. La referencia relacionada y sus otras instancias no se ven afectadas.",
  "referenceInstanceLockTooltip": "Una referencia es un objeto que se utiliza en varias estructuras y su bloqueo afecta a todas las estructuras que la utilizan. Una instancia es un uso específico de una referencia en una estructura, y bloquearla solo afecta a ese uso, no afecta a la referencia ni a sus otras instancias.",
  "referenceUnlockTooltip": "Una referencia es un objeto que se puede utilizar en diferentes estructuras. El desbloqueo de la referencia afecta a todas las estructuras que la utilizan.",
  "instanceUnlockTooltip": "Una instancia es el uso de una referencia en una estructura. El desbloqueo de una instancia solo bloquea este uso. La referencia relacionada y sus otras instancias no se ven afectadas.",
  "referenceInstanceUnlockTooltip": "Una referencia es un objeto que se utiliza en varias estructuras y su desbloqueo afecta a todas las estructuras que la utilizan. Una instancia es un uso específico de una referencia en una estructura y su desbloqueo solo afecta a ese uso, no afecta a la referencia ni a sus otras instancias.",
  "swInfo": "El bloqueo de una referencia de formato CAD que no sea 3DEXPERIENCE bloquea las instancias hijas."
}
