{
  "reserveTitle": "Blokuj",
  "unreserveTitle": "Odblokuj",
  "instance": "Wystąpienie",
  "reference": "Odniesienie",
  "referenceInstance": "Odniesienie i wystąpienie",
  "instances": "Wystąpienia ",
  "references": "Odniesienia ",
  "reserveQuestion": "Czy chcesz zablokować wybrane obiekty?",
  "reserveFailed": "Blokada nie powiodła się",
  "unreserveFailed": "Odblokowanie nie powiodło się",
  "okButton": "OK",
  "cancelButton": "Anuluj",
  "choiceButton": "Zapamiętaj mój wybór",
  "selections": "Wybory",
  "noObject": "Należy wybrać obiekt",
  "epmtyPhysicalId": "Identyfikator fizyczny jest pusty",
  "ErrorSecurityContext": "Nie można uzyskać bieżącego kontekstu zabezpieczeń",
  "ErrorSecurityContextEmpty": "Nie można uzyskać bieżącego kontekstu zabezpieczeń. Wybierz kontekst zabezpieczeń dla swojego konta (przycisk Strona główna)",
  "reservationSucceeded": "Blokada powiodła się",
  "unreservationSucceeded": "Odblokowanie powiodło się",
  "reserving": "Blokowanie...",
  "unreserving": "Odblokowywanie...",
  "v5InstancesExcluded": "Następujące obiekty są wykluczone z tej operacji, ponieważ reprezentują one wystąpienia CATIA V5:",
  "error in list": "Niektóre z wybranych obiektów nie zostały zablokowane jako ",
  "referenceLockTooltip": "Odniesienie to obiekt, który może być używany w różnych strukturach. Zablokowanie odniesienia ma wpływ na wszystkie używane struktury.",
  "instanceLockTooltip": "Wystąpienie to użycie odniesienia w strukturze. Blokowanie wystąpienia blokuje tylko to zastosowanie. Nie ma to wpływu na powiązane odniesienie i jego inne wystąpienia.",
  "referenceInstanceLockTooltip": "Odniesienie to obiekt, który jest wykorzystywany w wielu strukturach, a jego zablokowanie ma wpływ na wszystkie używane struktury. Wystąpienie to określone użycie odniesienia w strukturze i zablokowanie go ma wpływ tylko na to użycie, bez wpływu na odniesienie lub jego inne wystąpienia.",
  "referenceUnlockTooltip": "Odniesienie to obiekt, który może być używany w różnych strukturach. Odblokowanie odniesienia ma wpływ na wszystkie struktury, które go używają.",
  "instanceUnlockTooltip": "Wystąpienie to użycie odniesienia w strukturze. Odblokowanie wystąpienia blokuje tylko to zastosowanie. Nie ma to wpływu na powiązane odniesienie i jego inne wystąpienia.",
  "referenceInstanceUnlockTooltip": "Odniesienie to obiekt, który jest wykorzystywany w wielu strukturach, a jego odblokowanie ma wpływ na wszystkie używane struktury. Wystąpienie to określone użycie odniesienia w strukturze i odblokowanie go ma wpływ tylko na to użycie, bez wpływu na odniesienie lub jego inne wystąpienia.",
  "swInfo": "Zablokowanie odwołania do formatu innego niż 3DEXPERIENCE CAD, blokuje jego wystąpienia podrzędne."
}
