{
"ToggleAuxiliaryView.Title":"Hilfsansicht",
"ToggleAuxiliaryView.ShortHelp":"Öffnet die <wintitle>Hilfsansicht</wintitle> zur Verwaltung nicht klassifizierter Objekte.",
"SearchAndAddInstanceCommand.Title":"Einfügen",
"SearchAndAddInstanceCommand.ShortHelp":"<p>Fügt eine Instanz zu einem System hinzu oder wählt ein System in der App <wintitle>IP Classify and Reuse</wintitle> aus.</p>",
"SearchAndAddInstanceCommand.LongHelp":"<p>Geben Sie in der Suchleiste den Namen Ihrer Instanz ein. Wählen Sie die Instanz in der Datenbank aus und klicken Sie auf <uicontrol>Suchen</uicontrol> oder wählen Sie ein Fertigungselement in der App <wintitle>IP Classify & Reuse</wintitle> aus und klicken Sie auf <uicontrol>Einfügen</uicontrol>.</p>",
"InsertAsCopy.Title":"Als Kopie einfügen",
"InsertAsCopy.ShortHelp":"Wählen Sie ein System oder einen Vorgang in der App <wintitle>IP Classify and Reuse</wintitle> aus und klicken Sie auf <uicontrol>Als Kopie einfügen</uicontrol>.",
"DuplicateAdv.Title":"Erweitertes Duplizieren",
"DuplicateAdv.ShortHelp":"Dupliziert ein System und bietet die Möglichkeit, zugehörige Verknüpfungen beizubehalten.",
"DuplicateAdv.LongHelp":"Wählen Sie ein System aus und klicken Sie auf <uicontrol>Erweitertes Duplizieren</uicontrol>.",
"DetachInstance.Title":"Exemplar entfernen",
"DetachInstance.ShortHelp":"Löscht eine Instanz aus der aktuellen Systemstruktur.",
"DetachInstance.LongHelp":"Wählen Sie ein Objekt aus und klicken Sie auf <uicontrol>OK</uicontrol>, um den Löschvorgang zu bestätigen.",
"Relations.Title":"Beziehungsfenster",
"Relations.ShortHelp":"Zeigt die Kennung des Objekts an, das mit dem System oder einer Operation verknüpft ist.",
"OrderBySequence.Title":"Sequenzabhängig anordnen",
"OrderBySequence.ShortHelp":"<p>Sortiert Prozesse und Operationen nach ihrer Sequenz (Produktflüsse und Zeitbedingungen) in der Ansicht <wintitle>Prozesse & Operationen</wintitle>.</p>",
"CreateLink.Title":"Verknüpfung erstellen",
"CreateLink.ShortHelp":"Erstellt eine Verknüpfung zwischen einem System bzw. einer Operation und einem Fertigungselement bzw. einer Ressource.",
"CreateLink.LongHelp":"Mit diesem Befehl können Sie Verknüpfungen zwischen mehreren Elementen erstellen.",
"RelationalExplorerCmd.Title":"Zugehörige(s) Objekt(e)",
"RelationalExplorerCmd.ShortHelp":"Ermöglicht das Navigieren in Gültigkeitsbereichsverknüpfungen, Implementierungsverknüpfungen und geeigneten Ressourcen eines Objekts.",
"RelationalExplorerCmd.LongHelp":"Wählen Sie ein Objekt aus und klicken Sie auf <uicontrol>Zugehörige(s) Objekt(e)</uicontrol>.",
"Delete.Title":"System(e) löschen",
"Delete.ShortHelp":"Löscht die ausgewählte Systemstruktur.",
"Delete.LongHelp":"Wählen Sie mindestens ein System aus und klicken Sie auf den Befehl.",
"EditViewPreferences.Title":"Fenster „Voreinstellungen für Spaltenansicht anzeigen“",
"EditViewPreferences.ShortHelp":"Hier können Sie festlegen, welche Spalten angezeigt werden.",
"EditViewPreferences.LongHelp":"Aktivieren Sie in der Spalte <wintitle>Ist sichtbar</wintitle> das Kontrollkästchen der Spalten, die auf der Benutzeroberfläche angezeigt werden sollen, und deaktivieren Sie das Kontrollkästchen der Spalten, die ausgeblendet werden sollen. Die Spaltenbreite kann manuell angepasst werden.",
"LayoutPreferences.Title":"Fenster „Voreinstellungen für Ansichtslayout anzeigen“",
"LayoutPreferences.ShortHelp":"Ermöglicht das Verwalten von Widget-Layoutvoreinstellungen.",
"DefineFilter.Title":"Filter",
"DefineFilter.ShortHelp":"Filtert Objekte basierend auf Attributen oder Konfigurationen.",
"DefineFilter.LongHelp":"Der Filterbefehl ist nicht verfügbar, wenn „Erstellen“ aktiviert und der Datenbankmodus ausgewählt ist.",
"ManageInconsistentLinks.Title":"Abhängigkeitsverwaltung ändern",
"ManageInconsistentLinks.ShortHelp":"Verwaltet unvollständige oder inkonsistente Implementierungsverknüpfungen zwischen Systemen oder Operationen und Elementen.",
"ManageInconsistentLinks.LongHelp":"Das Fenster <wintitle>Inkonsistente Verknüpfungen verwalten</wintitle> listet inkonsistente Verknüpfungen zwischen Systemen oder Operationen und Elementen auf. <p>Klicken Sie im Fenster auf <uicontrol>Umleiten</uicontrol>, <uicontrol>Löschen</uicontrol> oder <uicontrol>Ignorieren</uicontrol>, um die Verknüpfungen zu korrigieren.</p>",
"BIEssentialsCmd.Title":"B.I. Essentials – Zuordnungsstatus",
"BIEssentialsCmd.ShortHelp":"Berechnet den Zuordnungsstatus des Fertigungselements und den Systemaktualisierungsstatus für die in der App geladene Struktur und zeigt sie als Farbcodes in den entsprechenden Ansichten an.",
"ProcessValidationCmd.Title":"Prozessvalidierung",
"ProcessValidationCmd.ShortHelp":"Analysiert die ausgewählte Arbeitsplanstruktur und die zugeordneten Objekte, um die Kompatibilität mit Planungs- und Ausführungsanwendungen sicherzustellen.",
"ReplaceByLatestRevision.Title":"Durch neueste Revision ersetzen",
"ReplaceByLatestRevision.ShortHelp":"Ersetzt einen untergeordneten Vorgang durch die neueste Revision und aktualisiert Produktflüsse sowie Implementierungsverknüpfungen.",
"ReplaceByLatestRevision.LongHelp":"Einen untergeordneten Vorgang auswählen und auf „<uicontrol>Durch die neueste Revision ersetzen</uicontrol>“ klicken.",
"ReplaceByExisting.Title":"Durch bestehende ersetzen",
"ReplaceByExisting.ShortHelp":"Ersetzt einen untergeordneten Vorgang durch einen bestehenden und aktualisiert Produktflüsse sowie Implementierungsverknüpfungen.",
"ReplaceByExisting.LongHelp":"Einen untergeordneten Vorgang auswählen und auf „<uicontrol>Durch einen bestehenden ersetzen</uicontrol>“ klicken. In der Suchleiste die Kriterien für einen bestehenden Vorgang in der Datenbank eingeben. Den Vorgang auswählen und auf „<uicontrol>OK</uicontrol>“ klicken.",
"ReplaceByNewRevision.Title":"Durch neue Revision ersetzen",
"ReplaceByNewRevision.ShortHelp":"Erstellt eine neue Revision eines untergeordneten Vorgangs, ersetzt diesen durch die neue Revision und aktualisiert Produktflüsse sowie Implementierungsverknüpfungen.",
"ReplaceByNewRevision.LongHelp":"Einen untergeordneten Vorgang auswählen und auf „<uicontrol>Durch die neue Revision ersetzen</uicontrol>“ klicken.",
"ReplaceByNewReference.Title":"Durch neue ersetzen",
"ReplaceByNewReference.ShortHelp":"Ersetzt eine Instanz einer Referenz durch eine Instanz einer neuen Referenz. Dadurch wird das Dialogfenster <wintitle>Durch neue ersetzen...</wintitle> angezeigt.",
"ReplaceWhereUsed.Title":"Verwendungsnachweis Aktionen",
"ReplaceWhereUsed.ShortHelp":"Ändert Aktionen auf Instanzen einer Fertigungs- und Systemstruktur umfangreich.",
"ReplaceWhereUsed.LongHelp":"Wählen Sie eine Aktion pro Verwendung aus und klicken Sie auf <uicontrol>Anwenden</uicontrol>, um die Änderungen zu bestätigen.",
"UserDefinedExplore.Title":"Benutzerdefiniertes Untersuchen",
"UserDefinedExplore.ShortHelp":"Öffnet das Dialogfeld <wintitle>Benutzerdefiniertes Untersuchen</wintitle>.",
"UserDefinedExplore.LongHelp":"Wählen Sie im Feld <wintitle>Liste aller Verfahren</wintitle> entweder den Standardeintrag aus, woraufhin <uicontrol>Beziehungen in Ansichten laden</uicontrol> erscheint, oder eines der verfügbaren benutzerdefinierten (JavaScript-)Verfahren. Wenn Sie auf <uicontrol>Ausführen</uicontrol> klicken, wird dieses Verfahren mit dem ausgewählten Objekte als Eingabe ausgeführt und die zurückgegebenen Objekte werden in die entsprechenden Ansichten geladen.<p> <note type = 'notes'> <ul> <li>Die Verfügbarkeit der Verfahren hängt von dem ausgewählten Objekt ab. Wenn kein Objekt ausgewählt ist, wird das Dialogfeld nicht angezeigt und das Standardverhalten <uicontrol>Beziehungen in Ansichten laden</uicontrol> wird angewendet.</li> <li>Die benutzerdefinierten Verfahren müssen die Eigenschaft <codeph>VerfKategorie</codeph> mit dem Wert <codeph>Benutzerdefiniert</codeph> enthalten, bevor sie im Server bereitgestellt und in die Liste aufgenommen werden können.</li> </ul> </note> </p>",
"SetThePartNumber.Title":"Unternehmenselementnummer",
"SetThePartNumber.ShortHelp":"Definiert die Unternehmenselementnummer",
"SetThePartNumber.LongHelp":"<p>Wählen Sie mindestens ein Element oder eine Ressource aus, um deren Unternehmenselementnummer festzulegen. Eine Unternehmenselementnummer ist eine eindeutige Zeichenfolge alphanumerischer Zeichen. Sie können eine Unternehmenselementnummer für die Referenz des gefertigten Elements definieren, um dieses gefertigte Element von allen anderen gefertigten Elementen oder Ressourcen im System zu unterscheiden.</p>",
"Show3DViewerCmd.Title":"3DOperations Viewer öffnen",
"Show3DViewerCmd.ShortHelp":"Öffnet die <wintitle>3DOperations Viewer</wintitle> App im Vorschaumodus.",
"Show3DViewerCmd.LongHelp":"Wählen Sie im Fenster <wintitle>Objekte für 3D Operations Viewer auswählen</wintitle>, das angezeigt wird, das bevorzugte Fertigungselement aus, das dem System zugeordnet ist und in den Viewer geladen werden soll. Dieses Dialogfeld wird nicht angezeigt, wenn nur ein System geladen ist, dem nur ein Fertigungselement zugeordnet ist.",
"BuildUpReviewModeCmd.Title":"Build-Up-Prüfmodus",
"BuildUpReviewModeCmd.ShortHelp":"Startet die Funktion <wintitle>Build-Up</wintitle> im Überprüfungsmodus für schnelle Tastaturinteraktion.",
"BuildUpReviewModeCmd.LongHelp":"<p>Der <wintitle>Build-Up</wintitle>-Überprüfungsmodus ermöglicht es, Folgendes zu visualisieren: <ul> <li>Die 3D-Darstellung eines Produkts oder einer Ressource</li> <li>Das Build-Up-Ergebnis im <wintitle>3D Viewer</wintitle>.</li> </ul> </p> <p>Dadurch wird eine 3D-Spalte in der Ansicht <wintitle>Prozesse & Operationen</wintitle> angezeigt, wenn das Widget <wintitle>3D Viewer</wintitle> mit der App verknüpft ist. Bei Auswahl einer Zeile wird das Ergebnis vom Build-Up in der Ansicht angezeigt.</p> <p>Dieser Befehl ist nur aktiv, wenn das Widget <wintitle>3D Viewer</wintitle> mit der App verknüpft ist.</p>",
"ToggleAuxiliaryView.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DuplicateAdv.WebHelp":"SharedUserMap/lifecycle-t-DuplicateAdvanced.htm",
"Delete.WebHelp":"SharedUserMap/lifecycle-t-Delete.htm",
"LayoutPreferences.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DefineFilter.WebHelp":"DelMgaUserMap/delmfna-m-Filter-sb.htm",
"BIEssentialsCmd.WebHelp":"DelMgaUserMap/delmga-t-BIEssentials.htm",
"ReplaceByLatestRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithItsLatestRevision",
"ReplaceByExisting.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithanExistingObject",
"ReplaceByNewRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithaNewRevision",
"ReplaceByNewReference.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#task_h3x_ykz_gsb",
"Show3DViewerCmd.WebHelp":"DelOerUserMap/deloer-c-ov.htm"
}
