{
"ToggleAuxiliaryView.Title":"Vue auxiliaire",
"ToggleAuxiliaryView.ShortHelp":"Ouvre la <wintitle>Vue auxiliaire</wintitle> pour gérer les objets non classés.",
"SearchAndAddInstanceCommand.Title":"Insérer",
"SearchAndAddInstanceCommand.ShortHelp":"<p>Ajoute une instance à un système ou sélectionne un système dans l'app <wintitle>IP Classify and Reuse</wintitle></p>",
"SearchAndAddInstanceCommand.LongHelp":"<p>Dans la barre de recherche, entrez le nom de votre instance. Sélectionnez l'instance dans la base de données et cliquez sur <uicontrol>Rechercher</uicontrol> ou sélectionnez un élément fabriqué dans l'app <wintitle>IP Classify and Reuse</wintitle> et cliquez sur <uicontrol>Insérer</uicontrol>.</p>",
"InsertAsCopy.Title":"Insérer comme copie",
"InsertAsCopy.ShortHelp":"Sélectionnez un système ou une opération à partir de l'app <wintitle>IP Classify and Reuse</wintitle> et cliquez sur <uicontrol>Insérer comme copie</uicontrol>.",
"DuplicateAdv.Title":"Duplication avancée",
"DuplicateAdv.ShortHelp":"Duplique un système avec l'option de conserver les liens connexes.",
"DuplicateAdv.LongHelp":"Sélectionnez un système et cliquez sur <uicontrol>Duplication avancée</uicontrol>.",
"DetachInstance.Title":"Détacher l'instance",
"DetachInstance.ShortHelp":"Supprime une instance de la structure de système actuelle.",
"DetachInstance.LongHelp":"Sélectionnez un objet et cliquez sur <uicontrol>OK</uicontrol> pour confirmer la suppression.",
"Relations.Title":"Panneau Relations",
"Relations.ShortHelp":"Affiche l'identificateur de l'objet lié à un système ou une opération.",
"OrderBySequence.Title":"Ordonner par séquence",
"OrderBySequence.ShortHelp":"<p>Trie les processus et les opérations en fonction de leur séquence (flux de produit et des contraintes de temps) dans la vue <wintitle>Processus & opérations</wintitle>.</p>",
"CreateLink.Title":"Créer un lien",
"CreateLink.ShortHelp":"Crée un lien entre un système ou une opération et un élément fabriqué ou une ressource.",
"CreateLink.LongHelp":"Cette commande vous permet de créer des liens entre plusieurs éléments.",
"RelationalExplorerCmd.Title":"Objet(s) lié(s)",
"RelationalExplorerCmd.ShortHelp":"Permet de parcourir les liens de portée, les liens d'implémentation et les ressources possibles d'un objet.",
"RelationalExplorerCmd.LongHelp":"Sélectionnez un objet puis cliquez sur <uicontrol>Objet(s) lié(s)</uicontrol>.",
"Delete.Title":"Supprimer le ou les systèmes",
"Delete.ShortHelp":"Supprime la structure de système sélectionnée.",
"Delete.LongHelp":"Sélectionnez un ou plusieurs systèmes et cliquez sur la commande.",
"EditViewPreferences.Title":"Afficher le panneau Afficher les préférences des colonnes",
"EditViewPreferences.ShortHelp":"Permet de définir es colonnes à afficher.",
"EditViewPreferences.LongHelp":"Dans la colonne <wintitle>Est visible</wintitle>, cochez la case des colonnes que vous souhaitez afficher dans l'interface, et décochez les cases des colonnes que vous souhaitez masquer. Vous pouvez ajuster manuellement la largeur des colonnes.",
"LayoutPreferences.Title":"Afficher le panneau Afficher les préférences de présentation",
"LayoutPreferences.ShortHelp":"Permet de gérer les préférences de présentation des widgets.",
"DefineFilter.Title":"Filtrer",
"DefineFilter.ShortHelp":"Filtre les objets en fonction des attributs ou des configurations.",
"DefineFilter.LongHelp":"La commande de filtre n'est pas disponible si le mode Création est activé et en mode Base de données.",
"ManageInconsistentLinks.Title":"Gestion de l'impact des modifications",
"ManageInconsistentLinks.ShortHelp":"Gère les liens d'implémentation incomplets ou incohérents entre des systèmes ou opérations et des éléments.",
"ManageInconsistentLinks.LongHelp":"Le panneau <wintitle>Gestion de l'impact des modifications</wintitle> répertorie tout lien incohérent entre des systèmes ou opérations et des éléments. <p>Cliquez sur <uicontrol>Rediriger</uicontrol>, <uicontrol>Supprimer</uicontrol> et <uicontrol>Ignorer</uicontrol> dans le panneau pour corriger les liens.</p>",
"BIEssentialsCmd.Title":"B.I. Essentials",
"BIEssentialsCmd.ShortHelp":"Calcule l'état d'affectation de l'élément de fabrication et l'état de mise à jour du système pour la structure chargée dans l'application, et les affiche en tant que codes couleur dans leurs affichages respectifs.",
"ProcessValidationCmd.Title":"Validation du processus",
"ProcessValidationCmd.ShortHelp":"Analyse la structure du plan de travail sélectionné et les objets associés afin de vérifier la compatibilité avec les applications de planification et d'exécution.",
"ReplaceByLatestRevision.Title":"Remplacer par la dernière révision",
"ReplaceByLatestRevision.ShortHelp":"Remplace une opération enfant par sa dernière révision, met à jour les flux de produits et les liens d'implémentation.",
"ReplaceByLatestRevision.LongHelp":"Sélectionnez une opération enfant et cliquez sur <uicontrol>Remplacer par la dernière révision</uicontrol>.",
"ReplaceByExisting.Title":"Remplacer par un objet existant",
"ReplaceByExisting.ShortHelp":"Remplace une opération enfant par son opération existante, met à jour les flux de produits et les liens d'implémentation.",
"ReplaceByExisting.LongHelp":"Sélectionnez une opération enfant et cliquez sur <uicontrol>Remplacer par existant</uicontrol>. Dans la barre de recherche, saisissez le critère pour une opération existant dans la base de données. Sélectionnez l'opération et cliquez sur <uicontrol>OK</uicontrol>.",
"ReplaceByNewRevision.Title":"Remplacer par une nouvelle révision",
"ReplaceByNewRevision.ShortHelp":"Crée une révision d'une opération enfant, remplace l'opération enfant par la nouvelle révision, met à jour les flux de produits et les liens d'implémentation.",
"ReplaceByNewRevision.LongHelp":"Sélectionnez une opération enfant et cliquez sur <uicontrol>Remplacer par une nouvelle révision</uicontrol>.",
"ReplaceByNewReference.Title":"Remplacer par un nouvel élément",
"ReplaceByNewReference.ShortHelp":"Remplace une instance d'une référence par une instance d'une nouvelle référence. Il affiche la boîte de dialogue <wintitle>Remplacer par nouvelle...</wintitle> .",
"ReplaceWhereUsed.Title":"Opérations de cas d'emploi",
"ReplaceWhereUsed.ShortHelp":"Modifiez massivement les opérations sur les instances d'une structure de fabrication et de système.",
"ReplaceWhereUsed.LongHelp":"Sélectionnez une action par utilisation et cliquez sur <uicontrol>Appliquer</uicontrol> pour confirmer les modifications.",
"UserDefinedExplore.Title":"Exploration définie par l'utilisateur",
"UserDefinedExplore.ShortHelp":"Ouvre une boîte de dialogue <wintitle>Exploration définie par l'utilisateur</wintitle>.",
"UserDefinedExplore.LongHelp":"Dans le champ <wintitle>Liste de toutes les procédures</wintitle>, sélectionnez soit l'entrée par défaut invitant à <uicontrol>Charger les relations dans les vues</uicontrol>, soit l'une des procédures définies par l'utilisateur (JavaScript) disponibles. En cliquant sur <uicontrol>Exécuter</uicontrol>, cette procédure est exécutée avec les objets sélectionnés comme entrée et les objets renvoyés sont chargés dans les vues respectives.<p> <note type = 'notes'> <ul> <li>La disponibilité des procédures dépend de l'objet sélectionné. Si aucun objet n'est sélectionné, la boîte de dialogue ne s'affiche pas, et le comportement par défaut <uicontrol>Charger les relations dans les vues</uicontrol> est exécuté.</li> <li>Les procédures définies par l'utilisateur doivent inclure une <codeph>propriété</codeph> ProcCategory avec la <codeph>valeur</codeph> personnalisée avant d'être déployées dans le serveur à inclure dans la liste.</li> </ul> </note> </p>",
"SetThePartNumber.Title":"Numéro d'élément d'entreprise",
"SetThePartNumber.ShortHelp":"Définit le numéro d'élément d’entreprise",
"SetThePartNumber.LongHelp":"<p>Sélectionnez un ou plusieurs éléments ou ressources pour définir leur numéro d'élément d'entreprise. Un numéro d'élément d'entreprise est une chaîne unique de caractères alphanumériques. Vous pouvez définir un numéro d'élément d'entreprise sur une référence d'élément fabriqué ou sur une référence de ressources pour distinguer cet élément fabriqué de tous les autres éléments fabriqués ou ressources du système.</p>",
"Show3DViewerCmd.Title":"Ouvrir 3DOperations Viewer",
"Show3DViewerCmd.ShortHelp":"Ouvre l'app <wintitle>3Doperations Viewer</wintitle> en mode Aperçu.",
"Show3DViewerCmd.LongHelp":"Dans le panneau <wintitle>Sélectionner des objets pour le Visualisateur d’opérations 3D</wintitle> qui s'affiche, sélectionnez l’élément de fabrication favori ayant une portée au système à charger dans le visualiseur. Cette boîte de dialogue ne s'affiche pas si un seul système est chargé et qu’un seul élément fabriqué a une portée à celui-ci.",
"BuildUpReviewModeCmd.Title":"Mode Revue de séquence",
"BuildUpReviewModeCmd.ShortHelp":"Lance la fonction <wintitle>Séquence</wintitle> en mode Revue pour une interaction rapide avec le clavier.",
"BuildUpReviewModeCmd.LongHelp":"<p>Le mode <wintitle>Revue de séquence</wintitle> vous permet de visualiser : <ul> <li>La représentation 3D d'une ressource ou d'un produit</li> <li>Le résultat de la séquence dans le <wintitle>visualiseur 3D</wintitle>.</li> </ul> </p> <p>Une colonne 3D s'affiche dans la vue <wintitle>Processus & opérations</wintitle> si le widget <wintitle>Visualiseur 3D</wintitle> est lié à l'app. Lorsqu'une ligne est sélectionnée, le résultat de la séquence s'affiche dans la vue.</p> <p>Cette commande est active uniquement si le widget <wintitle>Visualiseur 3D</wintitle> est lié à l'application.</p>",
"ToggleAuxiliaryView.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DuplicateAdv.WebHelp":"SharedUserMap/lifecycle-t-DuplicateAdvanced.htm",
"Delete.WebHelp":"SharedUserMap/lifecycle-t-Delete.htm",
"LayoutPreferences.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DefineFilter.WebHelp":"DelMgaUserMap/delmfna-m-Filter-sb.htm",
"BIEssentialsCmd.WebHelp":"DelMgaUserMap/delmga-t-BIEssentials.htm",
"ReplaceByLatestRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithItsLatestRevision",
"ReplaceByExisting.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithanExistingObject",
"ReplaceByNewRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithaNewRevision",
"ReplaceByNewReference.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#task_h3x_ykz_gsb",
"Show3DViewerCmd.WebHelp":"DelOerUserMap/deloer-c-ov.htm"
}
