{
"Zoom.Title":"Yakınlaştır veya Uzaklaştır",
"Zoom.ShortHelp":"Yakınlaştırır veya uzaklaştırır.",
"Zoom.LongHelp":"Yakınlaştırmak için yukarı, uzaklaştırmak için aşağı sürükleyin.",
"Pan.Title":"Kaydır",
"Pan.ShortHelp":"Modelin görünümünü yatay ve dikey olarak hareket ettirir.",
"Pan.LongHelp":"<uicontrol>Kaydır</uicontrol>'a tıklayın ve ardından herhangi bir yönde sürükleyin.",
"Rotate.Title":"Döndür",
"Rotate.ShortHelp":"Modeli dikey eksen etrafında veya yatay eksen etrafında döndürür.",
"Rotate.LongHelp":"<uicontrol>Döndür</uicontrol>'e tıklayın ve ardından yatay veya dikey olarak sürükleyin.",
"Reframe.Title":"Tümünü Sığdır",
"Reframe.ShortHelp":"Tüm modeli 3D alanına sığdırır.",
"ViewSelector.Title":"Standart Görünümler",
"ViewSelector.ShortHelp":"İçeriğinizi standart görünümleri kullanarak görüntüler: Üst, alt, sol, sağ ve izometrik.",
"ViewSelector.LongHelp":"<p>Görünümler arasında geçiş yapmak için 3D alanın altındaki oklara, izometrik görünüm simgesine veya döndürme simgelerine tıklayın. Ayrıca klavyeyi de kullanabilirsiniz. </p> <p>Standart görünümler modundan çıkmak için boş bir alana tıklayın veya eylem çubuğunu görüntüleyin. </p>",
"LineicFilter.Title":"Lineer Elemanları Filtrele",
"LineicFilter.ShortHelp":"Bir modeldeki lineer elemanları gizleyecek veya tekrar görüntüleyecek şekilde filtreler.",
"LineicFilter.LongHelp":"Referans eksenini, çizgileri ve noktaları diğer türlerden bağımsız olarak gizlemek veya görüntülemek için ekranın sağındaki özel simgelere tıklayın.",
"VisibilityCommands.Title":"Gizle/Göster",
"VisibilityCommands.ShortHelp":"Nesneleri gizler.",
"VisibilityCommands.LongHelp":"Gizlenecek nesnelere tıklayın. Tüm nesneleri göstermek, gizli ve görünür nesneler arasında geçiş yapmak ve nesneleri izole etmek için kısayol araç çubuğunu kullanın.",
"EnhancedExplode.Title":"Patlat",
"EnhancedExplode.ShortHelp":"Montaj ve alt montajları patlatarak iç parçalarını açığa çıkarır.",
"EnhancedExplode.LongHelp":"<p>Patlatma genliğini kontrol etmek için kaydırıcıyı sürükleyin veya okları kullanın. </p>",
"AnnotationTour.Title":"Detaylandırma Turu",
"AnnotationTour.ShortHelp":"Bir detaylandırma bakış açısından diğerine geçer.",
"AnnotationTour.LongHelp":"Detaylandırma dizisinde ilerlemek için çalışma alanının solundaki veya sağındaki oklara tıklayın.",
"AnnotationCommands.Title":"Detaylandırma Komutları",
"AnnotationCommands.ShortHelp":"Detaylandırma komutlarına erişim sağlayan bir kısayol araç çubuğu görüntüler.",
"AnnotationCommands.LongHelp":"Bu kısayol araç çubuğu çalışma alanının sağında bulunur.",
"AnnotationCommand3DText.Title":"Metin Detaylandırma Komutu",
"AnnotationCommand3DText.ShortHelp":"Detaylandırma komutlarına erişim sağlayan bir bağlam araç çubuğu, çalışma alanının sağında görüntülenir.",
"QualityManager.Title":"Kalite Yöneticisi",
"QualityManager.ShortHelp":"3D içeriğin görsel kalitesini tanımlamanızı sağlar.",
"QualityManager.LongHelp":"Kaliteyi azaltmak için imleci sola doğru, artırmak için de sağa doğru kaydırın."
}
