{
  "tokenError": "Üzgünüz, bu geçerli bir kayıt kodu değil",
  "tokenSuccess": "Geçerli kayıt kodu",
  "tokenAlreadyUsed": "Üzgünüz, bu kayıt kodu önceden kullanılmış. Lütfen destek biriminizle iletişime geçin",
  "enterCode": "Kodunuzu girin",
  "verify": "Doğrula",
  "login": "Oturum Aç veya Kaydol",
  "validate": "Erişimi Doğrula",
  "complete": "Kaydı Tamamla",
  "errMsg": "Bir hata oluştu, lütfen daha sonra deneyin",
  "errDeployment": "3DEXPERIENCE'ınızın kurulumu sırasında bir hata oluştu, lütfen destek birimiyle iletişime geçin",
  "accessToMy3DExperienceMessage": "{0} erişimi için {1} veya {2} ile giriş yapmanız gerekmektedir. Henüz bir hesabınız yoksa lütfen şimdi bir hesap oluşturun.",
  "accessConditionToMy3DExperienceMessage": "E-postanızdaki kayıt kodu, şirketinizdeki {1} veya {2} abonelik sayısına bağlı olarak {0} erişimi sağlar.",
  "accessConditionToMy3DExperienceMessage2": " Kod almadıysanız lütfen iş ortağınızla veya tedarikçinizle iletişime geçin",
  "registrationCode": "Kayıt kodu",
  "CATIAAgreements": "Müşteri veya Müşteri tarafından onun adına hareket etmek üzere yetkilendirilmiş bir temsilci olarak, aksi belirtilmedikçe 3DEXPERIENCE Social Collaboration Services kullanımı için geçerli olacak {0} şart ve koşullarını okuduğumu ve kabul ettiğimi onaylıyorum.",
  "SWAgreements": "Müşteri veya Müşteri tarafından onun adına hareket etmek üzere yetkilendirilmiş bir temsilci olarak, tüm SOLIDWORKS Tekliflerinin kullanımı için geçerli olacak ve DS SolidWorks Corp. şirketinden aldığım tüm lisanslar için geçerli olan önceki şart ve koşulların yerini alacak olan bu {0} sözleşmesinin (“Son Kullanıcı Sözleşmesi”) şart ve koşullarını okuduğumu ve kabul ettiğimi onaylıyorum.",
  "CATIALinkAgreement": "Düzeltme",
  "SWLinkAgreement": "Son Kullanıcı Lisansı ve Çevrimiçi Hizmetler Sözleşmesi",
  "deployPlatform": "Şu anda platformunuzu dağıtıyoruz. Her şey hazır olduğunda, 3DEXPERIENCE Platform'unuza bağlantı içeren bir onay postası alacaksınız",
  "registrationComplete": "Kaydınız şu anda tamamlanmıştır.",
  "waitMinutes": "Sizin için ayarlama yapıyoruz, lütfen bekleyin. Bu işlem birkaç dakika sürebilir...",
  "signOut": "Oturumu Kapat",
  "next": "Sonraki",
  "offerIsTheGateway": "Bu teklif {0} için bir geçittir",
  "power": "{0} bulut platformunun gücü",
  "expiredLicenses": "Hizmeti sunamıyoruz, şirketinizin şu anda bu hizmete erişim sağlayan aktif bir lisansı yok. Daha fazla bilgi için lütfen katma değerli tedarikçinizle iletişime geçin.",
  "serviceUnavailable": "Üzgünüz, bu hizmet şu anda kullanılamıyor. Lütfen daha sonra deneyin",
  "noCustomer": "Bu hizmeti sağlayamıyoruz. Daha fazla bilgi için lütfen katma değerli tedarikçinizle iletişime geçin."
}