{
  "minimumOrderCost": "Coste mínimo del pedido",
  "pricePerQuote": "Precio por presupuesto",
  "totalOrderPriceIs": "El precio total del pedido es de",
  "orMore": "o más",
  "totalPartQuantityIs": "La cantidad total de piezas es de",
  "unitsOrMore": "unidades o más",
  "general": "General",
  "automatedPricing": "La fijación de precios automática se desactivará si",
  "discountOrderValue": "Descuento por valor del pedido",
  "addDiscount": "Añadir un descuento",
  "orderValueLabel": "Si el valor del pedido es superior a",
  "discountLabel": "el descuento que se aplica es de",
  "generalSectionTooltip_1": "El coste mínimo del pedido es la cantidad por la que no desea facturar a un cliente, excluidos los impuestos y el envío. Este importe sustituirá a cualquier importe inferior que genere el módulo de fijación de precios automático. Por ejemplo, si uno de sus clientes solicita una pieza que normalmente costaría 5 euros según su fijación de precios, pero usted ha fijado el precio mínimo de pedido en 20 euros, su cliente verá por tanto 20 euros como el precio de la pieza.",
  "generalSectionTooltip_2": "El precio por presupuesto es una cantidad que desee añadir además de otros costes que representan costes administrativos como el envío de la factura, la creación del cliente en su base de datos, etc. Esta cantidad se añade solo una vez por pedido. Por ejemplo, si su cliente solicita una pieza que vale 5 euros según su configuración y ha fijado su precio por presupuesto en 5 euros, su cliente verá 10 euros como un total para una pieza, 15 euros para dos piezas, 20 euros por 3 piezas y así sucesivamente.",
  "generalSectionTooltip": "Estos costes se aplicarán a cada pedido y se añadirán a los costes relacionados con el material, el envío y los servicios. Si un pedido es inferior al \"coste mínimo del pedido\", el total se sustituirá por este valor.",
  "automatedPricingSectionTooltip": "Si el pedido en la fase de solicitud de envío supera el siguiente umbral, se desactivará la función de fijación de precios automática. El comprador tendrá que enviar una solicitud de presupuesto.",
  "discountPerOrderValueSectionTooltip_1": "En esta sección puede configurar tantos descuentos como desee. Los descuentos se basan en el valor del pedido y se aplican al mismo, sin incluir los impuestos ni el envío. Solo se aplica el tramo más alto al valor del pedido. Por ejemplo, si establece las siguientes reglas: 10 % de descuento en pedidos superiores a 100 euros Y 20 % de descuento en pedidos superiores a 200 euros, por lo que",
  "discountPerOrderValueSectionTooltip_2": "no se aplicará ningún descuento en los pedidos de entre 0 y 100,00 euros;",
  "discountPerOrderValueSectionTooltip_3": "se aplicará un 10 % de descuento en los pedidos de entre 100,01 y 200,00 euros;",
  "discountPerOrderValueSectionTooltip_4": "y se aplicará un descuento del 20 % en pedidos de a partir de 200,01 euros."
}