{
  "minimumOrderCost": "Montant minimal de la commande",
  "pricePerQuote": "Prix par devis",
  "totalOrderPriceIs": "Le prix total de la commande est",
  "orMore": "ou plus",
  "totalPartQuantityIs": "La quantité totale de pièces est",
  "unitsOrMore": "unités ou plus",
  "general": "Général",
  "automatedPricing": "La tarification automatique sera désactivée si",
  "discountOrderValue": "Réduction selon le montant de la commande",
  "addDiscount": "Ajouter une réduction",
  "orderValueLabel": "Si le montant de la commande est supérieur à",
  "discountLabel": "la réduction appliquée est de",
  "generalSectionTooltip_1": "Le montant minimal de la commande correspond au montant en dessous duquel vous ne souhaitez pas recevoir de commandes, hors taxes et frais d'envoi. Ce montant remplacera tout montant inférieur généré par le module de tarification automatique. Par exemple, si l'un de vos clients demande une pièce coûtant 5 euros et que vous avez indiqué un montant minimal de 20 euros, cette pièce sera facturée 20 euros à ce client.",
  "generalSectionTooltip_2": "Le prix par devis est un montant à ajouter aux autres coûts qui couvre les frais d'envoi de la facture et de création de la fiche client dans votre base de données, ainsi que tout autre coût administratif. Ce montant est ajouté une seule fois par commande. Par exemple, si votre client commande une pièce coûtant 5 euros et que vous avez indiqué un prix par devis de 5 euros, une pièce coûtera 10 euros au total à votre client, deux pièces coûteront 15 euros, trois pièces coûteront 20 euros, et ainsi de suite.",
  "generalSectionTooltip": "Ces montants seront appliqués à chaque commande et seront ajoutés en sus des montants liés aux matériaux, à l'expédition et aux services. Si le montant d'une commande est inférieur au \"montant minimal de la commande\", le montant total sera remplacé par cette valeur.",
  "automatedPricingSectionTooltip": "Lors de l'étape d'envoi de la demande, si une commande dépasse le seuil suivant, la fonctionnalité de tarification automatique sera désactivée. L'acheteur devra alors envoyer une demande de devis.",
  "discountPerOrderValueSectionTooltip_1": "Dans cette section, vous pouvez paramétrer autant de remises que vous le souhaitez. Les remises se basent sur la valeur de la commande, hors taxes et frais d'envoi. Seule la valeur supérieure est appliquée au montant de la commande. Par exemple, si vous proposez 10 % de remise sur les commandes de plus de 100 euros ET 20 % de remise sur les commandes de plus de 200 euros,",
  "discountPerOrderValueSectionTooltip_2": "aucune remise ne sera appliquée aux commandes de 0 à 100,00 euros,",
  "discountPerOrderValueSectionTooltip_3": "une remise de 10 % sera appliquée aux commandes de 100,01 à 200,00 euros,",
  "discountPerOrderValueSectionTooltip_4": "et une remise de 20 % sera appliquée aux commandes de 200,01 euros minimum."
}