{
  "minimumOrderCost": "Mindestbestellwert",
  "pricePerQuote": "Preis pro Angebot",
  "totalOrderPriceIs": "Der Gesamtpreis der Bestellung beträgt",
  "orMore": "oder mehr",
  "totalPartQuantityIs": "Die Gesamtmenge der Teile beträgt",
  "unitsOrMore": "Einheiten oder mehr",
  "general": "Allgemein",
  "automatedPricing": "Die automatische Preisberechnung wird deaktiviert, wenn",
  "discountOrderValue": "Rabatt pro Bestellwert",
  "addDiscount": "Rabatt hinzufügen",
  "orderValueLabel": "Wenn der Auftragswert höher ist als",
  "discountLabel": "dann beträgt der angewendete Rabatt",
  "generalSectionTooltip_1": "Die Mindestbestellkosten sind der Betrag, den Sie einem Kunden ohne Steuern und Versandkosten mindestens in Rechnung stellen möchten. Dieser Betrag ersetzt alle niedrigeren Beträge, die vom automatisierten Preisberechnungsmodul generiert werden. Wenn beispielsweise einer Ihrer Kunden ein Teil anfordert, das in der Regel 5 Euro kostet, Sie den Mindestbestellpreis aber auf 20 Euro festgelegt haben, werden Ihrem Kunden 20 Euro als Preis für das Teil angezeigt.",
  "generalSectionTooltip_2": "Der Preis pro Angebot ist ein Betrag, den Sie zusätzlich zu anderen Kosten hinzufügen möchten, um die Verwaltungskosten abzudecken, wie z. B. das Senden der Rechnung, das Erstellen des Kunden in Ihrer Datenbank usw. Dieser Betrag wird nur einmal pro Bestellung hinzugefügt. Wenn Ihr Kunde beispielsweise ein Teil bestellt, das laut Ihren Einstellungen einen Preis von 5 Euro hat, und Sie den Preis pro Angebot auf 5 Euro festgelegt haben, werden Ihrem Kunden insgesamt 10 Euro für ein Teil, 15 Euro für zwei Teile, 20 Euro für drei Teile usw. angezeigt.",
  "generalSectionTooltip": "Diese Kosten gelten für jede Bestellung und werden zusätzlich zu den Kosten für Material, Versand und Dienstleistungen in Rechnung gestellt. Wenn ein Auftrag unter den „Mindestbestellkosten“ liegt, wird der Gesamtwert durch diesen Wert ersetzt.",
  "automatedPricingSectionTooltip": "Wenn die Bestellung in der Anfrageübermittlungsphase den folgenden Schwellenwert überschreitet, wird die automatische Preisfunktion deaktiviert. Der Käufer muss dann eine Angebotsanfrage senden.",
  "discountPerOrderValueSectionTooltip_1": "In diesem Abschnitt können Sie beliebig viele Rabatte einrichten. Rabatte basieren auf dem Bestellwert ohne Steuern und Versand und werden auf diesen angewendet. Es wird nur der höchste Bereich auf den Auftragswert angewendet. Wenn Sie beispielsweise 10 % Rabatt auf Bestellungen über 100 Euro UND 20 % Rabatt auf Bestellungen über 200 Euro festlegen, gilt Folgendes:",
  "discountPerOrderValueSectionTooltip_2": "Für Bestellungen von 0 bis 100,00 Euro wird kein Rabatt gewährt.",
  "discountPerOrderValueSectionTooltip_3": "Für Bestellungen von 100,01 bis 200,00 Euro wird ein Rabatt von 10 % gewährt.",
  "discountPerOrderValueSectionTooltip_4": "Für Bestellungen ab 200,01 Euro wird ein Rabatt von 20 % gewährt."
}