{
  "firstName": "Nombre",
  "lastName": "Apellido",
  "emailAddress": "Dirección de correo electrónico",
  "birthDate": "Fecha de nacimiento",
  "phoneNumber": "Número de teléfono",
  "univerityCollegeName": "Nombre de la universidad",
  "documentUpload": "Carga de documentos",
  "docUploadMessage": "Para verificar su estatus de estudiante, cargue un documento de su universidad que muestre claramente su nombre y apellidos, así como un estatus o fecha que indique la validez actual.",
  "selectAFile": "Seleccionar un archivo",
  "acceptedFileTypes": "Los tipos de archivo aceptados son: PDF, JPEG, PNG, BMP, GIF.",
  "submit": "Enviar",
  "proceed": "Continuar",
  "cancel": "Cancelar",
  "studentStatusVerification": "Verificación del estatus del estudiante",
  "docVerificationInProgress": "Verificación de documento en curso",
  "docPendingMessage": "Se están revisando el documento o los documentos que ha cargado. Este proceso suele tardar {estimatedReviewTime} en completarse y probablemente no tarde más de {maxReviewTime}. Una vez finalizada la verificación, nos pondremos en contacto con usted por correo electrónico.",
  "docPendingMessageDefault": "Se están revisando el documento o los documentos que ha cargado. Este proceso suele tardar unos 20 minutos en completarse. Una vez finalizada la verificación, nos pondremos en contacto con usted por correo electrónico.",
  "ssoVerificationInProgress": "Esperando inicio de sesión…",
  "ssoPendingMessage": "Una vez que haya iniciado sesión, haga clic en el botón que aparece a continuación para actualizar el estatus de verificación.",
  "verificationLimitExceeded": "Límite de verificación superado",
  "verLimitExceededMessage": "Ha alcanzado el número máximo de intentos de verificación permitidos.",
  "docReviewLimitExceeded": "Se ha superado el límite de revisión del documento.",
  "docLimitExceededMessage": "Ha alcanzado el número máximo de revisiones de documentos permitidas.",
  "error": "Error",
  "defaultErrorMessage": "Se ha producido un error. No se ha podido verificar el estatus de estudiante.",
  "contactSupport": "Póngase en contacto con el servicio de atención al cliente o compre el producto no educativo correspondiente.",
  "startOver": "Inicie una nueva verificación o compre el producto no educativo correspondiente.",
  "verificationCompleted": "Verificación completada.",
  "studentStatusVerified": "Se ha verificado su estatus de estudiante.",
  "checkStatus": "Comprobar estatus",
  "estimatedReviewTimeLabel": "Tiempo estimado para la revisión: ",
  "A_FEW_MINUTES": "unos minutos",
  "A_HALF_HOUR": "media hora",
  "A_FEW_HOURS": "unas horas",
  "A_FEW_DAYS": "unos días",
  "maxReviewTimeLabel": "Tiempo máximo de revisión: ",
  "2_MIN": "2 minutos",
  "20_MIN": "20 minutos",
  "2_HRS": "2 horas",
  "24_HRS": "24 horas",
  "2_DAY": "2 días",
  "3_DAY": "3 días",
  "docUploadRejectionDefault": "Los documentos que ha cargado recientemente no cumplen los estándares necesarios. Inténtelo de nuevo con otro documento.",
  "docUploadRejection_DOCUMENT_UNSUPPORTED": "El documento que ha cargado no es compatible. Pruebe con otro documento.",
  "docUploadRejection_DOCUMENT_EXPIRED": "Uno o más documentos que ha cargado ya han caducado. Cargue un documento válido.",
  "docUploadRejection_DOCUMENT_UNREADABLE": "El documento que ha cargado no es legible. Inténtelo de nuevo con un documento diferente y más legible.",
  "docUploadRejection_DOCUMENT_LIKELY_FRAUD": "El documento que ha cargado se identificó como un documento posiblemente fraudulento. Cargue otro documento.",
  "docUploadRejection_DOCUMENT_PASSWORD_PROTECTED": "El documento que ha cargado estaba protegido por contraseña y no se ha podido verificar.",
  "docUploadRejection_INELIGIBLE_JOB_TITLE": "El documento que ha cargado contiene un cargo no apto.",
  "docUploadRejection_INSUFFICIENT_DOCUMENT_DATE": "No hemos podido identificar una fecha válida en el documento que ha cargado. Asegúrese de que el documento contiene una fecha válida y legible.",
  "docUploadRejection_INSUFFICIENT_STATUS": "No hemos podido identificar un estatus de estudiante válido en el documento que se ha subido. Inténtelo de nuevo con un documento que muestre claramente su estatus de estudiante.",
  "docUploadRejection_MISMATCH_BIRTHDATE": "La fecha de nacimiento indicada en el documento cargado no se corresponde con la fecha de nacimiento que introdujo anteriormente en el formulario.",
  "docUploadRejection_MISMATCH_PERSON_FIRST_NAME": "El nombre mencionado en el documento cargado no se corresponde con el nombre de su cuenta.",
  "docUploadRejection_MISMATCH_PERSON_LAST_NAME": "Los apellidos mencionados en el documento cargado no se corresponden con los apellidos de su cuenta.",
  "docUploadRejection_MISMATCH_ORGANIZATION_NAME": "El nombre de la organización indicado en el documento no corresponde a la organización que ha introducido previamente en el formulario.",
  "docUploadRejection_MISSING_DOCUMENT_DATE": "El documento cargado no contiene una fecha válida. Cargue otro documento.",
  "docUploadRejection_MISSING_INFORMATION_BIRTHDATE": "El documento cargado no contiene su fecha de nacimiento. Cargue otro documento.",
  "docUploadRejection_MISSING_INFORMATION_ORGANIZATION_NAME": "El documento cargado no contiene el nombre de su organización (universidad).",
  "docUploadRejection_MISSING_PERSON_FIRST_NAME": "El documento cargado no contiene su nombre.",
  "docUploadRejection_MISSING_PERSON_LAST_NAME": "El documento cargado no contiene sus apellidos.",
  "docUploadRejection_OUT_OF_RANGE_BIRTHDATE": "La fecha de nacimiento indicada en el documento no es válida.",
  "docUploadRejection_DOCUMENT_HANDWRITTEN": "No aceptamos documentos escritos a mano. Cargue otro documento.",
  "docUploadRejection_DOCUMENT_OUTDATED": "El documento cargado es obsoleto. Cargue un documento válido.",
  "docUploadRejection_INELIGIBLE_ORGANIZATION": "La organización que proporciona el documento cargado no es una organización apta para esta oferta.",
  "docUploadRejection_MISSING_INFORMATION": "El documento cargado no tiene información. Asegúrese de que muestra claramente su nombre y apellidos, su fecha de nacimiento, el nombre de la organización, su estatus de estudiante y una indicación de la validez continua.",
  "docUploadRejection_MISSING_INFORMATION_PERSON_NAME": "El documento que ha cargado no contiene su nombre. Cargue otro documento.",
  "docUploadRejection_MISMATCH_PERSON_NAME": "El nombre indicado en el documento cargado no se corresponde con el nombre de su cuenta. Cargue otro documento.",
  "docUploadRejection_OTHER_CONTACT_US": "Se ha producido un problema con el documento cargado. Póngase en contacto con nuestro servicio de asistencia para obtener más información y, a continuación, cargue otro documento.",
  "verifRejection_expiredVerificationToken": "La verificación del estatus ha caducado. Rellene este formulario para renovarlo.",
  "loginNecessary": "Es necesario iniciar sesión",
  "ssoLinkMessage": "Haga clic en el siguiente botón para abrir la página de inicio de sesión de su plataforma de estudiantes en una nueva ventana. Después de iniciar sesión correctamente, vuelva aquí y haga clic en el botón de nuevo para actualizar el estatus de verificación.",
  "goToLogin": "Ir a inicio de sesión"
}