{
  "firstName": "Nome",
  "lastName": "Cognome",
  "emailAddress": "Indirizzo e-mail",
  "birthDate": "Data di nascita",
  "phoneNumber": "Numero di telefono",
  "univerityCollegeName": "Nome università/college",
  "documentUpload": "Caricamento del documento",
  "docUploadMessage": "Per verificare il tuo stato di studente, carica un documento della tua scuola/università che mostri chiaramente il tuo nome e cognome, nonché uno stato o una data che indichi la validità in corso.",
  "selectAFile": "Seleziona un file",
  "acceptedFileTypes": "I tipi di file accettati sono: PDF, JPEG, PNG, BMP, GIF",
  "submit": "Invia",
  "proceed": "Continua",
  "cancel": "Annulla",
  "studentStatusVerification": "Verifica dello stato di studente",
  "docVerificationInProgress": "Verifica del documento in corso",
  "docPendingMessage": "I documenti caricati sono in fase di revisione. Questo processo richiede solitamente {estimatedReviewTime} e probabilmente non richiederà più di {maxReviewTime}. Sarai contattato via e-mail al termine della verifica.",
  "docPendingMessageDefault": "I documenti caricati sono in fase di revisione. Questo processo richiede in genere circa 20 minuti. Sarai contattato via e-mail al termine della verifica.",
  "ssoVerificationInProgress": "In attesa dell'accesso ...",
  "ssoPendingMessage": "Una volta effettuato l'accesso, fai clic sul pulsante in basso per aggiornare lo stato della verifica.",
  "verificationLimitExceeded": "Limite verifiche superato",
  "verLimitExceededMessage": "Hai raggiunto il numero massimo di tentativi di verifica consentiti.",
  "docReviewLimitExceeded": "Limite revisioni del documento superato",
  "docLimitExceededMessage": "Hai raggiunto il numero massimo di revisioni del documento consentite.",
  "error": "Errore",
  "defaultErrorMessage": "Si è verificato un errore. Impossibile verificare il tuo stato di studente.",
  "contactSupport": "Contatta il supporto clienti o acquista il prodotto non didattico corrispondente.",
  "startOver": "Inizia una nuova verifica o acquista il prodotto non didattico corrispondente.",
  "verificationCompleted": "Verifica completata.",
  "studentStatusVerified": "Il tuo stato di studente è stato verificato.",
  "checkStatus": "Verifica stato",
  "estimatedReviewTimeLabel": "Durata revisione stimata: ",
  "A_FEW_MINUTES": "alcuni minuti",
  "A_HALF_HOUR": "mezz'ora",
  "A_FEW_HOURS": "alcune ore",
  "A_FEW_DAYS": "alcuni giorni",
  "maxReviewTimeLabel": "Durata revisione massima: ",
  "2_MIN": "2 minuti",
  "20_MIN": "20 minuti",
  "2_HRS": "2 ore",
  "24_HRS": "24 ore",
  "2_DAY": "2 giorni",
  "3_DAY": "3 giorni",
  "docUploadRejectionDefault": "I documenti caricati di recente non sono conformi agli standard necessari. Riprova con un altro documento.",
  "docUploadRejection_DOCUMENT_UNSUPPORTED": "Il documento caricato non è supportato. Prova un documento diverso.",
  "docUploadRejection_DOCUMENT_EXPIRED": "Uno o più documenti caricati sono già scaduti. Carica un documento valido.",
  "docUploadRejection_DOCUMENT_UNREADABLE": "Il documento caricato non è leggibile. Riprova con un altro documento più leggibile.",
  "docUploadRejection_DOCUMENT_LIKELY_FRAUD": "Il documento caricato è stato identificato come potenzialmente falso. Carica un altro documento.",
  "docUploadRejection_DOCUMENT_PASSWORD_PROTECTED": "Il documento caricato è protetto da password e non è stato possibile verificarlo.",
  "docUploadRejection_INELIGIBLE_JOB_TITLE": "Il documento caricato contiene una qualifica non idonea.",
  "docUploadRejection_INSUFFICIENT_DOCUMENT_DATE": "Non è stato possibile identificare una data valida nel documento caricato. Assicurati che il documento contenga una data leggibile e valida.",
  "docUploadRejection_INSUFFICIENT_STATUS": "Non è stato possibile identificare uno stato di studente valido nel documento caricato. Riprova con un documento che mostra chiaramente il tuo stato di studente.",
  "docUploadRejection_MISMATCH_BIRTHDATE": "La data di nascita trovata sul documento caricato non corrisponde alla data di nascita inserita precedentemente nel modulo.",
  "docUploadRejection_MISMATCH_PERSON_FIRST_NAME": "Il nome indicato nel documento caricato non corrisponde al nome del tuo conto corrente.",
  "docUploadRejection_MISMATCH_PERSON_LAST_NAME": "Il cognome indicato nel documento caricato non corrisponde al cognome del tuo conto corrente.",
  "docUploadRejection_MISMATCH_ORGANIZATION_NAME": "Il nome dell'organizzazione trovato nel documento non corrisponde all'organizzazione precedentemente inserita nel modulo",
  "docUploadRejection_MISSING_DOCUMENT_DATE": "Il documento caricato non contiene una data valida. Carica un altro documento.",
  "docUploadRejection_MISSING_INFORMATION_BIRTHDATE": "Il documento caricato non contiene la tua data di nascita. Carica un altro documento.",
  "docUploadRejection_MISSING_INFORMATION_ORGANIZATION_NAME": "Il documento caricato non contiene il nome della tua organizzazione (università/college/...).",
  "docUploadRejection_MISSING_PERSON_FIRST_NAME": "Il documento caricato non contiene il tuo nome.",
  "docUploadRejection_MISSING_PERSON_LAST_NAME": "Il documento caricato non contiene il tuo cognome.",
  "docUploadRejection_OUT_OF_RANGE_BIRTHDATE": "La data di nascita trovata nel documento non è valida.",
  "docUploadRejection_DOCUMENT_HANDWRITTEN": "Non accettiamo documenti scritti a mano. Carica un altro documento.",
  "docUploadRejection_DOCUMENT_OUTDATED": "Il documento caricato è obsoleto. Carica un documento valido.",
  "docUploadRejection_INELIGIBLE_ORGANIZATION": "L'organizzazione che fornisce il documento caricato non è un'organizzazione idonea per questa offerta.",
  "docUploadRejection_MISSING_INFORMATION": "Il documento caricato non contiene alcune informazioni. Assicurati che mostri chiaramente il tuo nome e cognome, la data di nascita, il nome dell'organizzazione, lo stato di studente e la validità in corso",
  "docUploadRejection_MISSING_INFORMATION_PERSON_NAME": "Il documento caricato non contiene il tuo nome. Carica un altro documento.",
  "docUploadRejection_MISMATCH_PERSON_NAME": "Il nome indicato nel documento caricato non corrisponde al nome del tuo conto corrente. Carica un altro documento.",
  "docUploadRejection_OTHER_CONTACT_US": "Si è verificato un problema con il documento caricato. Contatta il nostro supporto per ulteriori informazioni e carica un altro documento.",
  "verifRejection_expiredVerificationToken": "La verifica dello stato è scaduta. Compila questo modulo per rinnovarla.",
  "loginNecessary": "Accesso necessario",
  "ssoLinkMessage": "Fai clic sul pulsante in basso per aprire la pagina di accesso della piattaforma per studenti in una nuova finestra. Dopo aver effettuato l'accesso, torna qui e fai nuovamente clic sul pulsante per aggiornare lo stato della verifica.",
  "goToLogin": "Vai alla pagina di accesso"
}