{
  "SpecificationTemplateOptional": "Activer la fonctionnalité Instantané de distribution",
  "SpecificationTemplateOptionalDesc": "Cette fonctionnalité génère un PDF qui capture les données d'un élément d'ingénierie ou d'un document tel qu'il est au moment de la création du rapport. Elle requiert un modèle de type 'Modèle de rapport de spécification' créé à l'aide de l'application 'CATIA Report Template Design'. Consultez le guide de l'utilisateur et le guide d'administration pour plus d'informations.",
  "ProductSpecificationCreateOptional": "Afficher la commande \"Nouveau produit\" dans le panneau de bienvenue",
  "ProductSpecificationCreateOptionalDesc": "Lorsque cette option est cochée, la commande \"Nouveau produit\" s'affiche sur le panneau de bienvenue et sélectionne les types à exclure de la commande \"Nouveau produit\". ",
  "XSLAccordionTab": "Types de spécification de produit",
  "GeneralConfigurationAccordionTab": "Instantané de distribution",
  "SpecManagementHeader": "Configurer l'expérience de gestion des spécifications",
  "ProductSpecTypesAccordionTab": "Produit",
  "RawMaterialTypesAccordionTab": "Matière première",
  "NoTypeSelected": "Sélectionner les types à configurer",
  "TypeSaveSuccess": "Les modifications de configuration pour les types sélectionnés ont été enregistrées.",
  "TypeSaveFailure": "Echec de l'enregistrement de la configuration des types sélectionnés",
  "saveButtonText": "Enregistrer",
  "resetButtonText": "Réinitialiser",
  "SelectTypes": "Sélectionner des types...",
  "InfoLabelForProduct": "Sélectionnez les types à exclure de la commande \"Nouveau produit\" et cliquez sur Enregistrer",
  "InfoDescriptionForProduct": "Cette fonction permet à l'administrateur de configurer la liste des types de spécification de produit pris en charge pour la création. Les types enregistrés ne sont pas affichés sous la commande \"Nouveau produit\" ",
  "InfoLabelForRawMat": "Sélectionnez les types à exclure de la commande \"Nouvelle matière première\" et cliquez sur Enregistrer ",
  "InfoDescriptionForRawMat": "Cette fonction permet à l'administrateur de configurer la liste des types de matière première pris en charge pour la création. Les types enregistrés ne sont pas affichés sous la commande \"Nouvelle matière première\" ",
  "FetchTypes": "Récupération des types...",
  "RefreshingTypes": "Mise à jour des types...",
  "UnsavedNotification": "Vous avez des modifications de configuration non enregistrées ",
  "PhysicalProduct": "Produit physique",
  "SuccessfulSettingsApplied": "Paramètres appliqués avec succès.",
  "AllTypesSelected": "Impossible d'exclure tous les types.\n Désélectionnez un type pour en exclure d'autres.",
  "FormulatedProductAccordionTab": "Produit formulé",
  "InfoLabelForFRMProduct": "Unités BOM de formule",
  "InfoDescForFRMProduct": "Cette fonction permet à l'administrateur de configurer les unités BOM de formule",
  "Weight": "Poids",
  "Percentage": "Pourcentage",
  "SelectFBOMunits": "Sélectionnez des unités applicables...",
  "BOMUnitsSaveSuccess": "Les modifications de configuration des unités BOM de formule ont été enregistrées.",
  "BOMUnitsSaveFailure": "La configuration des unités BOM de formule sélectionnées n'a pas pu être enregistrée",
  "EnableOOTBProductSpecTypes": "Activez la commande \"Nouveau produit\" pour le Cloud public",
  "EnableOOTBProductSpecTypesDesc": "Cela permettra l'utilisation des sous-types de spécification de produit fournis par l'application. L'alternative recommandée pour les clients de Cloud public est d'utiliser la classification IP au lieu du sous-type. Les clients de Cloud privé ont la possibilité de créer leurs propres sous-types et ne doivent pas activer cette commande.",
  "MaterialAccordionTab": "Matériau",
  "ModelingandSimulationOptional": "Activer l'utilisation du matériau pour la modélisation 3D et la simulation",
  "ModelingandSimulationOptionalDesc": "Activez cette option pour spécifier les matériaux noyau et/ou de revêtement à utiliser dans les modèles 3D et de simulation",
  "FormulaOptional": "Activer l'utilisation du matériau pour la formulation",
  "FormulaOptionalDesc": "Activez cette option pour créer un produit formulé à partir d'une recette créée dans la conception de formulation",
  "ErrorMessforBothSettings": "Au moins un paramètre de matériau doit être activé. Vérifiez les options disponibles et choisissez celles qui correspondent à vos besoins.",
  "ErrorMessforDisableFormulaSetting": "Ce paramètre ne peut pas être désactivé lorsque des produits formulés sont liés à des recettes",
  "ErrorMessforFormulaSettingService": "Erreur lors du chargement des produits formulés liés aux recettes. Veuillez contacter l'administrateur."
}
