{
  "SpecificationTemplateOptional": "Włącz operację Zwolnij migawkę",
  "SpecificationTemplateOptionalDesc": "Ta operacja generuje plik PDF, który przechwytuje dane elementu konstrukcyjnego lub dokumentu w czasie generowania raportu. Funkcja wymaga szablonu typu „Szablon raportu specyfikacji” utworzonego za pomocą aplikacji „Projekt szablonu raportu CATIA”. Aby uzyskać więcej informacji, zobacz Podręcznik administratora i Podręcznik użytkownika.",
  "ProductSpecificationCreateOptional": "Pokaż polecenie „Nowy produkt” na panelu powitalnym",
  "ProductSpecificationCreateOptionalDesc": "Po zaznaczeniu tej opcji na panelu powitalnym zostanie wyświetlone polecenie „Nowy produkt” i wybrane typy do wykluczenia z polecenia „Nowy produkt”. ",
  "XSLAccordionTab": "Typy specyfikacji produktu",
  "GeneralConfigurationAccordionTab": "Zwolnij migawkę",
  "SpecManagementHeader": "Konfiguruj środowisko zarządzania specyfikacjami",
  "ProductSpecTypesAccordionTab": "Produkt",
  "RawMaterialTypesAccordionTab": "Surowiec",
  "NoTypeSelected": "Wybierz typy do skonfigurowania",
  "TypeSaveSuccess": "Zapisano zmiany konfiguracji dla wybranych typów.",
  "TypeSaveFailure": "Konfiguracja wybranych typów nie została zapisana",
  "saveButtonText": "Zapisz",
  "resetButtonText": "Resetuj",
  "SelectTypes": "Wybierz typy.",
  "InfoLabelForProduct": "Wybierz typy do wykluczenia z polecenia „Nowy produkt” i kliknij przycisk Zapisz",
  "InfoDescriptionForProduct": "Ta funkcja umożliwia administratorowi skonfigurowanie listy typów specyfikacji produktu obsługiwanych dla utworzenia. Zapisane typy nie są wyświetlane w ramach polecenia „Nowy produkt” ",
  "InfoLabelForRawMat": "Wybierz typy do wykluczenia z polecenia „Nowy surowiec” i kliknij przycisk Zapisz ",
  "InfoDescriptionForRawMat": "Ta funkcja umożliwia administratorowi skonfigurowanie listy typów surowców obsługiwanych dla utworzenia. Zapisane typy nie są wyświetlane w polu polecenia „Nowy surowiec” ",
  "FetchTypes": "Pobieranie typów...",
  "RefreshingTypes": "Aktualizowanie typów...",
  "UnsavedNotification": "Istnieją niezapisane zmiany konfiguracji ",
  "PhysicalProduct": "Produkt fizyczny",
  "SuccessfulSettingsApplied": "Ustawienie zostało pomyślnie zastosowane.",
  "AllTypesSelected": "Nie można wykluczyć wszystkich typów.\n Usuń zaznaczenie jednego typu, aby wykluczyć inne.",
  "FormulatedProductAccordionTab": "Produkt o formule",
  "InfoLabelForFRMProduct": "Jednostki LM formuły",
  "InfoDescForFRMProduct": "Ta funkcja umożliwia administratorowi konfigurowanie jednostek listy materiałów formuły",
  "Weight": "Masa",
  "Percentage": "Procent",
  "SelectFBOMunits": "Wybierz odpowiednie jednostki.",
  "BOMUnitsSaveSuccess": "Zmiany konfiguracji dla jednostek LM formuły zostały zapisane.",
  "BOMUnitsSaveFailure": "Nie udało się zapisać konfiguracji wybranych jednostek LM formuły",
  "EnableOOTBProductSpecTypes": "Włącz polecenie „Nowy produkt” dla chmury publicznej",
  "EnableOOTBProductSpecTypesDesc": "Umożliwi to korzystanie z podtypów Specyfikacji produktu dostarczonych przez aplikację. Zalecaną alternatywą dla klientów chmury publicznej jest użycie klasyfikacji IP zamiast podtypu. Klienci korzystający z chmury prywatnej mają możliwość tworzenia własnych podtypów i nie powinni włączać tego polecenia.",
  "MaterialAccordionTab": "Materiał",
  "ModelingandSimulationOptional": "Włącz użycie materiału dla modelowania 3D i symulacji",
  "ModelingandSimulationOptionalDesc": "Włącz tę opcję, aby określić materiały rdzenia i/lub pokrycia do użycia w modelach 3D i symulacji",
  "FormulaOptional": "Włącz użycie materiału dla formuły",
  "FormulaOptionalDesc": "Włącz tę opcję, aby gotowy produkt został utworzony z receptury wykonanej w projekcie formuły",
  "ErrorMessforBothSettings": "Należy włączyć co najmniej jedno ustawienie materiału. Sprawdź dostępne opcje i wybierz te, które odpowiadają Twoim potrzebom.",
  "ErrorMessforDisableFormulaSetting": "Tego ustawienia nie można wyłączyć, gdy istnieją formuły produktów powiązane z recepturami",
  "ErrorMessforFormulaSettingService": "Błąd podczas ładowania formuł produktów powiązanych z recepturami. Skontaktuj się z administratorem."
}
