{
  "SpecificationTemplateOptional": "Yayınlanmış Anlık Görüntü unsurunu etkinleştir",
  "SpecificationTemplateOptionalDesc": "Bu unsur, bir Mühendislik Öğesinin veya Belgenin verilerini raporun oluşturulduğu andaki haliyle yakalayan bir PDF oluşturur. Bu unsur, \"CATIA Report Template Design\" uygulaması kullanılarak oluşturulan \"Teknik Özellik Raporu Şablonu\" türünde bir şablon gerektirir. Daha fazla bilgi için Yönetim ve Kullanıcı kılavuzlarına bakın.",
  "ProductSpecificationCreateOptional": "Hoş geldiniz panelinde \"Yeni Ürün\" komutunu göster",
  "ProductSpecificationCreateOptionalDesc": "İşaretlendiğinde hoş geldiniz panelinde \"Yeni Ürün\" komutu görüntülenir ve \"Yeni Ürün\" komutundan hariç tutulacak tipler seçilir. ",
  "XSLAccordionTab": "Ürün Teknik Özellik Tipleri",
  "GeneralConfigurationAccordionTab": "Yayınlanmış Anlık Görüntü",
  "SpecManagementHeader": "Teknik Özellik Yönetimi Deneyimini Yapılandır",
  "ProductSpecTypesAccordionTab": "Ürün",
  "RawMaterialTypesAccordionTab": "Ham Madde",
  "NoTypeSelected": "Yapılandırılacak tipleri seçin",
  "TypeSaveSuccess": "Seçili tipler için konfigürasyon değişiklikleri kaydedildi.",
  "TypeSaveFailure": "Seçili tiplerin konfigürasyonu kaydedilemedi",
  "saveButtonText": "Kaydet",
  "resetButtonText": "Sıfırla",
  "SelectTypes": "Tipleri seçin...",
  "InfoLabelForProduct": "\"Yeni Ürün\" komutundan hariç tutulacak tipleri seçin ve Kaydet'e tıklayın",
  "InfoDescriptionForProduct": "Bu unsur, Yöneticinin oluşturma için desteklenen ürün teknik özellik tipleri listesini yapılandırmasını sağlar. Kaydedilen tipler \"Yeni Ürün\" komutu altında gösterilmez ",
  "InfoLabelForRawMat": "\"Yeni Ham Madde\" komutunun dışında bırakılacak tipleri seçin ve Kaydet'e tıklayın ",
  "InfoDescriptionForRawMat": "Bu unsur, Yöneticinin oluşturma için desteklenen Ham Madde tipleri listesini yapılandırmasını sağlar. Kaydedilen tipler \"Yeni Ham Madde\" komutu altında gösterilmez ",
  "FetchTypes": "Tipler Alınıyor...",
  "RefreshingTypes": "Tipler Güncelleniyor...",
  "UnsavedNotification": "Kaydedilmemiş konfigürasyon değişiklikleriniz var ",
  "PhysicalProduct": "Fiziksel Ürün",
  "SuccessfulSettingsApplied": "Ayar başarıyla uygulandı.",
  "AllTypesSelected": "Tüm tipler hariç tutulamıyor.\n Bir tipin seçimini kaldırarak diğerlerini hariç tutun.",
  "FormulatedProductAccordionTab": "Formüle Edilmiş Ürün",
  "InfoLabelForFRMProduct": "Formül Malzeme Listesi Birimleri",
  "InfoDescForFRMProduct": "Bu unsur, Yöneticinin Formül Malzeme Listesi Birimlerini yapılandırmasını sağlar",
  "Weight": "Ağırlık",
  "Percentage": "Yüzde",
  "SelectFBOMunits": "Uygulanabilir birimleri seçin...",
  "BOMUnitsSaveSuccess": "Formül Malzeme Listesi Birimleri için konfigürasyon değişiklikleri kaydedildi.",
  "BOMUnitsSaveFailure": "Seçili Formül Malzeme Listesi Birimleri konfigürasyonu kaydedilemedi",
  "EnableOOTBProductSpecTypes": "Ortak Bulut için \"Yeni Ürün\" komutunu etkinleştir",
  "EnableOOTBProductSpecTypesDesc": "Bu, uygulama tarafından sağlanan Ürün Teknik Özellikleri alt tiplerinin kullanılmasını sağlayacaktır. Ortak Bulut müşterileri için önerilen alternatif, alt tip yerine IP Sınıflandırması kullanılmasıdır. Özel bulut müşterileri kendi alt tiplerini oluşturma özelliğine sahiptir ve bu komutu etkinleştirmemelidir.",
  "MaterialAccordionTab": "Malzeme",
  "ModelingandSimulationOptional": "3B Modelleme ve Simülasyon için Malzeme Kullanımını Etkinleştir",
  "ModelingandSimulationOptionalDesc": "3B ve simülasyon modellerinde kullanılacak Temel malzemeleri ve/veya Kaplama malzemelerini belirlemek için bu seçeneği açın",
  "FormulaOptional": "Formülasyon için Malzeme kullanımını etkinleştir",
  "FormulaOptionalDesc": "Formülasyon Tasarımında yazılı bir tariften formüle edilmiş bir ürün elde etmek için bu seçeneği açın",
  "ErrorMessforBothSettings": "En az bir malzeme ayarının açılması gerekir. Mevcut seçenekleri kontrol edin ve ihtiyaçlarınıza uygun seçenekleri belirleyin.",
  "ErrorMessforDisableFormulaSetting": "Tariflere bağlı olarak formüle edilmiş ürünler bulunduğunda bu ayar devre dışı bırakılamaz",
  "ErrorMessforFormulaSettingService": "Tariflerle bağlantılı olarak formüle edilmiş ürünler yüklenirken hata oluştu. Lütfen yöneticiyle iletişime geçin."
}
