{
  "SpecificationTemplateOptional": "Schnappschuss-Freigabefunktion aktivieren",
  "SpecificationTemplateOptionalDesc": "Mit dieser Funktion wird eine PDF-Datei erstellt, in der die Daten eines Konstruktionselements oder eines Dokuments erfasst werden, so wie sie zum Zeitpunkt der Berichterstellung vorliegen. Für die Funktion ist eine Vorlage des Typs \"Spezifikationsbericht\" erforderlich, die mit der App \"CATIA Report Template Design\" erstellt wurde. Weitere Informationen finden Sie in den Administrator- und Benutzerhandbüchern.",
  "ProductSpecificationCreateOptional": "Befehl \"Neues Produkt\" im Begrüßungsfenster anzeigen",
  "ProductSpecificationCreateOptionalDesc": "Wenn diese Option aktiviert ist, wird der Befehl \"Neues Produkt\" im Begrüßungsfenster angezeigt. Wählen Sie die Typen aus, die vom Befehl \"Neues Produkt\" ausgeschlossen werden sollen. ",
  "XSLAccordionTab": "Produktspezifikationstypen",
  "GeneralConfigurationAccordionTab": "Schnappschuss freigeben",
  "SpecManagementHeader": "Spezifikationsverwaltungserfahrung konfigurieren",
  "ProductSpecTypesAccordionTab": "Produkt",
  "RawMaterialTypesAccordionTab": "Rohstoff",
  "NoTypeSelected": "Zu konfigurierende Typen auswählen",
  "TypeSaveSuccess": "Konfigurationsänderungen für ausgewählte Typen wurden gespeichert.",
  "TypeSaveFailure": "Ausgewählte Typenkonfiguration konnte nicht gespeichert werden",
  "saveButtonText": "Speichern",
  "resetButtonText": "Zurücksetzen",
  "SelectTypes": "Typen auswählen...",
  "InfoLabelForProduct": "Wählen Sie die Typen aus, die aus dem Befehl \"Neues Produkt\" ausgeschlossen werden sollen, und klicken Sie auf Speichern",
  "InfoDescriptionForProduct": "Mit dieser Funktion kann der Administrator die Liste der Produktspezifikationstypen konfigurieren, die für die Erstellung unterstützt werden. Gespeicherte Typen werden nicht unter dem Befehl \"Neues Produkt\" angezeigt ",
  "InfoLabelForRawMat": "Wählen Sie die Typen aus, die aus dem Befehl \"Neues Rohmaterial\" ausgeschlossen werden sollen, und klicken Sie auf Speichern ",
  "InfoDescriptionForRawMat": "Mit dieser Funktion kann der Administrator die Liste der Rohmaterialtypen konfigurieren, die für die Erstellung unterstützt werden. Gespeicherte Typen werden nicht unter dem Befehl \"Neues Rohmaterial\" angezeigt ",
  "FetchTypes": "Typen werden abgerufen...",
  "RefreshingTypes": "Typen werden aktualisiert...",
  "UnsavedNotification": "Es liegen ungespeicherte Konfigurationsänderungen vor ",
  "PhysicalProduct": "Physisches Produkt",
  "SuccessfulSettingsApplied": "Einstellung erfolgreich angewendet.",
  "AllTypesSelected": "Es können nicht alle Typen ausgeschlossen werden.\n Heben Sie die Auswahl eines Typs auf, um andere auszuschließen.",
  "FormulatedProductAccordionTab": "Formuliertes Produkt",
  "InfoLabelForFRMProduct": "Stücklisteneinheiten der Formel",
  "InfoDescForFRMProduct": "Mit dieser Funktion kann der Administrator die Stücklisteneinheiten der Formel konfigurieren",
  "Weight": "Gewicht",
  "Percentage": "Prozentsatz",
  "SelectFBOMunits": "Entsprechende Einheiten auswählen...",
  "BOMUnitsSaveSuccess": "Konfigurationsänderungen für Stücklisteneinheiten der Formel wurden gespeichert.",
  "BOMUnitsSaveFailure": "Die Konfiguration der ausgewählten Stücklisteneinheiten der Formel konnte nicht gespeichert werden",
  "EnableOOTBProductSpecTypes": "Befehl \"Neues Produkt\" für die Public Cloud aktivieren",
  "EnableOOTBProductSpecTypesDesc": "Dies ermöglicht die Verwendung von Subtypen der Produktspezifikation, die von der Anwendung bereitgestellt werden. Die empfohlene Alternative für Public Cloud-Kunden ist die Verwendung von IP Classification anstelle der Subtypisierung. Private Cloud-Kunden haben die Möglichkeit, ihre eigenen Subtypen zu erstellen und sollten diesen Befehl nicht aktivieren.",
  "MaterialAccordionTab": "Material",
  "ModelingandSimulationOptional": "Materialverwendung für 3D Modeling und Simulation aktivieren",
  "ModelingandSimulationOptionalDesc": "Aktivieren Sie diese Option, um Kern- und/oder Beschichtungsmaterialien für die Verwendung in 3D- und Simulationsmodellen anzugeben",
  "FormulaOptional": "Materialverwendung für Formulierung aktivieren",
  "FormulaOptionalDesc": "Aktivieren Sie diese Option, um ein formuliertes Produkt aus einem Rezept zu entwickeln, das in Formulation Design erstellt wurde",
  "ErrorMessforBothSettings": "Mindestens eine Materialeinstellung muss aktiviert sein. Prüfen Sie die verfügbaren Optionen und wählen Sie die Optionen aus, die Ihren Anforderungen entsprechen.",
  "ErrorMessforDisableFormulaSetting": "Diese Einstellung kann nicht deaktiviert werden, wenn mit Rezepten verknüpfte formulierte Produkte vorhanden sind",
  "ErrorMessforFormulaSettingService": "Fehler beim Laden der mit Rezepten verknüpften formulierten Produkte. Wenden Sie sich an den Administrator."
}
