{
  "SpecificationTemplateOptional": "Attiva la funzione Istantanea rilascio",
  "SpecificationTemplateOptionalDesc": "Questa funzione genera un PDF che acquisisce i dati di un articolo ingegneristico o di un documento nel momento in cui viene generato il report. La funzione richiede un modello di tipo 'Specification Report Template' creato utilizzando l'app 'CATIA Report Template Design'. Per ulteriori informazioni, consultare Amministrazione e Guide per l'utente.",
  "ProductSpecificationCreateOptional": "Mostra il comando 'Nuovo prodotto' nel pannello di benvenuto",
  "ProductSpecificationCreateOptionalDesc": "Se questa opzione è selezionata, il comando 'Nuovo prodotto' viene visualizzato nel pannello di benvenuto; selezionare i tipi da escludere dal comando 'Nuovo prodotto'. ",
  "XSLAccordionTab": "Tipi di specifiche del prodotto",
  "GeneralConfigurationAccordionTab": "Istantanea rilascio",
  "SpecManagementHeader": "Configura esperienza di gestione specifiche",
  "ProductSpecTypesAccordionTab": "Prodotto",
  "RawMaterialTypesAccordionTab": "Materia prima",
  "NoTypeSelected": "Seleziona tipi da configurare",
  "TypeSaveSuccess": "Le modifiche alla configurazione dei tipi selezionati vengono salvate.",
  "TypeSaveFailure": "Impossibile salvare la configurazione dei tipi selezionati",
  "saveButtonText": "Salva",
  "resetButtonText": "Ripristina",
  "SelectTypes": "Seleziona tipi...",
  "InfoLabelForProduct": "Selezionare i tipi da escludere dal comando 'Nuovo prodotto' e fare clic su Salva",
  "InfoDescriptionForProduct": "Questa funzione consente all'amministratore di configurare l'elenco dei tipi di specifiche del prodotto supportati per la creazione. I tipi salvati non vengono visualizzati sotto il comando 'Nuovo prodotto' ",
  "InfoLabelForRawMat": "Selezionare i tipi da escludere dal comando 'Nuova materia prima' e fare clic su Salva ",
  "InfoDescriptionForRawMat": "Questa funzione consente all'amministratore di configurare l'elenco dei tipi di materie prime supportati per la creazione. I tipi salvati non vengono visualizzati nel comando 'Nuova materia prima' ",
  "FetchTypes": "Recupero dei tipi in corso...",
  "RefreshingTypes": "Aggiornamento dei tipi in corso...",
  "UnsavedNotification": "Sono presenti modifiche alla configurazione non salvate ",
  "PhysicalProduct": "Prodotto fisico",
  "SuccessfulSettingsApplied": "Applicazione delle impostazioni riuscita.",
  "AllTypesSelected": "Impossibile escludere tutti i tipi.\n Deselezionare un tipo per escludere gli altri.",
  "FormulatedProductAccordionTab": "Prodotto formulato",
  "InfoLabelForFRMProduct": "Unità distinta materiali formula",
  "InfoDescForFRMProduct": "Questa funzione consente all'amministratore di configurare le unità distinta materiali formula",
  "Weight": "Peso",
  "Percentage": "Percentuale",
  "SelectFBOMunits": "Selezionare le unità applicabili.",
  "BOMUnitsSaveSuccess": "Le modifiche alla configurazione per le unità distinta materiali formula sono state salvate.",
  "BOMUnitsSaveFailure": "Impossibile salvare la configurazione delle unità distinta materiali formula selezionata",
  "EnableOOTBProductSpecTypes": "Attivare il comando 'Nuovo prodotto' per il Cloud pubblico",
  "EnableOOTBProductSpecTypesDesc": "In questo modo sarà possibile utilizzare i sottotipi delle specifiche del prodotto forniti dall'applicazione. L'alternativa consigliata per i clienti sul Cloud pubblico è utilizzare la classificazione IP invece della sottotipazione. I clienti sul Cloud privato hanno la possibilità di creare i propri sottotipi e non devono attivare questo comando.",
  "MaterialAccordionTab": "Materiale",
  "ModelingandSimulationOptional": "Abilita l'uso dei materiali per la modellazione e la simulazione 3D",
  "ModelingandSimulationOptionalDesc": "Attivare questa opzione per specificare i materiali del nucleo e/o del rivestimento da utilizzare nei modelli 3D e di simulazione",
  "FormulaOptional": "Consenti l'uso del materiale per la formulazione",
  "FormulaOptionalDesc": "Attivare questa opzione per creare un prodotto formulato da una ricetta creata in Formulation Design",
  "ErrorMessforBothSettings": "È necessario attivare almeno un'impostazione del materiale. Controllare le opzioni disponibili e scegliere quelle che soddisfano le proprie esigenze.",
  "ErrorMessforDisableFormulaSetting": "Questa impostazione non può essere disattivata quando sono presenti prodotti formulati collegati a Ricette",
  "ErrorMessforFormulaSettingService": "Errore nel caricamento dei prodotti formulati collegati a Ricette. Contattare l'amministratore."
}
