{
  "SpecificationTemplateOptional": "Activar la función Instantánea de emisión",
  "SpecificationTemplateOptionalDesc": "Esta función genera un PDF capturando los datos de un elemento de ingeniería o un documento tal y como están en el momento en que se genera el informe. La función requiere una plantilla de tipo \"Plantilla de informe de especificación\" creada con la aplicación \"CATIA Report Template Design\". Para obtener más información, consulte las guías de administración y de usuario.",
  "ProductSpecificationCreateOptional": "Mostrar el comando \"Producto nuevo\" en el panel de bienvenida.",
  "ProductSpecificationCreateOptionalDesc": "Cuando está seleccionado, el comando \"Producto nuevo\" se muestra en el panel de bienvenida y selecciona los tipos que se excluirán del comando \"Producto nuevo\". ",
  "XSLAccordionTab": "Tipos de especificación del producto",
  "GeneralConfigurationAccordionTab": "Instantánea de emisión",
  "SpecManagementHeader": "Configurar la experiencia de gestión de especificación",
  "ProductSpecTypesAccordionTab": "Producto",
  "RawMaterialTypesAccordionTab": "Materia prima",
  "NoTypeSelected": "Seleccione los tipos que desea configurar",
  "TypeSaveSuccess": "Se han guardado los cambios de configuración para los tipos seleccionados.",
  "TypeSaveFailure": "Error al guardar la configuración de tipos seleccionados",
  "saveButtonText": "Guardar",
  "resetButtonText": "Restablecer",
  "SelectTypes": "Seleccionar tipos...",
  "InfoLabelForProduct": "Seleccione los tipos que desea excluir del comando Producto nuevo y haga clic en Guardar",
  "InfoDescriptionForProduct": "Esta función permite al administrador configurar la lista de tipos de especificaciones de productos compatibles para su creación. Los tipos guardados no se muestran en el comando Producto nuevo ",
  "InfoLabelForRawMat": "Seleccione los tipos que desea excluir del comando \"Nueva materia prima\" y haga clic en Guardar ",
  "InfoDescriptionForRawMat": "Esta función permite al administrador configurar la lista de tipos de materias primas compatibles con la creación. Los tipos guardados no se muestran en el comando \"Nueva materia prima\" ",
  "FetchTypes": "Obteniendo tipos...",
  "RefreshingTypes": "Actualizando tipos...",
  "UnsavedNotification": "Tiene cambios de configuración sin guardar ",
  "PhysicalProduct": "Producto físico",
  "SuccessfulSettingsApplied": "La configuración se ha aplicado correctamente.",
  "AllTypesSelected": "No se pueden excluir todos los tipos.\n Anule la selección de un tipo para excluir otros.",
  "FormulatedProductAccordionTab": "Producto formulado",
  "InfoLabelForFRMProduct": "Unidades de LDM de fórmula",
  "InfoDescForFRMProduct": "Esta función permite al administrador configurar las unidades de LDM de fórmula",
  "Weight": "Peso",
  "Percentage": "Porcentaje",
  "SelectFBOMunits": "Seleccione las unidades aplicables.",
  "BOMUnitsSaveSuccess": "Se han guardado los cambios de configuración de las unidades de LDM de fórmula.",
  "BOMUnitsSaveFailure": "Error al guardar la configuración de unidades de LDM de fórmula seleccionada",
  "EnableOOTBProductSpecTypes": "Habilite el comando \"Nuevo producto\" para la nube pública",
  "EnableOOTBProductSpecTypesDesc": "Esto permitirá el uso de subtipos de especificación de producto proporcionados por la aplicación. La alternativa recomendada para los clientes de la nube pública es utilizar la clasificación de IP en lugar de los subtipos. Los clientes de nube privada tienen la capacidad de crear sus propios subtipos y no deben habilitar este comando.",
  "MaterialAccordionTab": "Material",
  "ModelingandSimulationOptional": "Activar el uso de material para el modelado en 3D y la simulación",
  "ModelingandSimulationOptionalDesc": "Active esta opción para especificar los materiales principales o de cobertura para su uso en modelos 3D y de simulación",
  "FormulaOptional": "Activar el uso de material para la formulación",
  "FormulaOptionalDesc": "Active esta opción para generar un producto formulado a partir de una receta creada en Formulation Design",
  "ErrorMessforBothSettings": "Debe activarse al menos un ajuste de material. Compruebe las opciones disponibles y elija las que mejor se adapten a sus necesidades.",
  "ErrorMessforDisableFormulaSetting": "Este ajuste no se puede desactivar cuando hay productos formulados vinculados a recetas",
  "ErrorMessforFormulaSettingService": "Error al cargar los productos formulados vinculados a las recetas. Póngase en contacto con el administrador."
}
