# ENOXConfigurationERServicesStringResource.properties-- String Resource file for Translation.
# Copyright (c) 1992-2017 Dassault Systemes.
# All Rights Reserved.

ENOXConfigurationERServicesStringResource.IDsMandatory=\u30d5\u30a3\u30fc\u30eb\u30c9ids\u304c\u5165\u529b\u3067\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.BadEnumValues=\u5c5e\u6027\u5024\u304c\u5165\u529b\u3067\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u6b21\u306e\u4e2d\u304b\u3089\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\uff1a 

ENOXConfigurationERServicesStringResource.EvolutionContentMissing=\u5c5e\u6027evolutionContent\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.EvolutionContentNullEmpty=\u5c5e\u6027evolutionContent\u304c\u5165\u529b\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.VariantContentMissing=\u5c5e\u6027variantContent\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.VariantContentNullEmpty=\u5c5e\u6027variantContent\u304c\u5165\u529b\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.AttributeIdentifierMissing=\u5c5e\u6027identifier\u304c\u5165\u529b\u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.AttributeIdentifierNullEmpty=\u5c5e\u6027identifier\u304c\u5165\u529b\u3067\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.EffExprListNull=\u5165\u529b\u6709\u52b9\u6027\u5f0f\u30ea\u30b9\u30c8\u304c\u30cc\u30eb\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.EffExprListEmpty=\u5165\u529b\u6709\u52b9\u6027\u5f0f\u30ea\u30b9\u30c8\u304c\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.InputXMLError=\u5165\u529bXML\u5f0f\u306e\u9069\u7528\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
ENOXConfigurationERServicesStringResource.SetEffectivityFailed=\u6709\u52b9\u6027\u306e\u8a2d\u5b9a\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
ENOXConfigurationERServicesStringResource.CheckWorkUnder=\u5c55\u958b\u6709\u52b9\u6027\u306e\u8a2d\u5b9a\u306f\u3001\u5909\u66f4\u5236\u5fa1\uff0f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u4e0b\u3067\u4f5c\u696d\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u884c\u3048\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.SetEffRootNotConfigured=\u6307\u5b9a\u3055\u308c\u305f\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u89aa\u90e8\u54c1\u306b\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u304c\u3042\u308a\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.SetEffCriteriaNotEnabled=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u6761\u4ef6\u30bf\u30a4\u30d7\u3067\u3059\u3002\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u6761\u4ef6\u30bf\u30a4\u30d7\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ENOXConfigurationERServicesStringResource.SetEffFromModelNotAttached=\u30e2\u30c7\u30eb\u304c\u5165\u529bXML\u5f0f\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u53c2\u7167\u306b\u6dfb\u4ed8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.FailureDuringOperation=\u64cd\u4f5c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
ENOXConfigurationERServicesStringResource.FailureDuringExposedService=\u516c\u958b\u3055\u308c\u305f\u30b5\u30fc\u30d3\u30b9\u306e\u4f7f\u7528\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002

ENOXConfigurationERServicesStringResource.RelPidListNull=\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u306e\u5165\u529b\u30ea\u30b9\u30c8\u304c\u30cc\u30eb\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.RelPidListEmpty=\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u306e\u5165\u529b\u30ea\u30b9\u30c8\u304c\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.InstDoesNotHaveEff=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u6709\u52b9\u6027\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u8a2d\u5b9a\u89e3\u9664\u3067\u304d\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.InstControlledByChange=\u5165\u529b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u5909\u66f4\u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u307e\u3059\u3002
ENOXConfigurationERServicesStringResource.InstDoesNotHaveEffForDomain=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u3053\u306e\u30c9\u30e1\u30a4\u30f3\u306b\u5bfe\u3059\u308b\u6709\u52b9\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.UnsetEffUnsuccessful=\u6709\u52b9\u6027\u306e\u8a2d\u5b9a\u89e3\u9664\u64cd\u4f5c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
ENOXConfigurationERServicesStringResource.DomainIsForbiddenDecouplingActivated=\u5206\u96e2\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u5316\u3055\u308c\u3066\u304a\u308a\u3001\u6709\u52b9\u6027\u304c\u5206\u96e2\u3055\u308c\u3066\u3044\u308b\u304b\u5206\u96e2\u53ef\u80fd\u3067\u3042\u308b\u5834\u5408\u3001\u5165\u529b\u30c9\u30e1\u30a4\u30f3\u306f\u7981\u6b62\u3055\u308c\u307e\u3059\u3002
ENOXConfigurationERServicesStringResource.DomainIsForbiddenDecouplingNotActivated=\u5206\u96e2\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u5165\u529b\u30c9\u30e1\u30a4\u30f3\u306f\u7981\u6b62\u3055\u308c\u307e\u3059\u3002
ENOXConfigurationERServicesStringResource.CheckWorkUnderForUnsetEvolEff=\u5c55\u958b\u6709\u52b9\u6027\u306e\u8a2d\u5b9a\u89e3\u9664\u306f\u3001\u5909\u66f4\u5236\u5fa1\uff0f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u4e0b\u3067\u4f5c\u696d\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002

ENOXConfigurationERServicesStringResource.InstPidListNull=\u5165\u529b\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u30ea\u30b9\u30c8\u304c\u30cc\u30eb\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.InstPidListEmpty=\u5165\u529b\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u30ea\u30b9\u30c8\u304c\u7a7a\u3067\u3059\u3002

ENOXConfigurationERServicesStringResource.PhysicalIdNotValid=\u3053\u306e\u7269\u7406ID\u306f\u7121\u52b9\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.PhysicalIdNotTypeOfModel=\u3053\u306e\u7269\u7406ID\u306f\u30e2\u30c7\u30eb\u306e\u30bf\u30a4\u30d7\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.ModelUsedByEffectivity=\u3053\u306e\u30e2\u30c7\u30eb\u306f\u6709\u52b9\u6027\u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
ENOXConfigurationERServicesStringResource.ModelUsedByConfiguration=\u3053\u306e\u30e2\u30c7\u30eb\u306f\u69cb\u6210\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
ENOXConfigurationERServicesStringResource.ModelListIsNull=\u30e2\u30c7\u30eb\u30ea\u30b9\u30c8\u304c\u5165\u529b\u3067\u30cc\u30eb\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.ModelListIsEmpty=\u30e2\u30c7\u30eb\u30ea\u30b9\u30c8\u304c\u5165\u529b\u3067\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.InputObjectIsNull=\u5165\u529b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30cc\u30eb\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.InputObjectIsEmpty=\u5165\u529b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.InputObjectIsNonConfigurable=\u5165\u529b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u69cb\u6210\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002

ENOXConfigurationERServicesStringResource.CriteriaListIsNotJsonArray=\u6761\u4ef6\u30ea\u30b9\u30c8\u306fJsonArray\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.CriteriaListIsEmpty=\u6761\u4ef6\u30ea\u30b9\u30c8\u304c\u5165\u529b\u3067\u7a7a\u3067\u3059\u3002
ENOXConfigurationERServicesStringResource.UnexpectedCriteriaFound=\u4e88\u671f\u3057\u306a\u3044\u6761\u4ef6\u304c\u5165\u529b\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002

ENOXConfigurationERServicesStringResource.RelativePathIsRequired=\u5165\u529b\u306b\u5b58\u5728\u3059\u308b\u305f\u3081\u3001\u5c5e\u6027relativePath\u306f\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.SourceIsRequired=\u5165\u529b\u306b\u5b58\u5728\u3059\u308b\u305f\u3081\u3001\u5c5e\u6027\u30bd\u30fc\u30b9\u306f\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.TypeIsRequired=\u5165\u529b\u306b\u5b58\u5728\u3059\u308b\u305f\u3081\u3001\u5c5e\u6027\u30bf\u30a4\u30d7\u306f\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
ENOXConfigurationERServicesStringResource.NotAuthorizedToPerformOperation=\u73fe\u5728\u306e\u30e6\u30fc\u30b6\u30fc\u306f\u64cd\u4f5c\u306e\u5b9f\u884c\u3092\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ENOXConfigurationERServicesStringResource.NotHavePandOAccess=\u73fe\u5728\u306e\u30e6\u30fc\u30b6\u30fc\u306f\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306ePandO\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ENOXConfigurationERServicesStringResource.CheckWorkUnderForExtendEff=\u6709\u52b9\u6027\u306e\u62e1\u5f35\u64cd\u4f5c\u306f\u3001\u300c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u4e0b\u3067\u4f5c\u696d\u300d\u306a\u3057\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.NoEffectivityToExtend=\u62e1\u5f35\u3059\u308b\u6709\u52b9\u6027\u304c\u4f55\u3082\u306a\u3044\u5834\u5408\u3001\u62e1\u5f35\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.EvolutionExprRequiredForExtend=\u62e1\u5f35\u64cd\u4f5c\u3092\u9069\u7528\u3067\u304d\u308b\u306e\u306f\u3001\u5c55\u958b\u5f0f\u3092\u6301\u3064\u6709\u52b9\u6027\u306b\u9650\u3089\u308c\u307e\u3059

ENOXConfigurationERServicesStringResource.InputLimitExceeded=\u5165\u529b\u5185\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u307e\u305f\u306f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u7dcf\u6570\u304c\u3001\u30b5\u30fc\u30d3\u30b9\u306b\u4e8b\u524d\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5236\u9650\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044

ENOXConfigurationERServicesStringResource.IDsFieldMissing=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027ID\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.IncorrectDomainValue=\u5165\u529b\u5185\u306e\u5c5e\u6027\u5024\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u6b21\u306e\u4e2d\u304b\u3089\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\uff1aEVOLUTION\u3001VARIANT\u3001ALL
ENOXConfigurationERServicesStringResource.IncorrectViewValue=\u5165\u529b\u5185\u306e\u5c5e\u6027\u5024\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u6b21\u306e\u4e2d\u304b\u3089\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\uff1aCURRENT\u3001PROJECTED\u3001ALL
ENOXConfigurationERServicesStringResource.IncorrectFormatValue=\u5165\u529b\u5185\u306e\u5c5e\u6027\u5024\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u6b21\u306e\u4e2d\u304b\u3089\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\uff1aTXT\u3001XML

ENOXConfigurationERServicesStringResource.InstPidNullOREmpty=\u5165\u529b\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u304c\u30cc\u30eb\u307e\u305f\u306f\u7a7a\u3067\u3059

ENOXConfigurationERServicesStringResource.CheckWorkUnderForEvolveInstance=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u5c55\u958b\u64cd\u4f5c\u306f\u3001\u300c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u4e0b\u3067\u4f5c\u696d\u300d\u306a\u3057\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.EvolveInstanceOperationFailed=\u300c\u5c55\u958b\u306e\u4e0b\u3067\u4f5c\u696d\u300d\u5b9a\u7fa9\u306f\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u300c\u5c55\u958b\u6709\u52b9\u6027\u300d\u3092\u5b8c\u5168\u306b\u30ab\u30d0\u30fc\u3057\u3066\u3044\u307e\u3059\u3002\u300c\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u5c55\u958b\u300d\u306f\u7981\u6b62\u3055\u308c\u307e\u3059
ENOXConfigurationERServicesStringResource.EvolveInstanceNoEffIntersection=\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u300c\u5c55\u958b\u6709\u52b9\u6027\u300d\u3068\u300c\u5c55\u958b\u306e\u4e0b\u3067\u4f5c\u696d\u300d\u5b9a\u7fa9\u306e\u9593\u306b\u5171\u901a\u90e8\u5206\u304c\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.EvolveInstanceRootNotConfigured=\u30b9\u30c8\u30e9\u30af\u30c1\u30e3\u30fc\u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u300c\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u5c55\u958b\u300d\u306f\u7981\u6b62\u3055\u308c\u307e\u3059
ENOXConfigurationERServicesStringResource.EvolveInstanceNotAllModelsAttached=\u4e00\u90e8\u306e\u5fc5\u8981\u306a\u30e2\u30c7\u30eb\u304c\u3001\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u306b\u30a2\u30bf\u30c3\u30c1\u3055\u308c\u3066\u3044\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.EvolveInstanceInvalidAuthContextPID=\u5165\u529b\u5185\u306e\u30aa\u30fc\u30b5\u30ea\u30f3\u30b0\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u7269\u7406ID\u304c\u7121\u52b9\u3067\u3059

ENOXConfigurationERServicesStringResource.IncorrectEffectivityXML=\u5165\u529b\u6709\u52b9\u6027\u5f0f\u307e\u305f\u306f\u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u30c7\u30fc\u30bf\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.InvalidInstancePhysicalID=\u5165\u529b\u5185\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u8b58\u5225\u5b50\u304c\u3001\u7121\u52b9\u307e\u305f\u306f\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.LoadDictionaryFailed=\u8f9e\u66f8\u30c7\u30fc\u30bf\u304c\u539f\u56e0\u3067\u6709\u52b9\u6027\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093 
ENOXConfigurationERServicesStringResource.3DPartNotConfigurable=\u30eb\u30fc\u30c8\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u304c\u3001\u69cb\u6210\u53ef\u80fd\u3067\u306a\u30443D\u30d1\u30fc\u30c4\u3067\u3059 
ENOXConfigurationERServicesStringResource.XCADNotConfigurable=\u30eb\u30fc\u30c8\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u304c\u3001\u69cb\u6210\u53ef\u80fd\u3067\u306a\u3044XCAD\u3067\u5236\u5fa1\u3055\u308c\u3066\u3044\u307e\u3059
ENOXConfigurationERServicesStringResource.CriteriaNotEnabled=\u6761\u4ef6\u304c\u3001\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u3067\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.ModelNotAccessibleORExist=\u5165\u529b\u5f0f\u3067\u6307\u5b9a\u3055\u308c\u305f\u30e2\u30c7\u30eb\u306f\u3001\u30a2\u30af\u30bb\u30b9\u3067\u304d\u306a\u3044\u304b\u5b58\u5728\u3057\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.NoModelFoundInExpression=\u5165\u529b\u5f0f\u304c\u6b63\u3057\u304f\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093(\u30e2\u30c7\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093)
ENOXConfigurationERServicesStringResource.CriteriaUsedInXMLNotEnabled=\u5165\u529b\u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u6761\u4ef6\u304c\u3001\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u3067\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.ErrorSaveEffectivities=\u65b0\u3057\u3044\u6709\u52b9\u6027\u306e\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
ENOXConfigurationERServicesStringResource.ErrorDueToUpdateConfigRevEff=\u69cb\u6210\u30ea\u30d3\u30b8\u30e7\u30f3\u306e\u6709\u52b9\u6027\u306e\u66f4\u65b0\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
ENOXConfigurationERServicesStringResource.SetEffFailedDueFrozenEvolution=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u30ea\u30ea\u30fc\u30b9\u6e08\u307f\u306e\u5c55\u958b\u306e\u4e00\u90e8\u3067\u3059\u3002\u65b0\u3057\u3044\u5c55\u958b\u5f0f\u306f\u9069\u7528\u3067\u304d\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.ReferenceNotConfigurable=\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u304c\u69cb\u6210\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.RootNotConfigured=\u6307\u5b9a\u3055\u308c\u305f\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u89aa\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u306b\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u304c\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.ModelNotAttached=\u5165\u529b\u5f0f\u3067\u6307\u5b9a\u3055\u308c\u305f\u30e2\u30c7\u30eb\u306f\u3001\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4e00\u90e8\u3067\u306f\u3042\u308a\u307e\u305b\u3093

ENOXConfigurationERServicesStringResource.InstanceIsNullOREmpty=\u5165\u529b\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u304cnull\u304b\u7a7a\u3067\u3059
ENOXConfigurationERServicesStringResource.FilterIdentifierFieldMissing=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u30d5\u30a3\u30eb\u30bf\u30fcID\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.FilterIdentifierFieldNullOREmpty=\u5165\u529bJSON\u306b\u5fc5\u9808\u306e\u5c5e\u6027\u30d5\u30a3\u30eb\u30bf\u30fcID\u304cnull\u304b\u7a7a\u767d\u3067\u3059
ENOXConfigurationERServicesStringResource.ViewFieldValueIsInvalid=\u5165\u529b\u3055\u308c\u305f\u5c5e\u6027\u30d3\u30e5\u30fc\u306e\u5024\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u30d3\u30e5\u30fc\u306e\u6709\u52b9\u306a\u5024\u306f\u3001\u300c\u73fe\u5728\u300d\u307e\u305f\u306f\u300c\u4e88\u6e2c\u300d\u3067\u3059
ENOXConfigurationERServicesStringResource.ModeFieldValueIsInvalid=\u5165\u529b\u306e\u5c5e\u6027\u30e2\u30fc\u30c9\u5024\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u30e2\u30fc\u30c9\u306e\u6b63\u3057\u3044\u5024\u306f\u300c\u53b3\u5bc6\u300d\u307e\u305f\u306f150%\u3067\u3059
ENOXConfigurationERServicesStringResource.ConfigFilterTypeNotSupported=\u5165\u529b\u306b\u306f\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30b3\u30f3\u30d5\u30a3\u30ae\u30e5\u30ec\u30fc\u30b7\u30e7\u30f3\u30d5\u30a3\u30eb\u30bf\u30fc\u30bf\u30a4\u30d7\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
ENOXConfigurationERServicesStringResource.InstanceNotFilterable=\u5165\u529b\u306e\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u306f\u30d5\u30a3\u30eb\u30bf\u30fc\u3067\u304d\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.ConfigFilterNotFoundOnReference=\u5165\u529b\u30b3\u30f3\u30d5\u30a3\u30ae\u30e5\u30ec\u30fc\u30b7\u30e7\u30f3\u30d5\u30a3\u30eb\u30bf\u30fc\u304c\u53c2\u7167\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.InstanceDoesNotHaveStaticMapping=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u3001\u524a\u9664\u3059\u308b\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u304c\u3042\u308a\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.NoStaticMappingImpossibleToUpdate=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u304c\u306a\u3044\u305f\u3081\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093
ENOXConfigurationERServicesStringResource.InstanceAlreadyHasStaticMapping=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u3059\u3067\u306b\u9759\u7684\u30de\u30c3\u30d4\u30f3\u30b0\u304c\u3042\u308a\u307e\u3059

ENOXConfigurationERServicesStringResource.RelPidListNullOREmpty=\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u7269\u7406ID\u306e\u5165\u529b\u30ea\u30b9\u30c8\u304cnull\u307e\u305f\u306f\u7a7a\u3067\u3059

Warning.InstanceNotFilterable=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u6709\u52b9\u6027\u5f0f\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
Warning.NotPossibleExtendOnThisInstance=\u3059\u3079\u3066\u306e\u5c55\u958b\u3067\u3059\u3067\u306b\u5229\u7528\u53ef\u80fd\u306a\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u62e1\u5f35\u64cd\u4f5c\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093
Error.ExtendFailedOnThisInstance=\u62e1\u5f35\u64cd\u4f5c\u306f\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093

Error.AttachConfigContextFailedOnRevisedReference=\u300c\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u6dfb\u4ed8\u300d\u306f\u3001\u6539\u8a02\u3055\u308c\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

Error.EnableModelVersionCriteriaFailed=\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u53c2\u7167\u306b\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3068\u3057\u3066\u6dfb\u4ed8\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001ModelVersion\u57fa\u6e96\u3092\u6709\u52b9\u306b\u3059\u308b\u3053\u3068\u306f\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002
Error.MixConfigContextTypesNotAllowed=\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30bf\u30a4\u30d7\u306f\u5165\u529b\u5185\u3067\u540c\u3058\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u69cb\u6210\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u6df7\u5408\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093

Error.AttachCfgContext.FailedDueToMultipleMVs=\u69cb\u6210\u53ef\u80fd\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u8907\u6570\u306e\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u95a2\u9023\u4ed8\u3051\u308b\u3053\u3068\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u73fe\u5728\u3001\u95a2\u9023\u4ed8\u3051\u3067\u304d\u308b\u30e2\u30c7\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3\u306f1\u3064\u3060\u3051\u3067\u3059

Error.ExtendNotPossibleWithOnlyVariantCriteria=\u6709\u52b9\u6027\u306e\u62e1\u5f35\u64cd\u4f5c\u306f\u3001\u30d0\u30ea\u30a2\u30f3\u30c8\u6761\u4ef6\u306e\u307f\u304c\u6709\u52b9\u306a\u72b6\u614b\u3067\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002

Error.IncorrectInstancePID=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u7269\u7406ID\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093

Error.InstanceTypeIsConfigOptions=\u5165\u529b\u306e\u4e2d\u306b\u306f\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u69cb\u6210\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u542b\u307e\u308c\u307e\u3059\u3002\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30bf\u30a4\u30d7\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093

