{
"ToggleAuxiliaryView.Title":"Hilfsansicht",
"ToggleAuxiliaryView.ShortHelp":"Öffnet die <wintitle>Hilfsansicht</wintitle> zur Verwaltung nicht klassifizierter Objekte.",
"SearchAndAddInstanceCommand.Title":"Einfügen",
"SearchAndAddInstanceCommand.ShortHelp":"<p>Eine Instanz zu einem System hinzufügen oder ein System in der IP Classify and Reuse-App auswählen</p>",
"SearchAndAddInstanceCommand.LongHelp":"<p>Geben Sie in der Suchleiste den Namen Ihrer Instanz ein. Wählen Sie die Instanz in der Datenbank aus und klicken Sie auf <uicontrol>Suchen</uicontrol> oder wählen Sie ein Fertigungselement in der IP Classify & Reuse-App aus und klicken Sie auf <uicontrol>Einfügen</uicontrol>.</p>",
"InsertAsCopy.Title":"Als Kopie einfügen",
"InsertAsCopy.ShortHelp":"<p>Wählen Sie ein System oder einen Vorgang in der IP Classify and Reuse-App aus und klicken Sie auf <uicontrol>Als Kopie einfügen</uicontrol>.</p>",
"DuplicateAdv.Title":"Erweitertes Duplizieren",
"DuplicateAdv.ShortHelp":"Dupliziert ein System und bietet die Möglichkeit, zugehörige Verknüpfungen beizubehalten.",
"DuplicateAdv.LongHelp":"Wählen Sie ein System aus und klicken Sie auf <uicontrol>Erweitertes Duplizieren</uicontrol>.",
"DisplayProperties.Title":"Informationen bearbeiten",
"DisplayProperties.ShortHelp":"Zeigt die Informationen eines Objekts an.",
"DisplayProperties.LongHelp":"Wählen Sie ein Objekt aus und klicken Sie auf <uicontrol>Informationen</uicontrol>, um seine Eigenschaften anzuzeigen.",
"DetachInstance.Title":"Exemplar entfernen",
"DetachInstance.ShortHelp":"Löscht eine Instanz aus der aktuellen Systemstruktur.",
"DetachInstance.LongHelp":"Wählen Sie ein Objekt aus und klicken Sie auf <uicontrol>OK</uicontrol>, um den Löschvorgang zu bestätigen.",
"AttachDocument.Title":"Dokument anfügen",
"AttachDocument.ShortHelp":"Hängt ein Dokument an ein System, eine Operation, ein Fertigungselement oder eine geeignete Ressource an.",
"AttachDocument.LongHelp":"Wählen Sie ein Objekt aus und klicken Sie auf <uicontrol>Dokument anfügen</uicontrol>. Geben Sie im Fenster <wintitle>Dokument anfügen</wintitle> einen Namen ein, wählen Sie ein Dokument aus und klicken Sie auf <uicontrol>Anfügen</uicontrol>.",
"ManageDocuments.Title":"Dokumente verwalten",
"ManageDocuments.ShortHelp":"Verwaltet Dokumente, die an das System, die Operation, das Fertigungselement oder geeignete Ressourcen angehängt sind.",
"ManageDocuments.LongHelp":"Sie können ein Dokument im Fenster <wintitle>Dokumente verwalten</wintitle> hinzufügen, löschen oder herunterladen.",
"SearchDocument.Title":"Dokument suchen und hinzufügen",
"SearchDocument.ShortHelp":"Fügt ein vorhandenes Dokument zu einem System, einer Operation, einem Fertigungselement oder geeigneten Ressourcen hinzu.",
"SearchDocument.LongHelp":"Geben Sie in der Suchleiste den Namen Ihres Dokuments in die Datenbank ein, wählen Sie es in den Suchergebnissen aus und klicken Sie auf <uicontrol>OK</uicontrol>.",
"Relations.Title":"Beziehungsfenster",
"Relations.ShortHelp":"Zeigt die Kennung des Objekts an, das mit dem System oder einer Operation verknüpft ist.",
"CreateCapableResourceStructureLink.Title":"Geeignete Ressourcenstruktur erstellen",
"CreateCapableResourceStructureLink.ShortHelp":"Erstellt ein Ressourcenobjekt des Bereichstyps und eine geeignete Ressourcen- strukturverknüpfung zwischen dem ausgewählten Arbeitsplan und dem erstellten Bereich.",
"CreateCapableResourceStructureLink.LongHelp":"Wählen Sie einen Arbeitsplan aus und klicken Sie auf <uicontrol>Geeignete Ressourcenstruktur erstellen</uicontrol>.",
"ManageCapableResources.Title":"Geeignete Ressourcen verwalten",
"ManageCapableResources.ShortHelp":"Links zwischen geeigneten Ressourcen und System/Operation verwalten",
"ManageCapableResources.LongHelp":"Wählen Sie System/Operation aus und klicken Sie auf den Befehl. Erstellen Sie einen Link für geeignete primäre/sekundäre Ressourcen durch Drag & Drop einer Ressource aus der Ansicht der geeigneten Ressourcen oder aus der Suche.",
"CreateLink.Title":"Verknüpfung erstellen",
"CreateLink.ShortHelp":"Erstellt eine Verknüpfung zwischen einem System bzw. einer Operation und einem Fertigungselement bzw. einer Ressource.",
"CreateLink.LongHelp":"Mit diesem Befehl können Sie Verknüpfungen zwischen mehreren Elementen erstellen.",
"RelationalExplorerCmd.Title":"Zugehörige(s) Objekt(e)",
"RelationalExplorerCmd.ShortHelp":"Ermöglicht das Navigieren in Gültigkeitsbereichsverknüpfungen, Implementierungsverknüpfungen und geeigneten Ressourcen eines Objekts.",
"RelationalExplorerCmd.LongHelp":"Wählen Sie ein Objekt aus und klicken Sie auf <uicontrol>Zugehörige(s) Objekt(e)</uicontrol>.",
"Delete.Title":"System(e) löschen",
"Delete.ShortHelp":"Löscht die ausgewählte Systemstruktur.",
"Delete.LongHelp":"Wählen Sie mindestens ein System aus und klicken Sie auf den Befehl.",
"EditViewPreferences.Title":"Fenster „Voreinstellungen für Spaltenansicht anzeigen“",
"EditViewPreferences.ShortHelp":"Hier können Sie festlegen, welche Spalten im Widget angezeigt werden sollen.",
"EditViewPreferences.LongHelp":"Aktivieren Sie in der Spalte <wintitle>Ist sichtbar</wintitle> das Kontrollkästchen der Spalten, die auf der Benutzeroberfläche angezeigt werden sollen, und deaktivieren Sie das Kontrollkästchen der Spalten, die ausgeblendet werden sollen. Die Spaltenbreite kann manuell angepasst werden.",
"LayoutPreferences.Title":"Fenster „Voreinstellungen für Ansichtslayout anzeigen“",
"LayoutPreferences.ShortHelp":"Ermöglicht das Verwalten von Widget-Layoutvoreinstellungen.",
"DefineFilter.Title":"Filter",
"DefineFilter.ShortHelp":"Filtert Objekte basierend auf Attributen oder Konfigurationen.",
"DefineFilter.LongHelp":"Filterbefehl ist nicht verfügbar, wenn Erstellen aktiviert und der Datenbankmodus ausgewählt ist.",
"ManageInconsistentLinks.Title":"Verwaltung von Änderungsauswirkungen",
"ManageInconsistentLinks.ShortHelp":"Verwaltet unvollständige oder inkonsistente Implementierungsverknüpfungen zwischen Systemen oder Operationen und Elementen.",
"ManageInconsistentLinks.LongHelp":"Das Fenster <wintitle>Inkonsistente Verknüpfungen verwalten</wintitle> listet inkonsistente Verknüpfungen zwischen Systemen oder Operationen und Elementen auf. <p>Klicken Sie im Fenster auf <uicontrol>Umleiten</uicontrol>, <uicontrol>Löschen</uicontrol> oder <uicontrol>Ignorieren</uicontrol>, um die Verknüpfungen zu korrigieren.</p>",
"BIEssentialsCmd.Title":"B.I. Essentials – Zuordnungsstatus",
"BIEssentialsCmd.ShortHelp":"Berechnet den Zuordnungsstatus von Fertigungsartikeln und den Systemaktualisierungsstatus für die in der App geladene Struktur und zeigt sie als Farbcodes in den entsprechenden Ansichten an",
"ReplaceByLatestRevision.Title":"Durch neueste Revision ersetzen",
"ReplaceByLatestRevision.ShortHelp":"Ersetzt einen untergeordneten Vorgang durch die neueste Revision und aktualisiert Produktflüsse sowie Implementierungsverknüpfungen.",
"ReplaceByLatestRevision.LongHelp":"Einen untergeordneten Vorgang auswählen und auf „<uicontrol>Durch die neueste Revision ersetzen</uicontrol>“ klicken.",
"ReplaceByExisting.Title":"Durch bestehende ersetzen",
"ReplaceByExisting.ShortHelp":"Ersetzt einen untergeordneten Vorgang durch einen bestehenden und aktualisiert Produktflüsse sowie Implementierungsverknüpfungen.",
"ReplaceByExisting.LongHelp":"Einen untergeordneten Vorgang auswählen und auf „<uicontrol>Durch einen bestehenden ersetzen</uicontrol>“ klicken. In der Suchleiste die Kriterien für einen bestehenden Vorgang in der Datenbank eingeben. Den Vorgang auswählen und auf „<uicontrol>OK</uicontrol>“ klicken.",
"ReplaceByNewRevision.Title":"Durch neue Revision ersetzen",
"ReplaceByNewRevision.ShortHelp":"Erstellt eine neue Revision eines untergeordneten Vorgangs, ersetzt diesen durch die neue Revision und aktualisiert Produktflüsse sowie Implementierungsverknüpfungen.",
"ReplaceByNewRevision.LongHelp":"Einen untergeordneten Vorgang auswählen und auf „<uicontrol>Durch die neue Revision ersetzen</uicontrol>“ klicken.",
"ReplaceByNewReference.Title":"Durch neue ersetzen",
"UserDefinedExplore.Title":"Benutzerdefiniertes Untersuchen",
"UserDefinedExplore.ShortHelp":"Öffnet das Dialogfeld <wintitle>Benutzerdefiniertes Untersuchen</wintitle>.",
"UserDefinedExplore.LongHelp":"Wählen Sie im Feld <wintitle>Liste aller Verfahren</wintitle> entweder den Standardeintrag aus, woraufhin <uicontrol>Beziehungen in Ansichten laden</uicontrol> erscheint, oder eines der verfügbaren benutzerdefinierten (JavaScript-)Verfahren. Wenn Sie auf <uicontrol>Ausführen</uicontrol> klicken, wird dieses Verfahren mit dem ausgewählten Objekte als Eingabe ausgeführt und die zurückgegebenen Objekte werden in die entsprechenden Ansichten geladen.<p> <note type = 'notes'> <ul> <li>Die Verfügbarkeit der Verfahren hängt von dem ausgewählten Objekt ab. Wenn kein Objekt ausgewählt ist, wird das Dialogfeld nicht angezeigt und das Standardverhalten <uicontrol>Beziehungen in Ansichten laden</uicontrol> wird angewendet.</li> <li>Die benutzerdefinierten Verfahren müssen die Eigenschaft <codeph>VerfKategorie</codeph> mit dem Wert <codeph>Benutzerdefiniert</codeph> enthalten, bevor sie im Server bereitgestellt und in die Liste aufgenommen werden können.</li> </ul> </note> </p>",
"ProductFlowCmd.Title":"Fertigungsauftrags-Ablaufdiagramm",
"ProductFlowCmd.ShortHelp":"<p>Öffnet ein Fenster zum Verwalten der Strukturansicht.</p>",
"ProductFlowCmd.LongHelp":"<p>Klicken, um das Fertigungsauftragsdiagramm anzuzeigen.</p>",
"CreateWorkOrderFromProcess.Title":"Fertigungsauftrag aus Prozess erstellen",
"CreateWorkOrderFromProcess.ShortHelp":"<p>Öffnet ein Fenster zum Erstellen eines neuen Fertigungsauftrags aus dem Prozess.</p>",
"CreateWorkOrderFromProcess.LongHelp":"<p>Klicken, um einen neuen Fertigungsauftrag zu erstellen.</p>",
"WorkOrderView.Title":"Ansicht „Arbeitsauftrags- & Kopfdatenoperationen“ anzeigen",
"WorkOrderView.ShortHelp":"Blendet die Ansicht <wintitle>Arbeitsauftrags- & Kopfdatenoperationen</wintitle>, d. h. de Arbeitsauftragsblock, ein oder aus.",
"MaturityCmdCloud.Title":"Bearbeitungsstatus",
"MaturityCmdCloud.ShortHelp":"Ändert den Bearbeitungsstatus der ausgewählten Objekte.",
"MaturityCmdCloud.LongHelp":"<p>Wählen Sie im Dialogfeld den gewünschten Zielstatus aus dem Reifegraddiagramm aus, wenn Sie ein Objekt ausgewählt haben, oder aus der Liste, wenn Sie mehrere Objekte ausgewählt haben. Klicken Sie dann auf <uicontrol>OK</uicontrol>.</p>",
"DeleteCmdCloud.Title":"Arbeitsaufträge löschen",
"DeleteCmdCloud.ShortHelp":"Löscht die derzeit ausgewählten Objekte dauerhaft.",
"DeleteCmdCloud.LongHelp":"Wählen Sie ein oder mehrere Objekte aus und klicken Sie auf den Befehl.<p>Wenn Sie ein Objekt auswählen, wählen Sie die Option <uicontrol>Strukturelle Objekte einschließen</uicontrol> aus, um auch dessen untergeordnete Objekte zu löschen.</p>",
"ExplodeWorkOrderCmdCloud.Title":"Arbeitsauftrag neu zuweisen",
"ExplodeWorkOrderCmdCloud.ShortHelp":"Weisen Sie den Arbeitsauftrag einem anderen Arbeitsplan und entsprechenden Fertigungselement zu. Dadurch wird der Arbeitsauftrag basierend auf dem neu ausgewählten Arbeitsplan neu strukturiert.",
"ExplodeWorkOrderCmdCloud.LongHelp":"<p>Klicken Sie hier, um einen neuen Arbeitsauftrag basierend auf einem anderen Arbeitsplan oder Fertigungselement neu zuzuweisen.</p>",
"ToggleAuxiliaryView.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DuplicateAdv.WebHelp":"SharedUserMap/lifecycle-t-DuplicateAdvanced.htm",
"Delete.WebHelp":"SharedUserMap/lifecycle-t-Delete.htm",
"LayoutPreferences.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DefineFilter.WebHelp":"DelMgaUserMap/delmfna-m-Filter-sb.htm",
"BIEssentialsCmd.WebHelp":"DelMgaUserMap/delmga-t-BIEssentials.htm",
"ReplaceByLatestRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithItsLatestRevision",
"ReplaceByExisting.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithanExistingObject",
"ReplaceByNewRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithaNewRevision",
"WorkOrderView.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm"
}
