{
"ToggleAuxiliaryView.Title":"Vue auxiliaire",
"ToggleAuxiliaryView.ShortHelp":"Ouvre la <wintitle>Vue auxiliaire</wintitle> pour gérer les objets non classés.",
"SearchAndAddInstanceCommand.Title":"Insérer",
"SearchAndAddInstanceCommand.ShortHelp":"<p>Ajoute une instance à un système ou sélectionne un système dans l'app IP Classify and Reuse</p>",
"SearchAndAddInstanceCommand.LongHelp":"<p>Dans la barre de recherche, entrez le nom de votre instance. Sélectionnez l'instance dans la base de données et cliquez sur <uicontrol>Rechercher</uicontrol> ou sélectionnez un élément fabriqué dans l'app IP Classify and Reuse et cliquez sur <uicontrol>Insérer</uicontrol>.</p>",
"InsertAsCopy.Title":"Insérer comme copie",
"InsertAsCopy.ShortHelp":"<p>Sélectionnez un système ou une opération à partir de l'app IP Classify and Reuse et cliquez sur <uicontrol>Insérer comme copie</uicontrol>.</p>",
"DuplicateAdv.Title":"Duplication avancée",
"DuplicateAdv.ShortHelp":"Duplique un système avec l'option de conserver les liens connexes.",
"DuplicateAdv.LongHelp":"Sélectionnez un système et cliquez sur <uicontrol>Duplication avancée</uicontrol>.",
"DisplayProperties.Title":"Modifier les informations",
"DisplayProperties.ShortHelp":"Affiche les informations d'un objet.",
"DisplayProperties.LongHelp":"Sélectionnez un objet et cliquez sur <uicontrol>Informations</uicontrol> pour afficher ses propriétés.",
"DetachInstance.Title":"Détacher l'instance",
"DetachInstance.ShortHelp":"Supprime une instance de la structure de système actuelle.",
"DetachInstance.LongHelp":"Sélectionnez un objet et cliquez sur <uicontrol>OK</uicontrol> pour confirmer la suppression.",
"AttachDocument.Title":"Attacher un document",
"AttachDocument.ShortHelp":"Attache un document à un système, une opération, un élément fabriqué et une ressource possible.",
"AttachDocument.LongHelp":"Sélectionnez un objet et cliquez sur <uicontrol>Attacher un document</uicontrol>. Dans le panneau <wintitle>Attacher un document</wintitle>, saisissez un nom, sélectionnez un document et cliquez sur <uicontrol>Attacher</uicontrol>.",
"ManageDocuments.Title":"Gérer les documents",
"ManageDocuments.ShortHelp":"Gère les documents attachés à un système, une opération, un élément fabriqué et des ressources possibles.",
"ManageDocuments.LongHelp":"Vous pouvez ajouter, supprimer ou télécharger un document dans le panneau <wintitle>Gérer les documents</wintitle>.",
"SearchDocument.Title":"Rechercher et ajouter un document",
"SearchDocument.ShortHelp":"Ajoute un document existant à un système, une opération, un élément fabriqué et des ressources possibles.",
"SearchDocument.LongHelp":"Dans la barre de recherche, saisissez le nom de votre document stocké dans la base de données, sélectionnez-le dans les résultats de la recherche et cliquez sur <uicontrol>OK</uicontrol>.",
"Relations.Title":"Panneau Relations",
"Relations.ShortHelp":"Affiche l'identificateur de l'objet lié à un système ou une opération.",
"CreateCapableResourceStructureLink.Title":"Créer une structure de ressource capable",
"CreateCapableResourceStructureLink.ShortHelp":"Crée un objet de ressource du type de zone et un lien de structure de ressource possible entre le plan de travail sélectionné et la zone créée.",
"CreateCapableResourceStructureLink.LongHelp":"Sélectionnez un plan de travail et cliquez sur <uicontrol>Créer une structure de ressource capable</uicontrol>.",
"ManageCapableResources.Title":"Gérer les ressources possibles",
"ManageCapableResources.ShortHelp":"Gérer les liens entre les ressources possibles et le système/l'opération",
"ManageCapableResources.LongHelp":"Sélectionnez le système/l'opération et cliquez sur la commande. Créez un lien de ressource possible principal/secondaire en glissant/déposant une ressource à partir de la vue de ressource possible ou à partir de la recherche.",
"CreateLink.Title":"Créer un lien",
"CreateLink.ShortHelp":"Crée un lien entre un système ou une opération et un élément fabriqué ou une ressource.",
"CreateLink.LongHelp":"Cette commande vous permet de créer des liens entre plusieurs éléments.",
"RelationalExplorerCmd.Title":"Objet(s) lié(s)",
"RelationalExplorerCmd.ShortHelp":"Permet de parcourir les liens de portée, les liens d'implémentation et les ressources possibles d'un objet.",
"RelationalExplorerCmd.LongHelp":"Sélectionnez un objet puis cliquez sur <uicontrol>Objet(s) lié(s)</uicontrol>.",
"Delete.Title":"Supprimer le ou les systèmes",
"Delete.ShortHelp":"Supprime la structure de système sélectionnée.",
"Delete.LongHelp":"Sélectionnez un ou plusieurs systèmes et cliquez sur la commande.",
"EditViewPreferences.Title":"Afficher le panneau Afficher les préférences des colonnes",
"EditViewPreferences.ShortHelp":"Permet de définir quelles colonnes sont affichées dans le widget.",
"EditViewPreferences.LongHelp":"Dans la colonne <wintitle>Est visible</wintitle>, cochez la case des colonnes que vous souhaitez afficher dans l'interface, et décochez les cases des colonnes que vous souhaitez masquer. Vous pouvez ajuster manuellement la largeur des colonnes.",
"LayoutPreferences.Title":"Afficher le panneau Afficher les préférences de présentation",
"LayoutPreferences.ShortHelp":"Permet de gérer les préférences de présentation des widgets.",
"DefineFilter.Title":"Filtrer",
"DefineFilter.ShortHelp":"Filtre les objets en fonction des attributs ou des configurations.",
"DefineFilter.LongHelp":"La commande de filtre n'est pas disponible si le mode Création est activé et en mode base de données.",
"ManageInconsistentLinks.Title":"Gestion de l'impact des modifications",
"ManageInconsistentLinks.ShortHelp":"Gère les liens d'implémentation incomplets ou incohérents entre des systèmes ou opérations et des éléments.",
"ManageInconsistentLinks.LongHelp":"Le panneau <wintitle>Gestion de l'impact des modifications</wintitle> répertorie tout lien incohérent entre des systèmes ou opérations et des éléments. <p>Cliquez sur <uicontrol>Rediriger</uicontrol>, <uicontrol>Supprimer</uicontrol> et <uicontrol>Ignorer</uicontrol> dans le panneau pour corriger les liens.</p>",
"BIEssentialsCmd.Title":"B.I. Essentials",
"BIEssentialsCmd.ShortHelp":"Calcule l'état d'affectation de l'élément de fabrication et l'état de mise à jour du système pour la structure chargée dans l'application, et les affiche à l'aide de codes couleur dans leurs affichages respectifs",
"ReplaceByLatestRevision.Title":"Remplacer par la dernière révision",
"ReplaceByLatestRevision.ShortHelp":"Remplace une opération enfant par sa dernière révision, met à jour les flux de produits et les liens d'implémentation.",
"ReplaceByLatestRevision.LongHelp":"Sélectionnez une opération enfant et cliquez sur <uicontrol>Remplacer par la dernière révision</uicontrol>.",
"ReplaceByExisting.Title":"Remplacer par un objet existant",
"ReplaceByExisting.ShortHelp":"Remplace une opération enfant par son opération existante, met à jour les flux de produits et les liens d'implémentation.",
"ReplaceByExisting.LongHelp":"Sélectionnez une opération enfant et cliquez sur <uicontrol>Remplacer par existant</uicontrol>. Dans la barre de recherche, saisissez le critère pour une opération existant dans la base de données. Sélectionnez l'opération et cliquez sur <uicontrol>OK</uicontrol>.",
"ReplaceByNewRevision.Title":"Remplacer par une nouvelle révision",
"ReplaceByNewRevision.ShortHelp":"Crée une révision d'une opération enfant, remplace l'opération enfant par la nouvelle révision, met à jour les flux de produits et les liens d'implémentation.",
"ReplaceByNewRevision.LongHelp":"Sélectionnez une opération enfant et cliquez sur <uicontrol>Remplacer par une nouvelle révision</uicontrol>.",
"ReplaceByNewReference.Title":"Remplacer par un nouvel élément",
"UserDefinedExplore.Title":"Exploration définie par l'utilisateur",
"UserDefinedExplore.ShortHelp":"Ouvre une boîte de dialogue <wintitle>Exploration définie par l'utilisateur</wintitle>.",
"UserDefinedExplore.LongHelp":"Dans le champ <wintitle>Liste de toutes les procédures</wintitle>, sélectionnez soit l'entrée par défaut invitant à <uicontrol>Charger les relations dans les vues</uicontrol>, soit l'une des procédures définies par l'utilisateur (JavaScript) disponibles. En cliquant sur <uicontrol>Exécuter</uicontrol>, cette procédure est exécutée avec les objets sélectionnés comme entrée et les objets renvoyés sont chargés dans les vues respectives.<p> <note type = 'notes'> <ul> <li>La disponibilité des procédures dépend de l'objet sélectionné. Si aucun objet n'est sélectionné, la boîte de dialogue ne s'affiche pas, et le comportement par défaut <uicontrol>Charger les relations dans les vues</uicontrol> est exécuté.</li> <li>Les procédures définies par l'utilisateur doivent inclure une <codeph>propriété</codeph> ProcCategory avec la <codeph>valeur</codeph> personnalisée avant d'être déployées dans le serveur à inclure dans la liste.</li> </ul> </note> </p>",
"ProductFlowCmd.Title":"Diagramme de flux des bons de travail",
"ProductFlowCmd.ShortHelp":"<p>Ouvre un panneau pour gérer la vue de la structure.</p>",
"ProductFlowCmd.LongHelp":"<p>Cliquez pour afficher le diagramme des bons de travail.</p>",
"CreateWorkOrderFromProcess.Title":"Créer un bon de travail à partir du processus",
"CreateWorkOrderFromProcess.ShortHelp":"<p>Ouvre un panneau pour créer un bon de travail à partir du processus.</p>",
"CreateWorkOrderFromProcess.LongHelp":"<p>Cliquez pour créer un bon de travail.</p>",
"WorkOrderView.Title":"Afficher la vue Bon de travail & opérations exec",
"WorkOrderView.ShortHelp":"Affiche ou masque la vue <wintitle>Bons de travail & opérations exec</wintitle>, autrement, le bloc Bon de travail.",
"MaturityCmdCloud.Title":"Maturité",
"MaturityCmdCloud.ShortHelp":"Modifie l'état de maturité des objets sélectionnés.",
"MaturityCmdCloud.LongHelp":"<p>Dans la boîte de dialogue, sélectionnez l'état cible dans le graphique de maturité si vous avez sélectionné un objet, ou dans la liste si vous en avez sélectionné plusieurs. Puis cliquez sur <uicontrol>OK</uicontrol>.</p>",
"DeleteCmdCloud.Title":"Supprimer les bons de travail",
"DeleteCmdCloud.ShortHelp":"Supprime définitivement les objets sélectionnés.",
"DeleteCmdCloud.LongHelp":"Sélectionnez un ou plusieurs objets et cliquez sur la commande.<p>Si vous sélectionnez un objet, sélectionnez l'option <uicontrol>Inclure les objets structurels</uicontrol> pour supprimer ses enfants.</p>",
"ExplodeWorkOrderCmdCloud.Title":"Réassigner le bon de travail",
"ExplodeWorkOrderCmdCloud.ShortHelp":"Réassignez le bon de travail avec un autre plan de travail et un élément de fabrication correspondant. Cela régénérera la structure du bon de travail en fonction du nouveau plan de travail sélectionné.",
"ExplodeWorkOrderCmdCloud.LongHelp":"<p>Cliquez pour réaffecter un nouveau bon de travail basé sur un autre plan de travail ou un autre élément de fabrication.</p>",
"ToggleAuxiliaryView.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DuplicateAdv.WebHelp":"SharedUserMap/lifecycle-t-DuplicateAdvanced.htm",
"Delete.WebHelp":"SharedUserMap/lifecycle-t-Delete.htm",
"LayoutPreferences.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm",
"DefineFilter.WebHelp":"DelMgaUserMap/delmfna-m-Filter-sb.htm",
"BIEssentialsCmd.WebHelp":"DelMgaUserMap/delmga-t-BIEssentials.htm",
"ReplaceByLatestRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithItsLatestRevision",
"ReplaceByExisting.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithanExistingObject",
"ReplaceByNewRevision.WebHelp":"DelMgaUserMap/delmga-t-ObjectReplace.htm#t-ReplaceanObjectwithaNewRevision",
"WorkOrderView.WebHelp":"DelMgaUserMap/Delmga-c-ui-MgaDashboard.htm"
}
