{
  "Communityfeatures": "Topluluk özellikleri",
  "ContentTemplates": "İçerik Şablonları",
  "AvailableTemplates": "Kullanılabilir Şablonlar",
  "Post": "Gönderi",
  "Ideas": "Fikirler",
  "Surveys": "Anketler",
  "iQuestions": "Sorular",
  "Wiki": "Wiki",
  "Wedo": "Wedo",
  "Conference": "Randevu",
  "Messages": "Mesajlar",
  "DefaultStatement": "Varsayılan olarak ayarla",
  "Allowcontributortocreate": "Katkı sağlayanların oluşturmasına izin ver",
  "StatisticsAvailableFor": "Şunun için mevcut istatistikler:",
  "Disabled": "Devre Dışı",
  "Owners": "Sahipler",
  "OwnersAndAuthors": "Sahipler ve yazarlar",
  "All": "Tümü",
  "IncompatibilityMessage": "Topluluk özelliği kuralları değiştirildi. Artık bir özellik tüm topluluk üyeleri için etkinleştiriliyor veya devre dışı bırakılıyor. </br>Bir özellik etkinleştirilirse tüm içerikleri tüm üyeler tarafından görülebilir ve en azından yazarların oluşturma hakları olur.</br>Bir özellik devre dışı bırakılırsa eski içeriğe sahipler de dahil olmak üzere artık üyeler erişemez.</br>Kaydettiğinizde bu yeni kurallar geçerli olur.",
  "AcceptStatement": "Bu değişikliği anlıyorum ve ayarları güncelleyeceğim.",
  "WikiWarning1": "Bu özellik yeni kurallarla uyumlu değil. Şu anda tüm üyeler wiki'ye erişebilir ve <b>yalnızca sahipler</b> wiki sayfalarını düzenleyebilir/oluşturabilir. </br>Yeni kurallara göre, bu özellik etkinleştirildiğinde <b>hem sahipler hem de yazarlar</b> düzenleyebilecek ve oluşturabilecektir. </br>Bu nedenle bu özellik devre dışı bırakılmıştır. Ayarları değiştirmeden uyguladığınızda bu özelliğin devre dışı bırakılması kaydedilir.",
  "WikiWarning2": "Bu özellik yeni kurallarla uyumlu değil. Şu anda tüm üyeler wiki'ye erişebilir ve <b>yalnızca sahipler</b> wiki sayfalarını düzenleyebilir/oluşturabilir. </br>Yeni kurallara göre, bu özellik etkinleştirildiğinde <b>hem sahipler hem de yazarlar</b> düzenleyebilecek ve oluşturabilecektir. </br>Bu nedenle bu özellik devre dışı bırakılmıştır. Ayarları değiştirmeden uyguladığınızda bu özelliğin devre dışı bırakılması kaydedilir.",
  "IQWarning1": "Bu özellik yeni kurallarla uyumlu değil. Şu anda <b>yalnızca yazarlar ve sahipler</b> Sorulara <b>erişebilir</b>. </br>Bu nedenle bu özellik devre dışı bırakılmıştır. Ayarları değiştirmeden uyguladığınızda Soruların devre dışı bırakılması kaydedilir.",
  "IQWarning2": "Bu özellik yeni kurallarla uyumlu değil. Şu anda <b>yalnızca sahipler</b> Sorulara <b>erişebilir</b>. </br>Bu nedenle bu özellik devre dışı bırakılmıştır. Ayarları değiştirmeden uyguladığınızda Soruların devre dışı bırakılması kaydedilir.",
  "IdeaWarning1": "Bu özellik yeni kurallarla uyumlu değil. Şu anda <b>yalnızca yazarlar ve sahipler</b> Fikirlere <b>erişebilir</b>. </br>Bu nedenle bu özellik devre dışı bırakılmıştır. Ayarları değiştirmeden uyguladığınızda Fikirlerin devre dışı bırakılması kaydedilir.",
  "IdeaWarning2": "Bu özellik yeni kurallarla uyumlu değil. Şu anda <b>yalnızca sahipler</b> Fikirlere <b>erişebilir</b>. </br>Bu nedenle bu özellik devre dışı bırakılmıştır. Ayarları değiştirmeden uyguladığınızda Fikirlerin devre dışı bırakılması kaydedilir."
}
