{
  "INVAutoNameLabel": "Nomeação automática",
  "INVAutoNameInfo": "Ativa a nomeação automática ao salvar arquivos de peças, montagens, apresentações e desenhos no 3DEXPERIENCE pela primeira vez. Ele se aplica a todos os aplicativos que estão criando dados do Inventor.",
  "INVSaveGroupLabel": "Salvar",
  "INVReplaceTitleByNewNameOnAutonameLabel": "Substituir título por novo nome na nomeação automática",
  "INVReplaceTitleByNewNameOnAutonameInfo": "Na seleção do nome automático na caixa de diálogo Salvar, o nome de arquivo existente será substituído pelo nome automático.",
  "INVCADAttributeMappedToEINLabel": "Atributo CAD mapeado para EIN",
  "INVCADAttributeMappedToEINInfo": "Quando o valor desse atributo for especificado, a função será ativada e carimbaremos o arquivo CAD com esse atributo e seu valor será o EIN do Produto físico.",
  "INVCADEnablePessimisticLockingLabel": "Bloqueio pessimista",
  "INVCADEnablePessimisticLockingInfo": "A ativação desse recurso garante que os dados não possam ser salvos na plataforma a partir do conector, a menos que sejam reservados pelo usuário atual.",
  "INVCADFileReadOnlyLabel": "Tornar arquivo somente leitura",
  "INVCADFileReadOnlyInfo": "O arquivo será marcado como somente leitura se não for reservado pelo usuário atual. Esse comportamento será ativado somente se o bloqueio pessimista estiver habilitado.",
  "INVCADFilterOutNotInCADDataLabel": "Filtrar itens de engenharia do 3DEXPERIENCE sem geometria e sem nós filhos",
  "INVCADFilterOutNotInCADDataInfo": "Filtrar itens de engenharia do 3DEXPERIENCE sem geometria e sem nós filhos",
  "INVOpenGroupLabel": "Abrir",
  "INVDelimiterLabel": "Definir delimitador",
  "INVDelimiterInfo": "Esse delimitador será usado da seguinte maneira:\n\n1. Para mesclar valores de atributos com vários valores no 3DEXPERIENCE durante a sincronização no arquivo CAD.\n\n2. Para dividir o valor do atributo CAD se ele estiver mapeado para o atributo de vários valores no 3DEXPERIENCE.",
  "INVOtherGroupLabel": "Geral",
  "InvalidDelimiter": "Não é permitido usar mais de um caractere como delimitador",
  "INVConnectNativeDrawingAsLabel": "Conexão entre Produtos físicos e Desenhos ",
  "INVConnectNativeDrawingAsInfo": "Isso será usado para fazer a conexão entre Produtos físicos e desenhos como um dos três tipos.\nEssa será uma configuração única.\nNão altere depois de concluído.",
  "INVDependencyLinkOnlyLabel": "Conectar como vínculo de dependência - O desenho não é um filho do Produto físico",
  "INVInstantiatedDrawingLabel": "Conectar desenho como filho do Produto físico",
  "INVAggregatedDrawingLabel": "O desenho é agregado abaixo do Produto físico"
}
