{
  "SLWAutoNameLabel": "Nombre automático",
  "SLWAutoNameInfo": "Activa la asignación automática de nombres al guardar archivos de piezas, ensamblajes y dibujos en 3DEXPERIENCE por primera vez. Se aplica a todas las aplicaciones que crean datos de SOLIDWORKS.",
  "SLWSaveGroupLabel": "Guardar",
  "SLWSaveMissingRefLabel": "Guardar archivos con las referencias que faltan (solo al guardar por primera vez)",
  "SLWSaveMissingRefInfo": "Solo al guardar por primera vez, permite a los usuarios guardar archivos incluso si <strong>faltan referencias</strong> como:<br> - Referencias de ensamblaje<br> - Simetría, división y referencias de piezas derivadas<br>. Los cambios posteriores se <strong>bloquearán</strong> en caso de que no se hayan subsanado las referencias que faltan",
  "SLWSaveUnreservedModLabel": "Guardar archivos que hacen referencia a archivos modificados desbloqueados",
  "SLWSaveUnreservedModInfo": "Guarda archivos incluso si hacen referencia a archivos modificados desbloqueados.",
  "SLWApplyMaterialLabel": "Aplicar material en el modelo de datos de 3DEXPERIENCE",
  "SLWApplyMaterialInfo": "Aplicar el uso de materiales de 3DEXPERIENCE en los datos de SOLIDWORKS.",
  "SLWMandAttrBehaviorLabel": "Atributos asignados obligatorios",
  "SLWMandAttrBehaviorInfo": "Seleccionar una opción para guardar si no se han establecido los atributos obligatorios de SOLIDWORKS.",
  "SLWBehaviorIgnore": "Ignorar si no está establecido         ",
  "SLWBehaviorBlock": "Guardar bloque si no está establecido     ",
  "SLWBehaviorWarning": "Advertencia al guardar si no está establecido",
  "SLWSaveTitleUnicityLabel": "Comprobar la unicidad del título del archivo",
  "SLWSaveTitleUnicityInfo": "Comprueba la unicidad del título de cada archivo al guardarlo por primera vez. En función de la opción seleccionada, la operación de guardado continúa.<br>- Ignorar: no comprueba la unicidad del título<br> - Advertencia al guardar: el guardado continúa con normalidad, pero aparece una advertencia<br> - Bloquear guardado: bloquea la operación de guardado para títulos no únicos",
  "SLWSaveConfigFilterTypeLabel": "Tipo de filtro de configuración",
  "SLWSaveConfigFilterTypeInfo": "Filtrar configuraciones para guardar como productos físicos. En función de la selección, se aplican los siguientes ajustes de filtro.<br>(Nota: En SOLIDWORKS Connected, esto se aplica a archivos que no se actualizan para garantizar la compatibilidad con 3DEXPERIENCE Platform)",
  "SLWConfigAll": "Todas las configuraciones       ",
  "SLWConfigRef": "Configuraciones de referencia",
  "SLWConfigName": "Filtrado basado en nombres     ",
  "SLWSaveExcludeDerivedConfLabel": "Excluir configuraciones derivadas",
  "SLWSaveExcludeDerivedConfInfo": "Excluye todas las configuraciones derivadas a las que hace referencia el ensamblaje activo.",
  "SLWSaveReferencedConfLabel": "Guardar configuraciones de referencia",
  "SLWSaveReferencedConfInfo": "Guardar solo las configuraciones de referencia.",
  "SLWPartsAndAssembly": "Piezas y ensamblajes",
  "SLWAssembliesOnly": "Solo ensamblajes          ",
  "SLWPartIncludeLabel": "Piezas: incluir los nombres de la configuración (p. ej., *soldadura*,molde*)",
  "SLWPartIncludeInfo": "Incluye configuraciones de piezas con nombres que contienen el texto introducido aquí.",
  "SLWPartExcludeLabel": "Piezas: excluir los nombres de la configuración (p. ej., *soldadura*,molde*)",
  "SLWPartExcludeInfo": "Excluye configuraciones de piezas con nombres que contienen el texto introducido aquí.",
  "SLWAssemblyIncludeLabel": "Ensamblajes: incluir los nombres de la configuración (p. ej., *soldadura*,molde*)",
  "SLWAssemblyIncludeInfo": "Incluye configuraciones de ensamblaje con nombres que contienen el texto introducido aquí.",
  "SLWAssemblyExcludeLabel": "Ensamblajes: excluir los nombres de la configuración (p. ej., *soldadura*,molde*)",
  "SLWAssemblyExcludeInfo": "Excluye configuraciones de ensamblaje con nombres que contienen el texto introducido aquí.",
  "SLWSaveCfgAllGroupLabel": "Todas las configuraciones (si se seleccionan en \"Tipo de filtro de configuración\" anterior)",
  "SLWSaveCfgRefGroupLabel": "Configuraciones de referencia (si se seleccionan en \"Tipo de filtro de configuración\" anterior)",
  "SLWSaveCfgNameGroupLabel": "Filtrado basado en nombres (si se ha seleccionado en \"Tipo de filtro de configuración\" anterior)",
  "SLWinvalidCharacters": "No se permite el carácter |",
  "SLWSaveExtRefBehaviorLabel": "Compruebe los archivos con referencias externas",
  "SLWSaveExtRefBehaviorInfo": "Busca referencias externas del archivo. Se realiza una de las siguientes acciones según la configuración seleccionada:<br><strong>Ignorar</strong>: las referencias externas no se comprueban<br><strong>Advertencia</strong>: si faltan archivos de referencia externa, se muestra una advertencia<br><strong>Bloqueo</strong>: si faltan archivos de referencia externa, Guardar se bloquea",
  "SLWSaveExtRefIgnore": "Omitir",
  "SLWSaveExtRefWarning": "Advertencia  ",
  "SLWSaveExtRefBlock": "Bloque ",
  "SLWOpenGroupLabel": "Abrir",
  "SLWOpenFilterEngItemLabel": "Filtrar elementos de ingeniería de 3DEXPERIENCE sin geometría",
  "SLWOpenFilterEngItemInfo": "Los nodos de ensamblaje de 3DEXPERIENCE sin geometría que representan elementos de BOM y están agregados fuera de SOLIDWORKS están excluidos del ámbito abierto.",
  "SLWOpenFilterAlwaysOff": "Siempre desactivado                ",
  "SLWOpenFilterAlwaysOn": "Siempre activado                 ",
  "SLWOpenFilterDefaultOff": "Desactivado por defecto (control del usuario)",
  "SLWOpenFilterDefaultOn": "Activado por defecto (control del usuario) ",
  "SLWPPTitleGroupLabel": "Título del producto físico",
  "SLWUseBLForTitleLabel": "Utilice la lógica empresarial para definir el título del producto físico",
  "SLWUseBLForTitleInfo": "Se utilizará la lógica empresarial en 3DEXPERIENCE Platform para definir el título. Si esta opción no está seleccionada, SOLIDWORKS determina el título del producto físico. Esta opción se puede utilizar para garantizar un título de producto físico uniforme en todas las interfaces de usuario.",
  "SLWSetTitlePolicyLabel": "Edición del título del producto físico",
  "SLWSetTitlePolicyInfo": "La opción \"Permitir solo al editar propiedades\" permitirá editar el título solo en la ventana Editar propiedades. Los cambios en el archivo de SOLIDWORKS no cambiarán el título del producto físico.",
  "SLWSetTitlePolicyAlways": "Permitir                              ",
  "SLWSetTitlePolicyOnlyAtEdit": "Permitir solo al editar propiedades",
  "SLWSetTitlePolicyDisable": "Desactivar                            ",
  "SLWResourcesGroupLabel": "Recursos",
  "SLWSystemSettingsLabel": "Configuración de CAD",
  "SLWSystemSettingsInfo": "La configuración de CAD del archivo cargado se aplicará a cada máquina de SOLIDWORKS.",
  "SLWSystemSettingsUploadLabel": "Cargar un archivo de configuración de CAD (.sldsettings)",
  "SLWSystemSettingsCurrentLabel": "Descargar el archivo de configuración de CAD actual",
  "SLWToolboxDatabaseLabel": "Toolbox",
  "SLWToolboxDatabaseInfo": "Los componentes de Toolbox del archivo cargado estarán disponibles para todos los usuarios de SOLIDWORKS.",
  "SLWToolboxDatabaseUploadLabel": "Cargar un archivo de recursos de Toolbox (.zip)",
  "SLWToolboxDatabaseCurrentLabel": "Descargar el archivo de recursos de Toolbox actual"
}
