{
  "SLWAutoNameLabel": "Nom automatique",
  "SLWAutoNameInfo": "Active l'attribution automatique de noms lors de l'enregistrement initial des fichiers de pièces, d'assemblages et de mises en plan dans 3DEXPERIENCE. Elle s'applique à toutes les applications qui créent des données SOLIDWORKS.",
  "SLWSaveGroupLabel": "Enregistrer",
  "SLWSaveMissingRefLabel": "Enregistrer les fichiers avec des références manquantes (enregistrement initial uniquement)",
  "SLWSaveMissingRefInfo": "Pour l'enregistrement initial uniquement, permet aux utilisateurs d'enregistrer des fichiers même s'ils ont des <strong>références manquantes</strong>, telles que :<br> - Références d'assemblage<br> - Références de symétrie, division et pièces dérivées<br>Les enregistrements ultérieurs seront <strong>bloqués</strong> si les références manquantes n'ont pas été résolues",
  "SLWSaveUnreservedModLabel": "Enregistrer les fichiers référençant les fichiers modifiés non verrouillés",
  "SLWSaveUnreservedModInfo": "Enregistre les fichiers même s'ils font référence à des fichiers modifiés non verrouillés.",
  "SLWApplyMaterialLabel": "Appliquer le matériau sur le modèle de données 3DEXPERIENCE",
  "SLWApplyMaterialInfo": "Appliquez l'utilisation des matériaux 3DEXPERIENCE aux données SOLIDWORKS.",
  "SLWMandAttrBehaviorLabel": "Attributs mappés obligatoires",
  "SLWMandAttrBehaviorInfo": "Sélectionnez une option à enregistrer si les attributs obligatoires SOLIDWORKS ne sont pas définis.",
  "SLWBehaviorIgnore": "Ignorer si non défini         ",
  "SLWBehaviorBlock": "Bloquer l'enregistrement si non défini     ",
  "SLWBehaviorWarning": "Avertir lors de l'enregistrement si non défini",
  "SLWSaveTitleUnicityLabel": "Vérifier l'unicité du titre du fichier",
  "SLWSaveTitleUnicityInfo": "Vérifie que le titre de chaque fichier est unique lors de l'enregistrement initial. En fonction de l'option sélectionnée, l'opération d'enregistrement se poursuit.<br>- Ignorer : ne vérifie pas que le titre est unique<br> - Avertir lors de l'enregistrement : l'enregistrement se poursuit normalement, mais un avertissement s'affiche<br>- Bloquer l'enregistrement : bloque l'opération d'enregistrement pour un titre non unique",
  "SLWSaveConfigFilterTypeLabel": "Type de filtre de configuration",
  "SLWSaveConfigFilterTypeInfo": "Filtrer les configurations à enregistrer en tant que produits physiques. En fonction de la sélection, les paramètres de filtre ci-dessous sont applicables.<br>(Remarque : dans SOLIDWORKS Connected, ceci est appliqué aux fichiers qui ne sont pas mis à jour pour assurer la compatibilité avec la 3DEXPERIENCE platform)",
  "SLWConfigAll": "Toutes les configurations       ",
  "SLWConfigRef": "Configurations référencées",
  "SLWConfigName": "Filtre basé sur le nom     ",
  "SLWSaveExcludeDerivedConfLabel": "Exclure des configurations dérivées",
  "SLWSaveExcludeDerivedConfInfo": "Exclut toutes les configurations dérivées référencées par l'assemblage actif.",
  "SLWSaveReferencedConfLabel": "Enregistrer les configurations référencées",
  "SLWSaveReferencedConfInfo": "Enregistre uniquement les configurations référencées.",
  "SLWPartsAndAssembly": "Pièces et assemblages",
  "SLWAssembliesOnly": "Assemblages uniquement          ",
  "SLWPartIncludeLabel": "Pièces : inclure le(s) nom(s) de configuration (par exemple, *soudure*,moule*)",
  "SLWPartIncludeInfo": "Inclut les configurations de pièce dont les noms contiennent le texte saisi ici.",
  "SLWPartExcludeLabel": "Pièces : exclure le(s) nom(s) de configuration (par exemple, *soudure*,moule*)",
  "SLWPartExcludeInfo": "Exclut les configurations de pièce dont les noms contiennent le texte saisi ici.",
  "SLWAssemblyIncludeLabel": "Assemblages : inclure le(s) nom(s) de configuration (par exemple, *soudure*,moule*)",
  "SLWAssemblyIncludeInfo": "Inclut les configurations d'assemblage dont les noms contiennent le texte saisi ici.",
  "SLWAssemblyExcludeLabel": "Assemblages : exclure le(s) nom(s) de configuration (par exemple, *soudure*,moule*)",
  "SLWAssemblyExcludeInfo": "Exclut les configurations d'assemblage dont les noms contiennent le texte saisi ici.",
  "SLWSaveCfgAllGroupLabel": "Toutes les configurations (si sélectionnées dans \"Type de filtre de configuration\" ci-dessus)",
  "SLWSaveCfgRefGroupLabel": "Configurations référencées (si sélectionnées dans \"Type de filtre de configuration\" ci-dessus)",
  "SLWSaveCfgNameGroupLabel": "Filtrage basé sur le nom (si sélectionné dans \"Type de filtre de configuration\" ci-dessus)",
  "SLWinvalidCharacters": "Le caractère | n'est pas autorisé",
  "SLWSaveExtRefBehaviorLabel": "Vérifier le(s) fichier(s) avec des références externes",
  "SLWSaveExtRefBehaviorInfo": "Recherche les références externes du fichier. L'une des actions suivantes est effectuée selon le paramètre sélectionné :<br><strong>Ignorer</strong> - les références externes ne sont pas vérifiées<br><strong>Avertir</strong> - si des fichiers de références externes sont manquants, un avertissement s'affiche<br><strong>Bloquer</strong> - si des fichiers de références externes sont manquants, l'enregistrement est bloqué",
  "SLWSaveExtRefIgnore": "Ignorer",
  "SLWSaveExtRefWarning": "Avertir  ",
  "SLWSaveExtRefBlock": "Bloquer ",
  "SLWOpenGroupLabel": "Ouvrir",
  "SLWOpenFilterEngItemLabel": "Filtrer les éléments d'ingénierie 3DEXPERIENCE sans géométrie",
  "SLWOpenFilterEngItemInfo": "Les nœuds d'assemblage 3DEXPERIENCE sans géométrie représentant des éléments de nomenclature et ajoutés en dehors de SOLIDWORKS sont exclus de la portée de l'ouverture.",
  "SLWOpenFilterAlwaysOff": "Toujours désactivé                ",
  "SLWOpenFilterAlwaysOn": "Toujours activé                 ",
  "SLWOpenFilterDefaultOff": "Désactivé par défaut (contrôle utilisateur)",
  "SLWOpenFilterDefaultOn": "Activé par défaut (contrôle utilisateur) ",
  "SLWPPTitleGroupLabel": "Titre du produit physique",
  "SLWUseBLForTitleLabel": "Utiliser la logique applicative pour définir le titre du produit physique",
  "SLWUseBLForTitleInfo": "La logique applicative (BL) de la 3DEXPERIENCE platform sera utilisée pour définir le titre. Si cette option n'est pas sélectionnée, SOLIDWORKS détermine le titre du produit physique. Cette option peut être utilisée pour garantir un titre de produit physique uniforme dans toutes les interfaces utilisateur.",
  "SLWSetTitlePolicyLabel": "Modification du titre du produit physique",
  "SLWSetTitlePolicyInfo": "L'option \"Autoriser uniquement lors de la modification des propriétés\" permet de modifier le titre uniquement dans la fenêtre Modifier les propriétés. Les modifications apportées au fichier SOLIDWORKS ne changent pas le titre du produit physique.",
  "SLWSetTitlePolicyAlways": "Autoriser                              ",
  "SLWSetTitlePolicyOnlyAtEdit": "Autoriser uniquement lors de la modification des propriétés",
  "SLWSetTitlePolicyDisable": "Désactiver                            ",
  "SLWResourcesGroupLabel": "Ressources",
  "SLWSystemSettingsLabel": "Paramètres CAO",
  "SLWSystemSettingsInfo": "Les paramètres CAO du fichier téléchargé seront appliqués à chaque machine SOLIDWORKS.",
  "SLWSystemSettingsUploadLabel": "Charger un fichier de paramètres CAO (.sldsettings)",
  "SLWSystemSettingsCurrentLabel": "Télécharger le fichier de paramètres CAO actuel",
  "SLWToolboxDatabaseLabel": "Toolbox",
  "SLWToolboxDatabaseInfo": "Les composants Toolbox du fichier téléchargé seront disponibles pour tous les utilisateurs de SOLIDWORKS.",
  "SLWToolboxDatabaseUploadLabel": "Charger un fichier de ressources Toolbox (.zip)",
  "SLWToolboxDatabaseCurrentLabel": "Télécharger le fichier de ressources Toolbox actuel"
}
