{
  "SLEAutoNameLabel": "Автоименование",
  "SLEAutoNameInfo": "Позволяет автоматически присваивать имена при первом сохранении файлов деталей, сборок и чертежей в 3DEXPERIENCE. Оно применяется ко всем приложениям, работающим с данными Solid Edge.",
  "SLESaveGroupLabel": "Сохранить",
  "SLEReplaceTitleByNewNameOnAutonameLabel": "Заменить заголовок новым именем при автоматическом именовании",
  "SLEReplaceTitleByNewNameOnAutonameInfo": "При выборе автоматического именования в диалоговом окне сохранения существующее имя файла будет заменено автоматически созданным именем.",
  "SLECADAttributeMappedToEINLabel": "Атрибут CAD сопоставлен c EIN",
  "SLECADAttributeMappedToEINInfo": "Если указано значение для этого атрибута, функция будет включена и файл CAD будет содержать этот атрибут, а его значение будет соответствовать номеру EIN физического продукта.",
  "SLEEnablePessimisticLockingLabel": "Пессимистичная блокировка",
  "SLEEnablePessimisticLockingInfo": "Включение этой функции гарантирует, что данные не могут быть сохранены на платформе с помощью соединителя, если только они не зарезервированы текущим пользователем.",
  "SLECheckinCFGfilesLabel": "Сохранить файл CFG",
  "SLECheckinCFGfilesInfo": "Включение этой функции гарантирует, что файл CFG будет также зарегистрированы вместе со сборкой в 3DEXPERIENCE",
  "SLEFileReadOnlyLabel": "Сделать файл доступным только для чтения",
  "SLEFileReadOnlyInfo": "Файл будет помечен как доступный только для чтения, если он не зарезервирован текущим пользователем. Это поведение включается лишь при включенной пессимистической блокировке.",
  "SLECADFilterOutNotInCADDataLabel": "Отфильтруйте элементы проектирования 3DEXPERIENCE без геометрии и дочерних узлов",
  "SLECADFilterOutNotInCADDataInfo": "Отфильтруйте элементы проектирования 3DEXPERIENCE без геометрии и дочерних узлов.",
  "SLEOpenGroupLabel": "Открыть",
  "SLEDelimiterLabel": "Установить разделитель",
  "SLEDelimiterInfo": "Этот разделитель будет использоваться для следующих целей:\n1. Объединение значений многозначных атрибутов в 3DEXPERIENCE при синхронизации с файлом CAD.\n2. Разделение значения атрибута CAD, если он сопоставлен с многозначным атрибутом в 3DEXPERIENCE.",
  "SLEOtherGroupLabel": "Общие",
  "InvalidDelimiter": "В качестве разделителя запрещено использовать более одного символа",
  "SLEConnectNativeDrawingAsLabel": "Соединение между физическими продуктами и чертежами ",
  "SLEConnectNativeDrawingAsInfo": "Это будет использоваться для установления соединения между физическими продуктами и чертежами в качестве одного из трех типов. \nЭто единовременная настройка. \nНе меняйте после выполнения.",
  "SLEDependencyLinkOnlyLabel": "Подключить как ссылку зависимости — чертеж не является дочерним элементом физического продукта",
  "SLEInstantiatedDrawingLabel": "Подключить чертеж как дочерний элемент физического продукта",
  "SLEAggregatedDrawingLabel": "Чертеж группируется под физическим продуктом"
}
