{
  "SLEAutoNameLabel": "Automatische Benennung",
  "SLEAutoNameInfo": "Ermöglicht die automatische Benennung beim erstmaligen Speichern von Teile-, Baugruppen- und Zeichnungsdateien in 3DEXPERIENCE. Gilt für alle Anwendungen, die Solid Edge Daten erstellen.",
  "SLESaveGroupLabel": "Speichern",
  "SLEReplaceTitleByNewNameOnAutonameLabel": "Titel bei automatischer Benennung durch neuen Namen ersetzen",
  "SLEReplaceTitleByNewNameOnAutonameInfo": "Bei Auswahl der automatischen Benennung beim Speichern wird der vorhandene Dateiname durch die automatische Benennung ersetzt.",
  "SLECADAttributeMappedToEINLabel": "CAD-Attribut ist EIN zugeordnet",
  "SLECADAttributeMappedToEINInfo": "Die Funktion wird aktiviert, wenn für dieses Attribut ein Wert angegeben wird. Die CAD-Datei erhält dieses Attribut und der Wert entspricht der EIN des physischen Produkts.",
  "SLEEnablePessimisticLockingLabel": "Pessimistisches Sperren",
  "SLEEnablePessimisticLockingInfo": "Durch Aktivieren dieser Funktion wird sichergestellt, dass Daten nicht vom Connector auf der Plattform gespeichert werden können, es sei denn, sie wurden vom aktuellen Benutzer reserviert.",
  "SLECheckinCFGfilesLabel": "CFG-Datei speichern",
  "SLECheckinCFGfilesInfo": "Durch Aktivieren dieser Funktion wird sichergestellt, dass die CFG-Datei zusammen mit der Baugruppe in 3DEXPERIENCE eingecheckt wird",
  "SLEFileReadOnlyLabel": "Datei schreibgeschützt machen",
  "SLEFileReadOnlyInfo": "Die Datei wird als schreibgeschützt markiert, wenn sie nicht vom aktuellen Benutzer reserviert wurde. Dieses Verhalten wird nur aktiviert, wenn das pessimistische Sperren aktiviert ist.",
  "SLECADFilterOutNotInCADDataLabel": "3DEXPERIENCE Konstruktionselemente ohne Geometrie und ohne untergeordnete Knoten ausfiltern",
  "SLECADFilterOutNotInCADDataInfo": "3DEXPERIENCE Konstruktionselemente ohne Geometrie und ohne untergeordnete Knoten ausfiltern.",
  "SLEOpenGroupLabel": "Öffnen",
  "SLEDelimiterLabel": "Trennzeichen festlegen",
  "SLEDelimiterInfo": "Dieses Trennzeichen wird wie folgt verwendet:\n1. Zum Zusammenführen von Werten mehrwertiger Attribute in 3DEXPERIENCE bei der Synchronisierung einer CAD-Datei.\n2. Zum Teilen des CAD-Attributwerts, wenn er einem mehrwertigen Attribut in 3DEXPERIENCE zugeordnet ist.",
  "SLEOtherGroupLabel": "Allgemein",
  "InvalidDelimiter": "Trennzeichen aus mehr als einem Zeichen ist unzulässig",
  "SLEConnectNativeDrawingAsLabel": "Verbindung zwischen physischen Produkten und Zeichnungen ",
  "SLEConnectNativeDrawingAsInfo": "Wird verwendet, um mit einem von drei Typen eine Verbindung zwischen physischen Produkten und Zeichnungen herzustellen. \nDies ist eine einmalige Einstellung. \nDanach bitte nicht mehr ändern.",
  "SLEDependencyLinkOnlyLabel": "Als Abhängigkeitsverknüpfung verbinden – Zeichnung ist kein untergeordnetes Element des physischen Produkts",
  "SLEInstantiatedDrawingLabel": "Zeichnung als untergeordnetes Element des physischen Produkts verbinden",
  "SLEAggregatedDrawingLabel": "Zeichnung wird unter dem physischen Produkt gruppiert"
}
