{
  "SLEAutoNameLabel": "Asignación automática de nombres",
  "SLEAutoNameInfo": "Activa la asignación automática de nombres al guardar archivos de piezas, ensamblajes y dibujos en 3DEXPERIENCE por primera vez. Se aplica a todas las aplicaciones que crean datos de Solid Edge.",
  "SLESaveGroupLabel": "Guardar",
  "SLEReplaceTitleByNewNameOnAutonameLabel": "Reemplazar título por nuevo nombre en la asignación automática de nombres",
  "SLEReplaceTitleByNewNameOnAutonameInfo": "Al seleccionar el nombre automático en el cuadro de diálogo de guardado, el nombre de archivo existente se reemplazará por el nombre automático.",
  "SLECADAttributeMappedToEINLabel": "Atributo CAD asignado a EIN",
  "SLECADAttributeMappedToEINInfo": "Cuando se especifique un valor para este atributo, la función se activará y el archivo CAD se marcará con este atributo y su valor será el EIN del producto físico.",
  "SLEEnablePessimisticLockingLabel": "Bloqueo pesimista",
  "SLEEnablePessimisticLockingInfo": "Al activar esta función, se garantiza que los datos no se puedan guardar en la plataforma desde el conector a menos que estén reservados por el usuario actual.",
  "SLECheckinCFGfilesLabel": "Guardar archivo CFG",
  "SLECheckinCFGfilesInfo": "Al activar esta función, se garantiza que el archivo CFG se registre también junto con Assembly en 3DEXPERIENCE",
  "SLEFileReadOnlyLabel": "Hacer que el archivo sea de solo lectura",
  "SLEFileReadOnlyInfo": "El archivo se marcará como de solo lectura si no está reservado por el usuario actual. Este comportamiento solo se activará si el bloqueo pesimista está activado.",
  "SLECADFilterOutNotInCADDataLabel": "Filtrar elementos de ingeniería de 3DEXPERIENCE sin geometría ni nodos hijos",
  "SLECADFilterOutNotInCADDataInfo": "Filtre elementos de ingeniería de 3DEXPERIENCE sin geometría ni nodos hijos.",
  "SLEOpenGroupLabel": "Abrir",
  "SLEDelimiterLabel": "Establecer delimitador",
  "SLEDelimiterInfo": "Este delimitador se utilizará de la siguiente manera:\n1. Para combinar valores de atributos multivalor en 3DEXPERIENCE al sincronizar en un archivo CAD.\n2. Para dividir el valor del atributo CAD si está asignado a un atributo multivalor en 3DEXPERIENCE.",
  "SLEOtherGroupLabel": "General",
  "InvalidDelimiter": "No se permite más de un carácter como delimitador",
  "SLEConnectNativeDrawingAsLabel": "Conexión entre productos físicos y dibujos ",
  "SLEConnectNativeDrawingAsInfo": "Se utilizará para establecer una conexión entre los productos físicos y los dibujos, uno de los tres tipos.\nEste ajuste se realizará una sola vez.\nNo lo cambie una vez realizado.",
  "SLEDependencyLinkOnlyLabel": "Conectar como vínculo de dependencia: el dibujo no es hijo del producto físico",
  "SLEInstantiatedDrawingLabel": "Conectar dibujo como hijo del producto físico",
  "SLEAggregatedDrawingLabel": "El dibujo se agrega debajo del producto físico"
}
