{
  "SLEAutoNameLabel": "Nommage automatique",
  "SLEAutoNameInfo": "Active l'attribution automatique de noms lors de l'enregistrement initial des fichiers de pièces, d'assemblages et de mises en plan dans 3DEXPERIENCE. S'applique à toutes les applications qui créent des données Solid Edge.",
  "SLESaveGroupLabel": "Enregistrer",
  "SLEReplaceTitleByNewNameOnAutonameLabel": "Remplacer le titre par le nouveau nom du nommage automatique",
  "SLEReplaceTitleByNewNameOnAutonameInfo": "Lors de la sélection du nommage automatique dans la boîte de dialogue d'enregistrement, le nom de fichier existant est remplacé par le nom automatique.",
  "SLECADAttributeMappedToEINLabel": "Attribut CAO mappé à l'EIN",
  "SLECADAttributeMappedToEINInfo": "Lorsque la valeur de cet attribut est spécifiée, la fonction est activée et nous appliquons au fichier CAO un tampon avec cet attribut, dont la valeur sera l'EIN du produit physique.",
  "SLEEnablePessimisticLockingLabel": "Verrouillage pessimiste",
  "SLEEnablePessimisticLockingInfo": "L'activation de cette fonction garantit que les données ne peuvent pas être enregistrées sur la plate-forme à partir du connecteur, sauf si elles sont réservées par l'utilisateur actuel.",
  "SLECheckinCFGfilesLabel": "Enregistrer le fichier CFG",
  "SLECheckinCFGfilesInfo": "L'activation de cette fonction garantit que le fichier CFG sera également archivé avec l'assemblage dans 3DEXPERIENCE",
  "SLEFileReadOnlyLabel": "Mettre le fichier en lecture seule",
  "SLEFileReadOnlyInfo": "Le fichier sera marqué en lecture seule s'il n'est pas réservé par l'utilisateur actuel. Ce comportement est activé uniquement si le verrouillage pessimiste est activé.",
  "SLECADFilterOutNotInCADDataLabel": "Filtrez les éléments d'ingénierie 3DEXPERIENCE sans géométrie ni nœud enfant",
  "SLECADFilterOutNotInCADDataInfo": "Filtrez les éléments d'ingénierie 3DEXPERIENCE sans géométrie ni nœud enfant.",
  "SLEOpenGroupLabel": "Ouvrir",
  "SLEDelimiterLabel": "Définir un délimiteur",
  "SLEDelimiterInfo": "Ce délimiteur sera utilisé comme suit :\n1. Pour fusionner les valeurs des attributs à valeurs multiples dans 3DEXPERIENCE lors de la synchronisation d'un fichier CAO.\n2. Pour diviser la valeur d'attribut CAO si elle est mappée à un attribut à valeurs multiples dans 3DEXPERIENCE.",
  "SLEOtherGroupLabel": "Général",
  "InvalidDelimiter": "Il n'est pas possible d'utiliser plusieurs caractères comme délimiteur",
  "SLEConnectNativeDrawingAsLabel": "Connexion entre les produits physiques et les mises en plan ",
  "SLEConnectNativeDrawingAsInfo": "Il sera utilisé pour établir une connexion entre les produits physiques et les mises en plan comme l'un des trois types.\nIl s'agit d'un réglage unique.\nNe pas modifier une fois l'opération terminée.",
  "SLEDependencyLinkOnlyLabel": "Connecter en tant que lien de dépendance. Le dessin n'est pas un enfant du produit physique",
  "SLEInstantiatedDrawingLabel": "Connecter le dessin en tant qu'enfant du produit physique",
  "SLEAggregatedDrawingLabel": "Le dessin est agrégé sous le produit physique"
}
