{
  "SLEAutoNameLabel": "Denominazione automatica",
  "SLEAutoNameInfo": "Consente di assegnare nomi automatici e, contemporaneamente, di salvare per la prima volta file di parti, assiemi e disegni in 3DEXPERIENCE. Vale per tutte le app di creazione dei dati Solid Edge.",
  "SLESaveGroupLabel": "Salva",
  "SLEReplaceTitleByNewNameOnAutonameLabel": "Sostituisci titolo con nuovo nome su Nome automatico",
  "SLEReplaceTitleByNewNameOnAutonameInfo": "Quando si seleziona la finestra di dialogo Nome automatico al salvataggio, il nome del file esistente verrà sostituito dal nome automatico.",
  "SLECADAttributeMappedToEINLabel": "Attributo CAD mappato in EIN",
  "SLECADAttributeMappedToEINInfo": "Quando viene specificato il valore per questo attributo, la funzione sarà abilitata e il file CAD verrà timbrato con questo attributo e il suo valore sarà l'EIN del prodotto fisico.",
  "SLEEnablePessimisticLockingLabel": "Bloccaggio pessimistico",
  "SLEEnablePessimisticLockingInfo": "L'attivazione di questa funzione garantisce che i dati non possano essere salvati sulla piattaforma dal connettore, a meno che non siano riservati dall'utente corrente.",
  "SLECheckinCFGfilesLabel": "Salva file CFG",
  "SLECheckinCFGfilesInfo": "L'attivazione di questa funzione assicura che anche il file CFG venga sottoposto a check-in insieme all'assieme in 3DEXPERIENCE",
  "SLEFileReadOnlyLabel": "Rendi file di sola lettura",
  "SLEFileReadOnlyInfo": "Il file verrà contrassegnato come di sola lettura se non è riservato dall'utente corrente. Questo comportamento sarà abilitato solo se la chiusura pessimistica è abilitata.",
  "SLECADFilterOutNotInCADDataLabel": "Filtra gli elementi tecnici 3DEXPERIENCE senza geometria e senza nodi figlio",
  "SLECADFilterOutNotInCADDataInfo": "Filtra gli elementi tecnici 3DEXPERIENCE senza geometria e senza nodi figlio.",
  "SLEOpenGroupLabel": "Apri",
  "SLEDelimiterLabel": "Imposta delimitatore",
  "SLEDelimiterInfo": "Questo delimitatore verrà utilizzato come segue:\n1. Per unire valori di attributi multivalore in 3DEXPERIENCE durante la sincronizzazione su file CAD.\n2. Per dividere il valore dell'attributo CAD se è mappato su un attributo multivalore in 3DEXPERIENCE.",
  "SLEOtherGroupLabel": "Generale",
  "InvalidDelimiter": "Non è consentito utilizzare più di un carattere come delimitatore",
  "SLEConnectNativeDrawingAsLabel": "Collegamento tra prodotti fisici e disegni ",
  "SLEConnectNativeDrawingAsInfo": "Verrà utilizzato per creare un collegamento tra prodotti fisici e disegni in uno dei tre tipi. \nSi tratta di un'impostazione una tantum. \nNon modificarla al termine.",
  "SLEDependencyLinkOnlyLabel": "Collegare come collegamento di dipendenza - Il disegno non è un figlio del prodotto fisico",
  "SLEInstantiatedDrawingLabel": "Collegare il disegno come figlio del prodotto fisico",
  "SLEAggregatedDrawingLabel": "Il disegno è aggregato sotto il Prodotto Fisico"
}
