{
  "INST_PROPS_OFF_NONE_AVAILABLE_MSG": "Comparaison des propriétés d'instance non applicable pour la sélection",
  "INST_PROPS_OFF_TOO_MANY_SELECTED_MSG": "Propriétés d'instance disponibles uniquement pour la sélection d'une seule instance",
  "INST_PROPS_OFF_DURING_LIST_COMPARE_MSG": "Les propriétés d'instance ne sont pas disponibles lors de la comparaison de listes",
  "REF_PROPS_OFF_NONE_AVAILABLE_MSG": "Comparaison des propriétés non applicable pour la sélection",
  "REF_PROPS_OFF_TOO_MANY_SELECTED_MSG": "Propriétés de référence disponibles uniquement pour la sélection d'une seule référence",
  "EFFECTIVITY_OFF_NONE_AVAILABLE_MSG": "Comparaison d'effectivité non applicable pour la sélection",
  "EFFECTIVITY_OFF_TOO_MANY_SELECTED_MSG": "Effectivité disponible uniquement pour une sélection unique",
  "EFFECTIVITY_OFF_DURING_LIST_COMPARE_MSG": "Effectivité non disponible lors de la comparaison de listes",
  "PROPS_UNAVAILABLE_NO_SELECTION": "Effectuer une sélection pour afficher les propriétés",
  "NO_DIFFERENCES_FOUND": "Aucune différence trouvée",
  "DB_FETCH_FALLBACK": "Désactivation temporaire de l'accélération d'index, car au moins un objet demandé n'a pas été indexé",
  "DROP_1_OBJ_REPLACE": "Un seul objet peut être déposé pour le remplacement.",
  "HIDDEN_STATUSES_IDENTICAL": "Les couleurs d'état masquées ne sont pas affichées.",
  "GROUP_PLACEHOLDER_SELECTED_MSG": "Sélectionner une ligne dans ce groupe pour comparer les propriétés",
  "FETCH_FAIL_DEFAULT": "Impossible de charger les objets. Vérifiez votre connexion et assurez-vous que les objets sont indexés et accessibles.",
  "COMPARE_FAILED": "Echec de la comparaison",
  "NEW_VIEWS_MESSAGE": "De nouvelles vues ont été ajoutées : {newViews}",
  "CUSTOMIZATION_FAILED": "Echec de l'application des personnalisations de profil ; utilisation de la configuration par défaut",
  "CUSTOM_ATTRIBUTE_DELETED": "Informations d'attribut manquantes pour {msgData}.  Si l'attribut a été supprimé, le profil doit être mis à jour pour enlever les références qui s'y rapportent."
}
