{
  "OPPORTUNITY": "Oportunidade",
  "OPPORTUNITIES": "Oportunidades",
  "IMPACT": "Impacto positivo",
  "CLASS_TYPE": "Tipo de oportunidade",
  "REALIZATION_PLAN": "Plano de realização",
  "RPN": "Classificação",
  "OPPORTUNITY_TREND": "Tendência de oportunidade",
  "SHOW_COMPLETED": "Mostrar oportunidades concluídas",
  "ALL_CONTEXT_ITEMS": "Todas as oportunidades do contexto",
  "ALL_PROJECT_OPPORTUNITIES": "Todas as oportunidades do projeto",
  "OWNED": "Minhas oportunidades",
  "ALL_MY_ASSIGNED_ITEMS": "Todas (minhas oportunidades + atribuídas)",
  "PROJECT_OPPORTUNITIES": "Oportunidades do projeto",
  "SUB_PROJECT_OPPORTUNITIES": "Oportunidades do projeto + subprojeto",
  "ASSOCIATED_OPPORTUNITIES": "Oportunidades associadas",
  "ESTIMATED_BENEFIT": "Benefício estimado",
  "CANDIDATE_ASSIGNED": "Mostrar oportunidades onde sou candidato",
  "DUPLICATE_NO_CONTEXT_ACCESS": "Você pode não ter acesso de contexto para fazer duplicações dos seguintes objetos ",
  "TOOLTIP_ROOT_CAUSE": "A causa-raiz da oportunidade.",
  "TOOLTIP_CONTEXT": "O contexto da oportunidade. Isso pode incluir um Projeto Empresarial, Projeto, Tarefa ou Documento.",
  "TOOLTIP_MATRIX_CONFIGURATION": "A configuração vinculada ao contexto. Se o contexto tiver várias configurações, uma lista mostrará todas as configurações vinculadas ao contexto durante a criação da primeira oportunidade nesse contexto ou nas propriedades de uma oportunidade inválida criada nesse contexto.",
  "TOOLTIP_EFFECTIVE_DATE": "A data em que a oportunidade se torna efetiva.",
  "TOOLTIP_IMPACT": "O impacto positivo da oportunidade. Os valores padrão são 1-Insignificante, 2-Menor, 3-Moderado, 4-Maior ou 5-Alto. Também é possível atribuir isso clicando em Mapa de calor. Para definir outros valores, você pode personalizar a Configuração da matriz.",
  "TOOLTIP_PROBABILITY": "A probabilidade de ocorrência da oportunidade. Os valores padrão são 1-Raro, 2-Improvável, 3-Possível, 4-Provável, ou 5-Quase certo. Também é possível atribuir isso clicando no Mapa de calor. Para definir outros valores, você pode personalizar a Configuração da matriz.",
  "TOOLTIP_RATING": "Este valor é baseado nos valores selecionados em Impacto positivo e Probabilidade. O mapa de calor reflete esses valores.",
  "TOOLTIP_SEVERITY": "A gravidade é baseada no impacto positivo e probabilidade inseridos. Por exemplo, usando os valores padrão, um Impacto positivo de ‘2’ e Probabilidade de ‘4’ resulta em um nível calculado de 2 na configuração da matriz. Portanto, a gravidade é exibida como ‘2-Média’. ‘2’ reflete o nível de oportunidade e ‘Médio’ é o respectivo valor de gravidade.",
  "TOOLTIP_HEATMAP": "Uma imagem do mapa de calor mostrando o posicionamento da oportunidade na grade.",
  "TOOLTIP_TYPE_OF": "Usado para classificar oportunidades. Os valores incluem Custo, Qualidade, Técnico, Recurso, Desempenho, Programação, Benefícios, Viabilidade de fabricação e Outros.",
  "TOOLTIP_MATURITY_STATE": "O estado de maturidade da oportunidade. Os valores são Rascunho, Pendente, Em processo, Em aprovação ou Concluído.",
  "TOOLTIP_ORGANIZATION": "A organização à qual esta oportunidade pertence.",
  "TOOLTIP_COLLABORATIVE_SPACE": "O espaço colaborativo no qual esta oportunidade é criada."
}
