{
    "OPPORTUNITY": "Opportunity",
    "OPPORTUNITIES": "Opportunities",
    "IMPACT": "Positive Impact",
    "CLASS_TYPE": "Type of Opportunity",
    "REALIZATION_PLAN": "Realization Plan",
    "RPN": "Rating",
    "OPPORTUNITY_TREND": "Opportunity Trend",
    "SHOW_COMPLETED": "Show Completed Opportunities",
    "ALL_CONTEXT_ITEMS": "All Context Opportunities",
    "ALL_PROJECT_OPPORTUNITIES": "All Project Opportunities",
    "OWNED": "My Opportunities",
    "ALL_MY_ASSIGNED_ITEMS": "All (My Opportunities + Assigned)",
    "PROJECT_OPPORTUNITIES": "Project Opportunities",
    "SUB_PROJECT_OPPORTUNITIES": "Project + Sub-Project Opportunities",
    "ASSOCIATED_OPPORTUNITIES": "Associated Opportunities",
    "ESTIMATED_BENEFIT": "Estimated Benefit",
    "CANDIDATE_ASSIGNED": "Show Opportunities where I am Candidate",
    "DUPLICATE_NO_CONTEXT_ACCESS": "You may not have context access to do duplications of the following object(s) ",
    "TOOLTIP_ROOT_CAUSE": "The root cause of the opportunity.",
    "TOOLTIP_CONTEXT": "The context for the opportunity. This can include an Enterprise Project, Project, Task or Document.",
    "TOOLTIP_MATRIX_CONFIGURATION": "The configuration connected with the context. If the context has multiple configurations, a list shows all configurations connected with the context while creating the first opportunity under that context or in the properties for an invalid opportunity created under that context.",
    "TOOLTIP_EFFECTIVE_DATE": "The date on which the opportunity becomes effective.",
    "TOOLTIP_IMPACT": "The positive impact of the opportunity. Default values are 1-Negligible, 2-Minor, 3-Moderate, 4-Major, or 5-High. You can also assign this by clicking in the Heat Map. To define other values, you can customize the Matrix Configuration.",
    "TOOLTIP_PROBABILITY": "The probability of the opportunity occurring. Default values are 1-Rare, 2-Unlikely, 3-Possible, 4-Likely, or 5-Almost Certain. You can also assign this by clicking in the Heat Map. To define other values, you can customize the Matrix Configuration.",
    "TOOLTIP_RATING":"This value is based on the values you select in Positive Impact and Probability. The heat map reflects these values.",
    "TOOLTIP_SEVERITY" : "The severity is based on the entered Positive Impact and Probability. For example, using the default values, a Positive Impact of '2' and Probability of '4' results in a calculated level of 2 in the matrix configuration. Therefore, the Severity is displayed as '2-Medium'. '2' reflects the opportunity level and 'Medium' is the respective severity value.",
    "TOOLTIP_HEATMAP" : "A picture of the heat map showing this opportunity's placement in the grid.",
    "TOOLTIP_TYPE_OF" : "Used to classify opportunities. Values include Cost, Quality, Technical, Resource, Performance, Schedule, Benefits, Manufacturability, and Other.",
    "TOOLTIP_MATURITY_STATE": "The maturity state of the opportunity. Values are Draft, To Do, In Work, In Approval, or Completed.",
    "TOOLTIP_ORGANIZATION" : "The organization this opportunity belongs to.",
    "TOOLTIP_COLLABORATIVE_SPACE" : "The collaborative space in which this opportunity is created."
}
