{
  "OPPORTUNITY": "Opportunité",
  "OPPORTUNITIES": "Opportunités",
  "IMPACT": "Impact positif",
  "CLASS_TYPE": "Type d'opportunité",
  "REALIZATION_PLAN": "Plan de réalisation",
  "RPN": "Evaluation",
  "OPPORTUNITY_TREND": "Tendance de l'opportunité",
  "SHOW_COMPLETED": "Afficher les opportunités terminées",
  "ALL_CONTEXT_ITEMS": "Toutes les opportunités de contexte",
  "ALL_PROJECT_OPPORTUNITIES": "Toutes les opportunités de projet",
  "OWNED": "Mes opportunités",
  "ALL_MY_ASSIGNED_ITEMS": "Tout (Mes opportunités + affectées)",
  "PROJECT_OPPORTUNITIES": "Opportunités de projet",
  "SUB_PROJECT_OPPORTUNITIES": "Opportunités du projet + sous-projet",
  "ASSOCIATED_OPPORTUNITIES": "Opportunités associées",
  "ESTIMATED_BENEFIT": "Bénéfice estimé",
  "CANDIDATE_ASSIGNED": "Afficher les opportunités pour lesquelles je suis candidat",
  "DUPLICATE_NO_CONTEXT_ACCESS": "Vous ne disposez peut-être pas d'un accès contextuel pour effectuer des duplications des objets suivants ",
  "TOOLTIP_ROOT_CAUSE": "Cause racine de l'opportunité.",
  "TOOLTIP_CONTEXT": "Contexte de l'opportunité. Cela peut comprendre un projet d'entreprise, un projet, une tâche ou un document.",
  "TOOLTIP_MATRIX_CONFIGURATION": "Configuration connectée au contexte. Si le contexte possède plusieurs configurations, une liste répertorie toutes les configurations connectées au contexte tout en créant la première opportunité sous ce contexte ou dans les propriétés d'une opportunité non valide créée sous ce contexte.",
  "TOOLTIP_EFFECTIVE_DATE": "Date d'effet pour l'opportunité.",
  "TOOLTIP_IMPACT": "Impact positif de l'opportunité. Les valeurs par défaut sont 1-Négligeable, 2-Mineur, 3-Modéré, 4-Majeur ou 5-Elevé. Vous pouvez également affecter cette valeur en cliquant sur la carte thermique. Pour définir d'autres valeurs, vous pouvez personnaliser la configuration de la matrice.",
  "TOOLTIP_PROBABILITY": "Probabilité de l'opportunité. Les valeurs par défaut sont 1-Rare, 2-Improbable, 3-Possible, 4-Probable ou 5-Presque certain. Vous pouvez également affecter cette valeur en cliquant sur la carte thermique. Pour définir d'autres valeurs, vous pouvez personnaliser la configuration de la matrice.",
  "TOOLTIP_RATING": "Cette valeur est basée sur les valeurs que vous sélectionnez dans Impact positif et Probabilité. La carte thermique de l'opportunité reflète ces valeurs.",
  "TOOLTIP_SEVERITY": "La gravité est basée sur les valeurs Impact positif et Probabilité saisies. Par exemple, avec les valeurs par défaut, un impact positif de '2' et une probabilité de '4' donnent un niveau calculé de 2 dans la configuration de la matrice. Par conséquent, la gravité s'affiche comme '2-Moyen'. '2' reflète le niveau de l'opportunité et 'Moyen' représente la valeur de gravité respective.",
  "TOOLTIP_HEATMAP": "Image de la carte thermique affichant le placement de l'opportunité sur la grille.",
  "TOOLTIP_TYPE_OF": "Utilisé pour classifier les opportunités. Les valeurs comprennent Coût, Qualité, Technique, Ressource, Performance, Calendrier, Avantages, Fabricabilité et Autre.",
  "TOOLTIP_MATURITY_STATE": "Etat de maturité de l'opportunité. Les valeurs sont Brouillon, A faire, En traitement, En approbation ou Terminé.",
  "TOOLTIP_ORGANIZATION": "Organisation à laquelle appartient l'opportunité.",
  "TOOLTIP_COLLABORATIVE_SPACE": "Espace de collaboration dans lequel cette opportunité est créée."
}
