{
  "dropHere": "Déposer le contenu ici",
  "addObjectsDZ": "Ouvrir le contenu",
  "open": "Ouvrir",
  "revisionOfObjectDZ": "Ouvrir des révisions",
  "filterOfObjectDZ": "Filtrer et ouvrir",
  "searchButtonLabel": "Ouvrir un autre contenu",
  "searchButtonTip": "Ouvre le panneau de recherche pour sélectionner un objet à utiliser en comparaison",
  "revisionOfButtonLabel": "Ouvrir les révisions de {objname}",
  "revisionOfButtonTip": "Ouvre la boîte de dialogue des révisions pour sélectionner un objet à utiliser en comparaison",
  "usesEffectivityBasedRevisionsTip": "Ouvrez le panneau des filtres pour sélectionner une révision basée sur l'effectivité.",
  "filterOfButtonLabel": "Ouvrir le filtre de {objname}",
  "filterOfButtonTip": "Ouvre le panneau Filtres pour appliquer un filtre à un objet à utiliser pour la comparaison",
  "customizeButtonLabel": "Personnaliser la comparaison",
  "customizeButtonTip": "Ouvre un panneau permettant de définir des critères de correspondance personnalisés",
  "openCM": "Ouvrir un autre contenu",
  "revisionCM": "Remplacer par une révision",
  "filterCM": "Appliquer le filtre",
  "swapColumnsCM": "Permuter",
  "removeCM": "Supprimer",
  "swapColumnsTip": "Permuter l'ordre de la colonne",
  "swapColumnsDisabledTip": "Permuter l'ordre de la colonne non disponible en raison du filtre appliqué",
  "RemoveAll": "Effacer",
  "CancelButtonTip": "Efface les entrées de comparaison et recommence avec une page d'accueil vide",
  "CompareStructures": "Comparer",
  "CompareButtonTip": "Commence la comparaison des objets",
  "CantDropFilterOnRevisions": "Les révisions ne peuvent pas être ouvertes pour un objet de filtre. Cliquez sur OK pour ouvrir l'objet de filtre.",
  "RevisionsNotSupported": "Les révisions ne sont pas prises en charge pour cet objet. Cliquez sur OK pour ouvrir l'objet.",
  "FiltersNotSupported": "Les filtres ne sont pas pris en charge pour cet objet. Cliquez sur OK pour ouvrir l'objet.",
  "CompareWithItself": "Voulez-vous comparer {objname1} et {objname2} ? Ils sont identiques.",
  "CompareWithItselfNotAllowed": "Les deux objets sont identiques. Choisissez des objets différents pour cette opération",
  "CompareVDRPFilterNotSupported": "Ce type de filtre n'est pas pris en charge pour la comparaison",
  "CompareEffectivityBasedRevisions": "Cliquez sur OK pour ouvrir le panneau des filtres pour sélectionner une révision basée sur l'effectivité.",
  "PlatformChange": "La vue actuelle contient des objets d'une plate-forme 3DEXPERIENCE platform différente. Voulez-vous modifier la plate-forme (nécessite d'effacer la vue actuelle avant de charger les nouveaux objets) ?",
  "ChangeButton": "Modification",
  "CancelButton": "Annuler",
  "FilterBadgeTip": "Filtre appliqué",
  "selectFiveOrFewer": "La comparaison est actuellement limitée à cinq objets.",
  "alreadyLoaded": "Certains objets ont déjà été chargés.",
  "tenantMismatch": "Les objets comparés doit provenir du même tenant",
  "tenantChanged": "Changement de plate-forme",
  "BAD_DROP": "Echec de l'opération 'dépôt'",
  "OBJ_NOT_FOUND": "Objet introuvable. Il a peut-être été supprimé ou n'est plus accessible.",
  "OBJ_INACCESSIBLE": "Ce contenu n'est plus accessible ou a peut-être été supprimé",
  "STORED_OBJ_INACCESSIBLE": "Le contenu servant à initialiser la comparaison est inaccessible ou a peut-être été supprimé",
  "OBJ_TYPE_UNSUPPORTED": "Le type de l'objet {msgData} n'est pas pris en charge dans cette app",
  "noRevisionGraphSel": "Aucune sélection effectuée dans la boîte de dialogue Révisions",
  "rootRevisionGraphSel": "Un objet différent de l'objet de comparaison doit être sélectionné pour comparer à",
  "onlyOneObjForRevOf": "Ne faites glisser qu'un seul objet pour pouvoir sélectionner une révision dans la boîte de dialogue Révisions",
  "onlyOneObjForFilterOf": "Ne faites glisser qu'un seul objet pour pouvoir appliquer un filtre",
  "filtersNotSupported": "Les filtres ne sont pas pris en charge sur ce type d'objet",
  "MISSING ALERT MESSAGE": "Alerte inconnue"
}
