#dsbks NLS properties


dsbks.Streams.MissingParamter=O par\u00e2metro de entrada %1 est\u00e1 ausente.
dsbks.Streams.EmptyParamter=O par\u00e2metro de entrada %1 n\u00e3o pode estar vazio.
dsbks.Streams.NonArrayParamter=O par\u00e2metro de entrada %1 deve ser uma matriz de refer\u00eancias de objeto.
dsbks.Streams.NonObjectParamter=O par\u00e2metro de entrada %1 deve ser um objeto.
dsbks.Message.LimitedItems=S\u00f3 \u00e9 permitido um m\u00e1ximo de %1 objetos.
dsbks.Message.ObjectNotExist=O objeto em quest\u00e3o n\u00e3o existe ou voc\u00ea n\u00e3o tem acesso a ele.
dsbks.Message.ObjectsNotExist=Alguns objetos n\u00e3o existem ou o usu\u00e1rio n\u00e3o tem acesso a eles.
dsbks.Message.ObjectNotClassified=O objeto em quest\u00e3o n\u00e3o est\u00e1 marcado.
dsbks.Error.NotBookmark=As opera\u00e7\u00f5es de cria\u00e7\u00e3o em Pastas de Marcador legadas n\u00e3o s\u00e3o autorizadas.
dsbks.Error.NotValidBookmark=A Pasta de Marcador fornecida n\u00e3o existe (ou) o usu\u00e1rio n\u00e3o tem acesso ao objeto.
dsbks.Error.NotPublicItem=Apenas objetos p\u00fablicos podem ser usados em opera\u00e7\u00f5es de cria\u00e7\u00e3o.
dsbks.Message.Deleted=Pasta de Marcador exclu\u00edda com sucesso.
dsbks.Error.Invalid.inheritedAccess=O valor inv\u00e1lido de inheritedAccess foi passado.
dsbks.Error.NoCreateAccess=Voc\u00ea n\u00e3o tem acesso para criar uma Pasta de Marcador.

dsbks.Error.ObjectAlreadyConnected=Objetos j\u00e1 vinculados.
dsbks.Error.NoToconnectAccessOnContent=Voc\u00ea n\u00e3o tem a responsabilidade necess\u00e1ria no espa\u00e7o colaborativo de destino para anexar este objeto a uma Pasta de Favoritos.
dsbks.Error.NoTodisconnectAccessOnContent=Voc\u00ea n\u00e3o tem a responsabilidade necess\u00e1ria no espa\u00e7o colaborativo de destino para destacar este objeto de uma Pasta de Favoritos.
dsbks.Error.NoFromconnectAccessOnContent=Voc\u00ea n\u00e3o tem a responsabilidade necess\u00e1ria no espa\u00e7o colaborativo de destino para anexar um objeto a esta Pasta de Marcadores.
dsbks.Error.FromdisconnectAccessOnContent=Voc\u00ea n\u00e3o tem a responsabilidade necess\u00e1ria no espa\u00e7o colaborativo de destino para destacar um objeto desta Pasta de Marcadores.
dsbks.Error.TypeNotSupported=Este tipo de objeto n\u00e3o \u00e9 aceito.
dsbks.Error.RelationsNotFound=Rela\u00e7\u00e3o(\u00f5es) n\u00e3o encontrada(s). N\u00e3o \u00e9 poss\u00edvel remover o conte\u00fado.
dsbks.Error.LinkDoesNotExists=Pelo menos um link n\u00e3o est\u00e1 presente na Pasta de Marcador de origem.
dsbks.Error.InvalidReferencedType=Um valor inv\u00e1lido de referencedType foi passado.
