#dsbks NLS properties


dsbks.Streams.MissingParamter=\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u300c%1\u300d\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059
dsbks.Streams.EmptyParamter=\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u300c%1\u300d\u306f\u7a7a\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
dsbks.Streams.NonArrayParamter=\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u300c%1\u300d\u306f\u6709\u52b9\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u53c2\u7167\u306e\u914d\u5217\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093
dsbks.Streams.NonObjectParamter=\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u300c%1\u300d\u306f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093
dsbks.Message.LimitedItems=\u6700\u5927%1\u500b\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u307e\u3067\u304c\u8a31\u53ef\u3055\u308c\u307e\u3059
dsbks.Message.ObjectNotExist=\u6307\u5b9a\u3055\u308c\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u5b58\u5728\u3057\u307e\u305b\u3093(\u307e\u305f\u306f)\u30e6\u30fc\u30b6\u30fc\u306b\u306f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u3042\u308a\u307e\u305b\u3093
dsbks.Message.ObjectsNotExist=\u4e00\u90e8\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u5b58\u5728\u3057\u306a\u3044\u304b\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u3042\u308a\u307e\u305b\u3093
dsbks.Message.ObjectNotClassified=\u6307\u5b9a\u3055\u308c\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u306f\u30d6\u30c3\u30af\u30de\u30fc\u30af\u304c\u3042\u308a\u307e\u305b\u3093
dsbks.Error.NotBookmark=\u30ec\u30ac\u30b7\u30fc\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u3067\u306e\u30aa\u30fc\u30b5\u30ea\u30f3\u30b0\u64cd\u4f5c\u306e\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
dsbks.Error.NotValidBookmark=\u6307\u5b9a\u3055\u308c\u305f\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u306f\u5b58\u5728\u3057\u307e\u305b\u3093(\u307e\u305f\u306f)\u30e6\u30fc\u30b6\u30fc\u306b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u3042\u308a\u307e\u305b\u3093
dsbks.Error.NotPublicItem=\u30aa\u30fc\u30b5\u30ea\u30f3\u30b0\u64cd\u4f5c\u306b\u4f7f\u7528\u3067\u304d\u308b\u306e\u306f\u30d1\u30d6\u30ea\u30c3\u30af\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3060\u3051\u3067\u3059
dsbks.Message.Deleted=\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u304c\u6b63\u5e38\u306b\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
dsbks.Error.Invalid.inheritedAccess=\u7d99\u627f\u30a2\u30af\u30bb\u30b9\u6a29\u306e\u7121\u52b9\u306a\u5024\u304c\u6e21\u3055\u308c\u307e\u3057\u305f
dsbks.Error.NoCreateAccess=\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u3092\u4f5c\u6210\u3059\u308b\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u3042\u308a\u307e\u305b\u3093\u3002

dsbks.Error.ObjectAlreadyConnected=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u3059\u3067\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u3059
dsbks.Error.NoToconnectAccessOnContent=\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u306b\u3053\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u6dfb\u4ed8\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u30ec\u30b9\u30dd\u30f3\u30b7\u30d3\u30ea\u30c6\u30a3\u304c\u3001\u5bfe\u8c61\u306e\u30b3\u30e9\u30dc\u30ec\u30fc\u30b7\u30e7\u30f3\u30b9\u30da\u30fc\u30b9\u306b\u3042\u308a\u307e\u305b\u3093\u3002
dsbks.Error.NoTodisconnectAccessOnContent=\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u304b\u3089\u3053\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u9664\u53bb\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u30ec\u30b9\u30dd\u30f3\u30b7\u30d3\u30ea\u30c6\u30a3\u304c\u3001\u5bfe\u8c61\u306e\u30b3\u30e9\u30dc\u30ec\u30fc\u30b7\u30e7\u30f3\u30b9\u30da\u30fc\u30b9\u306b\u3042\u308a\u307e\u305b\u3093\u3002
dsbks.Error.NoFromconnectAccessOnContent=\u3053\u306e\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u306b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u6dfb\u4ed8\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u30ec\u30b9\u30dd\u30f3\u30b7\u30d3\u30ea\u30c6\u30a3\u304c\u3001\u5bfe\u8c61\u306e\u30b3\u30e9\u30dc\u30ec\u30fc\u30b7\u30e7\u30f3\u30b9\u30da\u30fc\u30b9\u306b\u3042\u308a\u307e\u305b\u3093\u3002
dsbks.Error.FromdisconnectAccessOnContent=\u3053\u306e\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u304b\u3089\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u5207\u308a\u96e2\u3059\u305f\u3081\u306b\u5fc5\u8981\u306a\u30ec\u30b9\u30dd\u30f3\u30b7\u30d3\u30ea\u30c6\u30a3\u304c\u3001\u5bfe\u8c61\u306e\u30b3\u30e9\u30dc\u30ec\u30fc\u30b7\u30e7\u30f3\u30b9\u30da\u30fc\u30b9\u306b\u3042\u308a\u307e\u305b\u3093\u3002
dsbks.Error.TypeNotSupported=\u3053\u306e\u30bf\u30a4\u30d7\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093
dsbks.Error.RelationsNotFound=\u30ea\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u9664\u53bb\u3067\u304d\u307e\u305b\u3093
dsbks.Error.LinkDoesNotExists=\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u30ea\u30f3\u30af\u304c\u30bd\u30fc\u30b9\u30d6\u30c3\u30af\u30de\u30fc\u30af\u30d5\u30a9\u30eb\u30c0\u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
dsbks.Error.InvalidReferencedType=\u7121\u52b9\u306areferencedType\u306e\u5024\u304c\u6e21\u3055\u308c\u307e\u3057\u305f
