#dsbks NLS properties


dsbks.Streams.MissingParamter=Le param\u00e8tre d'entr\u00e9e '%1' est manquant.
dsbks.Streams.EmptyParamter=Le param\u00e8tre d'entr\u00e9e '%1' ne peut pas \u00eatre vide.
dsbks.Streams.NonArrayParamter=Le param\u00e8tre d'entr\u00e9e '%1' doit \u00eatre un tableau de r\u00e9f\u00e9rences d'objet valides.
dsbks.Streams.NonObjectParamter=Le param\u00e8tre d'entr\u00e9e '%1' doit \u00eatre un objet.
dsbks.Message.LimitedItems=Nombre maximal d'objets autoris\u00e9s : %1.
dsbks.Message.ObjectNotExist=L'objet donn\u00e9 n'existe pas (ou) l'utilisateur n'a pas acc\u00e8s \u00e0 l'objet.
dsbks.Message.ObjectsNotExist=Certains objets n'existent pas (ou) l'utilisateur n'y a pas acc\u00e8s.
dsbks.Message.ObjectNotClassified=L'objet donn\u00e9 n'a pas de signet.
dsbks.Error.NotBookmark=Les op\u00e9rations de cr\u00e9ation sur les dossiers de signets h\u00e9rit\u00e9s ne sont pas autoris\u00e9es.
dsbks.Error.NotValidBookmark=Le dossier de signets donn\u00e9 n'existe pas (ou) l'utilisateur n'a pas acc\u00e8s \u00e0 l'objet.
dsbks.Error.NotPublicItem=Seuls les objets publics peuvent \u00eatre utilis\u00e9s pour les op\u00e9rations de cr\u00e9ation.
dsbks.Message.Deleted=Dossier de signets supprim\u00e9 avec succ\u00e8s.
dsbks.Error.Invalid.inheritedAccess=La valeur Acc\u00e8s h\u00e9rit\u00e9 transmise n'est pas valide.
dsbks.Error.NoCreateAccess=Vous ne disposez pas d'un acc\u00e8s permettant de cr\u00e9er un dossier de signets.

dsbks.Error.ObjectAlreadyConnected=Objet(s) d\u00e9j\u00e0 connect\u00e9(s).
dsbks.Error.NoToconnectAccessOnContent=Vous ne disposez pas de la responsabilit\u00e9 requise dans l'espace de collaboration cible pour joindre cet objet \u00e0 un dossier de signets.
dsbks.Error.NoTodisconnectAccessOnContent=Vous ne disposez pas de la responsabilit\u00e9 requise dans l'espace de collaboration cible pour d\u00e9tacher cet objet d'un dossier de signets
dsbks.Error.NoFromconnectAccessOnContent=Vous ne disposez pas de la responsabilit\u00e9 requise dans l'espace de collaboration cible pour joindre un objet \u00e0 ce dossier de signets.
dsbks.Error.FromdisconnectAccessOnContent=Vous ne disposez pas de la responsabilit\u00e9 requise dans l'espace de collaboration cible pour d\u00e9tacher un objet de ce dossier de signets.
dsbks.Error.TypeNotSupported=Ce type d'objet n'est pas pris en charge.
dsbks.Error.RelationsNotFound=Relations introuvables. Impossible d'enlever le contenu.
dsbks.Error.LinkDoesNotExists=Au moins un lien n'est pas pr\u00e9sent dans le dossier de signets source.
dsbks.Error.InvalidReferencedType=La valeur Type r\u00e9f\u00e9renc\u00e9 transmise n'est pas valide.
