#dsbks NLS properties


dsbks.Streams.MissingParamter=Brakuje parametru wej\u015bciowego '%1'.
dsbks.Streams.EmptyParamter=Parametr wej\u015bciowy '%1' nie mo\u017ce by\u0107 pusty.
dsbks.Streams.NonArrayParamter=Parametr wej\u015bciowy '%1' musi by\u0107 macierz\u0105 prawid\u0142owych odniesie\u0144 do obiekt\u00f3w.
dsbks.Streams.NonObjectParamter=Parametr wej\u015bciowy '%1' musi by\u0107 obiektem.
dsbks.Message.LimitedItems=Maksymalna dopuszczalna liczba obiekt\u00f3w wynosi %1.
dsbks.Message.ObjectNotExist=Podany obiekt nie istnieje (LUB) nie masz do niego dost\u0119pu.
dsbks.Message.ObjectsNotExist=Niekt\u00f3re obiekty nie istniej\u0105 (LUB) nie masz do nich dost\u0119pu.
dsbks.Message.ObjectNotClassified=Podany obiekt nie jest dodany do zak\u0142adki.
dsbks.Error.NotBookmark=Operacja tworzenia dla starszych folder\u00f3w zak\u0142adek jest niedozwolona.
dsbks.Error.NotValidBookmark=Podany folder zak\u0142adek nie istnieje (LUB) nie masz do niego dost\u0119pu.
dsbks.Error.NotPublicItem=Tylko publicznych obiekt\u00f3w mo\u017cna u\u017cywa\u0107 do operacji tworzenia.
dsbks.Message.Deleted=Pomy\u015blnie usuni\u0119to folder zak\u0142adek.
dsbks.Error.Invalid.inheritedAccess=Zosta\u0142a przekazana nieprawid\u0142owa warto\u015b\u0107 odziedziczonego dost\u0119pu.
dsbks.Error.NoCreateAccess=Nie masz dost\u0119pu do utworzenia folderu zak\u0142adek.

dsbks.Error.ObjectAlreadyConnected=Obiekty s\u0105 ju\u017c po\u0142\u0105czone.
dsbks.Error.NoToconnectAccessOnContent=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cego na do\u0142\u0105czenie obiektu do tego folderu zak\u0142adek.
dsbks.Error.NoTodisconnectAccessOnContent=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cego na usuni\u0119cie obiektu z tego folderu zak\u0142adek.
dsbks.Error.NoFromconnectAccessOnContent=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cego na za\u0142\u0105czenie obiektu do tego folderu zak\u0142adek.
dsbks.Error.FromdisconnectAccessOnContent=Nie masz wymaganego zakresu obowi\u0105zk\u00f3w w docelowym obszarze wsp\u00f3\u0142pracy pozwalaj\u0105cego na od\u0142\u0105czenie obiektu od tego folderu zak\u0142adek.
dsbks.Error.TypeNotSupported=Ten typ obiektu nie jest obs\u0142ugiwany.
dsbks.Error.RelationsNotFound=Nie znaleziono relacji. Nie mo\u017cna usun\u0105\u0107 zawarto\u015bci.
dsbks.Error.LinkDoesNotExists=W \u017ar\u00f3d\u0142owym folderze zak\u0142adek nie ma co najmniej jednego \u0142\u0105cza.
dsbks.Error.InvalidReferencedType=Zosta\u0142a przekazana nieprawid\u0142owa warto\u015b\u0107 rodzaju odniesienia.
